sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_read_remote_version_information_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_read_remote_version_information_rp0;

typedef PACKED(struct) hci_set_event_mask_cp0_s {
/**
 * Event mask. Default: 0x00001FFFFFFFFFFF
 * Flags:
 * - 0x0000000000000000: No events specified
 * - 0x0000000000000001: Inquiry Complete Event
 * - 0x0000000000000002: Inquiry Result Event
 * - 0x0000000000000004: Connection Complete Event
 * - 0x0000000000000008: Connection Request Event
 * - 0x0000000000000010: Disconnection Complete Event
 * - 0x0000000000000020: Authentication Complete Event
 * - 0x0000000000000040: Remote Name Request Complete Event
 * - 0x0000000000000080: Encryption Change Event
 * - 0x0000000000000100: Change Connection Link Key Complete Event
 * - 0x0000000000000200: Central Link Key Complete Event
 * - 0x0000000000000400: Read Remote Supported Features Complete Event
 * - 0x0000000000000800: Read Remote Version Information Complete Event
 * - 0x0000000000001000: QoS Setup Complete Event
 * - 0x0000000000008000: Hardware Error Event
 * - 0x0000000000010000: Flush Occurred Event
 * - 0x0000000000020000: Role Change Event
 * - 0x0000000000080000: Mode Change Event
 * - 0x0000000000100000: Return Link Keys Event
 * - 0x0000000000200000: PIN Code Request Event
 * - 0x0000000000400000: Link Key Request Event
 * - 0x0000000000800000: Link Key Notification Event
 * - 0x0000000001000000: Loopback Command Event
 * - 0x0000000002000000: Data Buffer Overflow Event
 * - 0x0000000004000000: Max Slots Change Event
 * - 0x0000000008000000: Read Clock Offset Complete Event
 * - 0x0000000010000000: Connection Packet Type Changed Event
 * - 0x0000000020000000: QoS Violation Event
 * - 0x0000000040000000: Page Scan Mode Change Event
 * - 0x0000000080000000: Page Scan Repetition Mode Change Event
 * - 0x0000000100000000: Flow Specification Complete Event
 * - 0x0000000200000000: Inquiry Result with RSSI Event
 * - 0x0000000400000000: Read Remote Extended Features Complete Event
 * - 0x0000080000000000: Synchronous Connection Complete Event
 * - 0x0000100000000000: Synchronous Connection Changed Event
 * - 0x0000200000000000: Sniff Subrating Event
 * - 0x0000400000000000: Extended Inquiry Result Event
 * - 0x0000800000000000: Encryption Key Refresh Complete Event
 * - 0x0001000000000000: IO Capability Request Event
 * - 0x0002000000000000: IO Capability Request Reply Event
 * - 0x0004000000000000: User Confirmation Request Event
 * - 0x0008000000000000: User Passkey Request Event
 * - 0x0010000000000000: Remote OOB Data Request Event
 * - 0x0020000000000000: Simple Pairing Complete Event
 * - 0x0080000000000000: Link Supervision Timeout Changed Event
 * - 0x0100000000000000: Enhanced Flush Complete Event
 * - 0x0400000000000000: User Passkey Notification Event
 * - 0x0800000000000000: Keypress Notification Event
 * - 0x1000000000000000: Remote Host Supported Features Notification Event
 * - 0x2000000000000000: LE Meta-Event
 */
  uint8_t Event_Mask[8];
} hci_set_event_mask_cp0;

typedef PACKED(struct) hci_set_event_mask_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_set_event_mask_rp0;

typedef PACKED(struct) hci_reset_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_reset_rp0;

typedef PACKED(struct) hci_read_connection_accept_timeout_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection Accept Timeout. Interval Length = N * 0.625 ms
 * Values:
 * - 0x0001 (0.625 ms)  ... 0xB540 (29000.000 ms) 
 */
  uint16_t Connection_Accept_Timeout;
} hci_read_connection_accept_timeout_rp0;

typedef PACKED(struct) hci_write_connection_accept_timeout_cp0_s {
/**
 * Connection Accept Timeout. Interval Length = N * 0.625 ms Default: 0x1FA0
 * Time = 5.06 s Mandatory Range for Controller: 0x00A0 to 0xB540
 * Values:
 * - 0x0001 (0.625 ms)  ... 0xB540 (29000.000 ms) 
 */
  uint16_t Connection_Accept_Timeout;
} hci_write_connection_accept_timeout_cp0;

typedef PACKED(struct) hci_write_connection_accept_timeout_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_write_connection_accept_timeout_rp0;

typedef PACKED(struct) hci_read_transmit_power_level_cp0_s {
/**
 * Specifies which Connection_Handle's Transmit Power Level setting to read.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Current or maximum transmit power level.
 * Values:
 * - 0x00: Read Current Transmit Power Level.
 * - 0x01: Read Maximum Transmit Power Level.
 */
  uint8_t Type;
} hci_read_transmit_power_level_cp0;

typedef PACKED(struct) hci_read_transmit_power_level_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Size: 1 Octet (signed integer) Units: dBm
 * Values:
 * - -30 ... 20
 */
  int8_t Transmit_Power_Level;
} hci_read_transmit_power_level_rp0;

typedef PACKED(struct) hci_read_afh_channel_assessment_mode_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Enable or disable channel assessment scheme.
 * Values:
 * - 0x00: DISABLED
 * - 0x01: ENABLED
 */
  uint8_t AFH_Channel_Assessment_Mode;
} hci_read_afh_channel_assessment_mode_rp0;

typedef PACKED(struct) hci_write_afh_channel_assessment_mode_cp0_s {
/**
 *
 * Values:
 * - 0x00: DISABLED
 * - 0x01: ENABLED
 */
  uint8_t AFH_Channel_Assessment_Mode;
} hci_write_afh_channel_assessment_mode_cp0;

typedef PACKED(struct) hci_write_afh_channel_assessment_mode_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_write_afh_channel_assessment_mode_rp0;

