sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_set_event_mask_page_2_cp0_s {
/**
 * For the complete list of bits that can be set, see Core v5.1, Vol 2, part E,
 * chapter 7.3.69. The only bit that is not ignored is: Bit 23: Authenticated
 * Payload Timeout Expired event.
 * Flags:
 * - 0x0000000000800000: AUTHENTICATED_PAYLOAD_TIMEOUT_EXPIRED_EVENT
 */
  uint8_t Event_Mask_Page_2[8];
} hci_set_event_mask_page_2_cp0;

typedef PACKED(struct) hci_set_event_mask_page_2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_set_event_mask_page_2_rp0;

typedef PACKED(struct) hci_read_authenticated_payload_timeout_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_read_authenticated_payload_timeout_cp0;

typedef PACKED(struct) hci_read_authenticated_payload_timeout_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Maximum amount of time specified between packets authenticated by a MIC. Time
 * = N * 10 ms.
 * Values:
 * - 0x0001 (10 ms)  ... 0xFFFF (655350 ms) 
 */
  uint16_t Authenticated_Payload_Timeout;
} hci_read_authenticated_payload_timeout_rp0;

typedef PACKED(struct) hci_write_authenticated_payload_timeout_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Maximum amount of time specified between packets authenticated by a valid
 * MIC. Time = N * 10 ms.
 * Values:
 * - 0x0001 (10 ms)  ... 0xFFFF (655350 ms) 
 */
  uint16_t Authenticated_Payload_Timeout;
} hci_write_authenticated_payload_timeout_cp0;

typedef PACKED(struct) hci_write_authenticated_payload_timeout_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_write_authenticated_payload_timeout_rp0;

typedef PACKED(struct) hci_read_local_version_information_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * See Bluetooth Assigned Numbers (https://www.bluetooth.org/en-
 * us/specification/assigned-numbers)
 */
  uint8_t HCI_Version;
/**
 * Revision of the Current HCI in the BR/EDR Controller.
 */
  uint16_t HCI_Revision;
/**
 * Version of the Current LMP or PAL in the Controller. See Bluetooth Assigned
 * Numbers (https://www.bluetooth.org/en-us/specification/assigned-numbers)
 */
  uint8_t LMP_PAL_Version;
/**
 * Manufacturer Name of the BR/EDR Controller. See Bluetooth Assigned Numbers
 * (https://www.bluetooth.org/en-us/specification/assigned-numbers)
 */
  uint16_t Manufacturer_Name;
/**
 * Subversion of the Current LMP or PAL in the Controller. This value is
 * implementation dependent.
 */
  uint16_t LMP_PAL_Subversion;
} hci_read_local_version_information_rp0;

typedef PACKED(struct) hci_read_local_supported_commands_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Bit mask for each HCI Command. If a bit is 1, the Controller supports the
 * corresponding command and the features required for the command. Unsupported
 * or undefined commands shall be set to 0.
 */
  uint8_t Supported_Commands[64];
} hci_read_local_supported_commands_rp0;

typedef PACKED(struct) hci_read_local_supported_features_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Bit Mask List of LMP features.
 */
  uint8_t LMP_Features[8];
} hci_read_local_supported_features_rp0;

typedef PACKED(struct) hci_read_bd_addr_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * BD_ADDR ( Bluetooth Device Address) of the Device.
 */
  uint8_t BD_ADDR[6];
} hci_read_bd_addr_rp0;

typedef PACKED(struct) hci_read_rssi_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_read_rssi_cp0;

typedef PACKED(struct) hci_read_rssi_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * N Size: 1 Octet (signed integer) Units: dBm
 * Values:
 * - -127 ... 20
 * - 127: RSSI not available
 */
  int8_t RSSI;
} hci_read_rssi_rp0;

typedef PACKED(struct) hci_le_set_event_mask_cp0_s {
/**
 * LE event mask. Default: 0x000000000000001F.
 * Flags:
 * - 0x0000000000000000: No LE events specified
 * - 0x0000000000000001: LE Connection Complete Event
 * - 0x0000000000000002: LE Advertising Report Event
 * - 0x0000000000000004: LE Connection Update Complete Event
 * - 0x0000000000000008: LE Read Remote Used Features Complete Event
 * - 0x0000000000000010: LE Long Term Key Request Event
 * - 0x0000000000000020: LE Remote Connection Parameter Request Event
 * - 0x0000000000000040: LE Data Length Change Event
 * - 0x0000000000000080: LE Read Local P-256 Public Key Complete Event
 * - 0x0000000000000100: LE Generate DHKey Complete Event
 * - 0x0000000000000200: LE Enhanced Connection Complete Event
 * - 0x0000000000000400: LE Directed Advertising Report Event
 * - 0x0000000000000800: LE PHY Update Complete event
 * - 0x0000000000001000: LE Extended Advertising Report event
 * - 0x0000000000002000: LE Periodic Advertising Sync Established event
 * - 0x0000000000004000: LE Periodic Advertising Report event
 * - 0x0000000000008000: LE Periodic Advertising Sync Lost event
 * - 0x0000000000010000: LE Scan Timeout event
 * - 0x0000000000020000: LE Advertising Set Terminated event
 * - 0x0000000000040000: LE Scan Request Received event
 * - 0x0000000000080000: LE Channel Selection Algorithm event
 * - 0x0000000000100000: LE Connectionless IQ Report event
 * - 0x0000000000200000: LE Connection IQ Report event
 * - 0x0000000000400000: LE CTE Request Failed event
 * - 0x0000000000800000: LE Periodic Advertising Sync Transfer Received event
 * - 0x0000000001000000: LE CIS Established event
 * - 0x0000000002000000: LE CIS Request event
 * - 0x0000000004000000: LE Create BIG Complete event
 * - 0x0000000008000000: LE Terminate BIG Complete event
 * - 0x0000000010000000: LE BIG Sync Established event
 * - 0x0000000020000000: LE BIG Sync Lost event
 * - 0x0000000040000000: LE Request Peer SCA Complete event
 * - 0x0000000080000000: LE Path Loss Threshold event
 * - 0x0000000100000000: LE Transmit Power Reporting event
 * - 0x0000000200000000: LE BIGInfo Advertising Report event
 * - 0x0000000400000000: LE Subrate Change event
 * - 0x0000000800000000: LE Periodic Advertising Sync Established event [v2]
 * - 0x0000001000000000: LE Periodic Advertising Report event [v2]
 * - 0x0000002000000000: LE Periodic Advertising Sync Transfer Received event [v2]
 * - 0x0000004000000000: LE Periodic Advertising Subevent Data Request event
 * - 0x0000008000000000: LE Periodic Advertising Response Report event
 * - 0x0000010000000000: LE Enhanced Connection Complete event [v2]
 */
  uint8_t LE_Event_Mask[8];
} hci_le_set_event_mask_cp0;

typedef PACKED(struct) hci_le_set_event_mask_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_event_mask_rp0;

typedef PACKED(struct) hci_le_read_buffer_size_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * 0x0000: No dedicated LE Buffer exists. Use the HCI_Read_Buffer_Size command.
 * 0x001B - 0xFFFF Maximum length (in octets) of the data portion of each HCI
 * ACL data packet.
 * Values:
 * - 0x0000: NO_BUFFER
 * - 0x001B ... 0xFFFF
 */
  uint16_t HC_LE_ACL_Data_Packet_Length;
/**
 * 0x00: No dedicated LE Buffer exists. Use the HCI_Read_Buffer_Size command.
 * 0x01 - 0xFF: Total number of HCI ACL Data Packets that can be stored in the
 * data buffers of the Controller.
 * Values:
 * - 0x00: NO_BUFFER
 * - 0x01 ... 0xFF
 */
  uint8_t HC_Total_Num_LE_ACL_Data_Packets;
} hci_le_read_buffer_size_rp0;

typedef PACKED(struct) hci_le_read_local_supported_features_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Bit Mask List of LE features. See Core v4.1, Vol. 6, Part B, Section 4.6.
 */
  uint8_t LE_Features[8];
} hci_le_read_local_supported_features_rp0;

typedef PACKED(struct) hci_le_set_random_address_cp0_s {
/**
 * Random Device Address.
 */
  uint8_t Random_Address[6];
} hci_le_set_random_address_cp0;

typedef PACKED(struct) hci_le_set_random_address_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_random_address_rp0;

typedef PACKED(struct) hci_le_set_advertising_parameters_cp0_s {
/**
 * Minimum advertising interval for undirected and low duty cycle directed
 * advertising. Time = N * 0.625 msec.
 * Values:
 * - 0x0020 (20.000 ms)  ... 0x4000 (10240.000 ms) 
 */
  uint16_t Advertising_Interval_Min;
/**
 * Maximum advertising interval. Time = N * 0.625 msec.
 * Values:
 * - 0x0020 (20.000 ms)  ... 0x4000 (10240.000 ms) 
 */
  uint16_t Advertising_Interval_Max;
/**
 * Advertising type.
 * Values:
 * - 0x00: ADV_IND (Connectable undirected advertising)
 * - 0x01: ADV_DIRECT_IND, high duty cycle (Connectable high duty cycle directed advertising)
 * - 0x02: ADV_SCAN_IND (Scannable undirected advertising)
 * - 0x03: ADV_NONCONN_IND (Non connectable undirected advertising)
 * - 0x04: ADV_DIRECT_IND, low duty cycle (Connectable low duty cycle directed advertising)
 */
  uint8_t Advertising_Type;
/**
 * Own address type.  - 0x00: Public Device Address  - 0x01 Random Device
 * Address  - 0x02: Controller generates Resolvable Private Address based on the
 * local          IRK from resolving list. If resolving list contains no
 * matching entry,          use public address.  - 0x03: Controller generates
 * Resolvable Private Address based on the local          IRK from resolving
 * list. If resolving list contains no matching entry,          use random
 * address from LE_Set_Random_Address.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Resolvable Private Address or Public Address
 * - 0x03: Resolvable Private Address or Random Address
 */
  uint8_t Own_Address_Type;
/**
 * Peer Address type.
 * Values:
 * - 0x00: Public Device Address or Public Identity Address
 * - 0x01: Random Device Address or Random (static) Identity Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
/**
 * Advertising channel map. Default: 00000111b (all channels enabled).
 * Flags:
 * - 0x01: ch 37
 * - 0x02: ch 38
 * - 0x04: ch 39
 */
  uint8_t Advertising_Channel_Map;
/**
 * Advertising Filter Policy. This parameter is ignored when directed
 * advertising is enabled.  0x00 Process scan and connection requests from all
 * devices (i.e., the Filter Accept List is not in use) 0x01 Process connection
 * requests from all devices and scan requests only from devices that are in the
 * Filter Accept List 0x02 Process scan requests from all devices and connection
 * requests only from devices that are in the Filter Accept List. 0x03 Process
 * scan and connection requests only from devices in the Filter Accept List. All
 * other values are reserved for future use
 * Values:
 * - 0x00: HCI_ADV_FILTER_NONE
 * - 0x01: HCI_ADV_FILTER_ACCEPT_LIST_SCAN
 * - 0x02: HCI_ADV_FILTER_ACCEPT_LIST_CONNECT
 * - 0x03: HCI_ADV_FILTER_ACCEPT_LIST_SCAN_CONNECT
 */
  uint8_t Advertising_Filter_Policy;
} hci_le_set_advertising_parameters_cp0;

typedef PACKED(struct) hci_le_set_advertising_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_advertising_parameters_rp0;

typedef PACKED(struct) hci_le_read_advertising_physical_channel_tx_power_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Size: 1 Octet (signed integer) Units: dBm Accuracy: +/- 4 dBm
 * Values:
 * - -20 ... 10
 */
  int8_t Transmit_Power_Level;
} hci_le_read_advertising_physical_channel_tx_power_rp0;

typedef PACKED(struct) hci_le_set_advertising_data_cp0_s {
/**
 * The number of significant octets in the following data field
 * Values:
 * - 0 ... 31
 */
  uint8_t Advertising_Data_Length;
/**
 * 31 octets of data formatted as defined in [Vol 3] Part C, Section 11.
 */
  uint8_t Advertising_Data[31];
} hci_le_set_advertising_data_cp0;

