sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_set_advertising_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_advertising_data_rp0;

typedef PACKED(struct) hci_le_set_scan_response_data_cp0_s {
/**
 * The number of significant octets in the following data field
 * Values:
 * - 0 ... 31
 */
  uint8_t Scan_Response_Data_Length;
/**
 * 31 octets of data formatted as defined in [Vol 3] Part C, Section 11.
 */
  uint8_t Scan_Response_Data[31];
} hci_le_set_scan_response_data_cp0;

typedef PACKED(struct) hci_le_set_scan_response_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_scan_response_data_rp0;

typedef PACKED(struct) hci_le_set_advertising_enable_cp0_s {
/**
 * Enable/disable advertise. Default is 0 (disabled).
 * Values:
 * - 0x00: Disable
 * - 0x01: Enable
 */
  uint8_t Advertising_Enable;
} hci_le_set_advertising_enable_cp0;

typedef PACKED(struct) hci_le_set_advertising_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_advertising_enable_rp0;

typedef PACKED(struct) hci_le_set_scan_parameters_cp0_s {
/**
 * Passive or active scanning. With active scanning SCAN_REQ packets are sent.
 * Values:
 * - 0x00: Passive Scanning
 * - 0x01: Active scanning
 */
  uint8_t LE_Scan_Type;
/**
 * This is defined as the time interval from when the Controller started its
 * last LE scan until it begins the subsequent LE scan. Time = N * 0.625 msec.
 * Values:
 * - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms) 
 */
  uint16_t LE_Scan_Interval;
/**
 * The duration of the LE scan. LE_Scan_Window shall be less than or equal to
 * LE_Scan_Interval. Time = N * 0.625 msec.
 * Values:
 * - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms) 
 */
  uint16_t LE_Scan_Window;
/**
 * Own address type.  - 0x00: Public Device Address  - 0x01 Random Device
 * Address  - 0x02: Controller generates Resolvable Private Address based on the
 * local          IRK from resolving list. If resolving list contains no
 * matching entry,          use public address.  - 0x03: Controller generates
 * Resolvable Private Address based on the local          IRK from resolving
 * list. If resolving list contains no matching entry,          use random
 * address from LE_Set_Random_Address.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Resolvable Private Address or Public Address
 * - 0x03: Resolvable Private Address or Random Address
 */
  uint8_t Own_Address_Type;
/**
 * See Scanning filter policy in Bluetooth Core specification.
 * Values:
 * - 0x00: Basic unfiltered scanning filter policy
 * - 0x01: Basic filtered scanning filter policy
 * - 0x02: Extended unfiltered scanning filter policy
 * - 0x03: Extended filtered scanning filter policy
 */
  uint8_t Scanning_Filter_Policy;
} hci_le_set_scan_parameters_cp0;

typedef PACKED(struct) hci_le_set_scan_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_scan_parameters_rp0;

typedef PACKED(struct) hci_le_set_scan_enable_cp0_s {
/**
 * Enable/disable scan. Default is 0 (disabled).
 * Values:
 * - 0x00: Scanning disabled
 * - 0x01: Scanning enabled
 */
  uint8_t LE_Scan_Enable;
/**
 * Enable/disable duplicate filtering.
 * Values:
 * - 0x00: Duplicate filtering disabled
 * - 0x01: Duplicate filtering enabled
 */
  uint8_t Filter_Duplicates;
} hci_le_set_scan_enable_cp0;

typedef PACKED(struct) hci_le_set_scan_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_scan_enable_rp0;

typedef PACKED(struct) hci_le_create_connection_cp0_s {
/**
 * This is defined as the time interval from when the Controller started its
 * last LE scan until it begins the subsequent LE scan. Time = N * 0.625 msec.
 * Values:
 * - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms) 
 */
  uint16_t LE_Scan_Interval;
/**
 * The duration of the LE scan. LE_Scan_Window shall be less than or equal to
 * LE_Scan_Interval. Time = N * 0.625 msec.
 * Values:
 * - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms) 
 */
  uint16_t LE_Scan_Window;
/**
 * 0x00 Filter Accept List is not used to determine which advertiser to connect
 * to. Peer_Address_Type and Peer_Address shall be used. 0x01 Filter Accept List
 * is used to determine which advertiser to connect to. Peer_Address_Type and
 * Peer_Address shall be ignored.
 * Values:
 * - 0x00: Filter Accept List not used
 * - 0x01: Filter Accept List used
 */
  uint8_t Initiator_Filter_Policy;
/**
 * 0x00 Public Device Address 0x01 Random Device Address 0x02 Public Identity
 * Address (Corresponds to Resolved Private Address) 0x03 Random (Static)
 * Identity Address (Corresponds to Resolved Private Address)
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Public Identity Address
 * - 0x03: Random (Static) Identity Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address or
 * Random (static) Identity Address of the advertising device.
 */
  uint8_t Peer_Address[6];
/**
 * Own address type.  - 0x00: Public Device Address  - 0x01 Random Device
 * Address  - 0x02: Controller generates Resolvable Private Address based on the
 * local          IRK from resolving list. If resolving list contains no
 * matching entry,          use public address.  - 0x03: Controller generates
 * Resolvable Private Address based on the local          IRK from resolving
 * list. If resolving list contains no matching entry,          use random
 * address from LE_Set_Random_Address.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Resolvable Private Address or Public Address
 * - 0x03: Resolvable Private Address or Random Address
 */
  uint8_t Own_Address_Type;
/**
 * Minimum value for the connection event interval. This shall be less than or
 * equal to Connection_Interval_Max. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Min;
/**
 * Maximum value for the connection event interval. This shall be greater than
 * or equal to Connection_Interval_Min. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Max;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Max_Latency;
/**
 * Supervision timeout for the LE Link. It shall be a multiple of 10 ms and
 * larger than (1 + connPeripheralLatency) * connInterval * 2. Time = N * 10
 * msec.
 * Values:
 * - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 */
  uint16_t Supervision_Timeout;
/**
 * The minimum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Min_CE_Length;
/**
 * The maximum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Max_CE_Length;
} hci_le_create_connection_cp0;

