sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_enable_encryption_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * 64 bit random number.
 */
  uint8_t Random_Number[8];
/**
 * 16 bit encrypted diversifier.
 */
  uint16_t Encrypted_Diversifier;
/**
 * 128 bit long term key.
 */
  uint8_t Long_Term_Key[16];
} hci_le_enable_encryption_cp0;

typedef PACKED(struct) hci_le_enable_encryption_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_enable_encryption_rp0;

typedef PACKED(struct) hci_le_long_term_key_request_reply_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * 128 bit long term key.
 */
  uint8_t Long_Term_Key[16];
} hci_le_long_term_key_request_reply_cp0;

typedef PACKED(struct) hci_le_long_term_key_request_reply_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_long_term_key_request_reply_rp0;

typedef PACKED(struct) hci_le_long_term_key_request_negative_reply_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_long_term_key_request_negative_reply_cp0;

typedef PACKED(struct) hci_le_long_term_key_request_negative_reply_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_long_term_key_request_negative_reply_rp0;

typedef PACKED(struct) hci_le_read_supported_states_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * State or state combination is supported by the Controller. See Core v4.1,
 * Vol.2, part E, Ch. 7.8.27.
 */
  uint8_t LE_States[8];
} hci_le_read_supported_states_rp0;

typedef PACKED(struct) hci_le_receiver_test_cp0_s {
/**
 *
 * Values:
 * - 0x00 ... 0x27: N = (F - 2402) / 2.Frequency Range : 2402 MHz to 2480 MHz
 */
  uint8_t RX_Frequency;
} hci_le_receiver_test_cp0;

typedef PACKED(struct) hci_le_receiver_test_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_receiver_test_rp0;

typedef PACKED(struct) hci_le_transmitter_test_cp0_s {
/**
 * N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
 * Values:
 * - 0x00 ... 0x27
 */
  uint8_t TX_Frequency;
/**
 * Length in bytes of payload data in each packet.     Supported ranges:       -
 * (0x00,0x25) if data length extension is disabled.       - (0x00,0xFF) if data
 * length extension is enabled.
 * Values:
 * - 0x00 ... 0xFF
 */
  uint8_t Length_Of_Test_Data;
/**
 * Content of the Payload of the test reference packets.  0: PRBS9 sequence
 * '11111111100000111101...' (in transmission order) 1: Repeated '11110000' (in
 * transmission order) sequence 2: Repeated '10101010' (in transmission order)
 * sequence 3: PRBS15 sequence 4: Repeated '11111111' (in transmission order)
 * sequence 5: Repeated '00000000' (in transmission order) sequence 6: Repeated
 * '00001111' (in transmission order) sequence 7: Repeated '01010101' (in
 * transmission order) sequence
 * Values:
 * - 0x00: PRBS9
 * - 0x01: Repeated '11110000'
 * - 0x02: Repeated '10101010'
 * - 0x03: PRBS15
 * - 0x04: Repeated '11111111'
 * - 0x05: Repeated '00000000'
 * - 0x06: Repeated '00001111'
 * - 0x07: Repeated '01010101'
 */
  uint8_t Packet_Payload;
} hci_le_transmitter_test_cp0;

typedef PACKED(struct) hci_le_transmitter_test_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_transmitter_test_rp0;

typedef PACKED(struct) hci_le_test_end_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Number of packets received.
 */
  uint16_t Number_Of_Packets;
} hci_le_test_end_rp0;

typedef PACKED(struct) hci_le_set_data_length_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Preferred maximum number of payload octets that the local Controller should
 * include in a single Link Layer Data Channel PDU. Range 0x001B-0x00FB (0x0000
 * - 0x001A and 0x00FC - 0xFFFF) Reserved for future use). Default: 27 bytes.
 * Values:
 * - 0x001B ... 0x00FB
 */
  uint16_t TxOctets;
/**
 * Preferred maximum number of microseconds that the local Controller should use
 * to transmit a single Link Layer Data Channel PDU. Range 0x0148-0x0848 (0x0000
 * - 0x0147 and 0x0849 - 0xFFFF Reserved for future use). Default: 328 bytes.
 * Values:
 * - 0x0148 ... 0x0848
 */
  uint16_t TxTime;
} hci_le_set_data_length_cp0;

typedef PACKED(struct) hci_le_set_data_length_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection_Handle to be used to identify a connection.
 */
  uint16_t Connection_Handle;
} hci_le_set_data_length_rp0;

typedef PACKED(struct) hci_le_read_suggested_default_data_length_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * The Host suggested value for the Controller maximum transmitted number of
 * payload octets to be used for new connections - connInitialMaxTxOctets. Range
 * 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for future use)
 * Default: 0x001B
 */
  uint16_t SuggestedMaxTxOctets;
/**
 * The Host suggested value for the Controller maximum packet transmission time
 * to be used for new connections - connInitialMaxTx-Time. Range 0x0148-0x0848
 * (0x0000 - 0x0147 and 0x0849 - 0xFFFF Reserved for future use) Default: 0x0148
 */
  uint16_t SuggestedMaxTxTime;
} hci_le_read_suggested_default_data_length_rp0;

typedef PACKED(struct) hci_le_write_suggested_default_data_length_cp0_s {
/**
 * The Host suggested value for the Controller maximum transmitted number of
 * payload octets to be used for new connections - connInitialMaxTxOctets. Range
 * 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for future use)
 * Values:
 * - 0x001B ... 0x00FB
 */
  uint16_t SuggestedMaxTxOctets;
/**
 * The Host suggested value for the Controller maximum packet transmission time
 * to be used for new connections - connInitialMaxTx-Time. Range 0x0148-0x0848
 * (0x0000 - 0x0147 and 0x0849 - 0xFFFF Reserved for future use)
 * Values:
 * - 0x0148 ... 0x0848
 */
  uint16_t SuggestedMaxTxTime;
} hci_le_write_suggested_default_data_length_cp0;

