sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_write_suggested_default_data_length_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_write_suggested_default_data_length_rp0;

typedef PACKED(struct) hci_le_read_local_p256_public_key_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_read_local_p256_public_key_rp0;

typedef PACKED(struct) hci_le_generate_dhkey_cp0_s {
/**
 * The remote P-256 public key: X, Y format Octets 31-0: X co-ordinate Octets
 * 63-32: Y co-ordinate Little Endian Format
 */
  uint8_t Remote_P256_Public_Key[64];
} hci_le_generate_dhkey_cp0;

typedef PACKED(struct) hci_le_generate_dhkey_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_generate_dhkey_rp0;

typedef PACKED(struct) hci_le_add_device_to_resolving_list_cp0_s {
/**
 * Identity address type.
 * Values:
 * - 0x00: Public Identity Address
 * - 0x01: Random (static) Identity Address
 */
  uint8_t Peer_Identity_Address_Type;
/**
 * Public or Random (static) Identity address of the peer device
 */
  uint8_t Peer_Identity_Address[6];
/**
 * IRK of the peer device
 */
  uint8_t Peer_IRK[16];
/**
 * IRK of the local device
 */
  uint8_t Local_IRK[16];
} hci_le_add_device_to_resolving_list_cp0;

typedef PACKED(struct) hci_le_add_device_to_resolving_list_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_add_device_to_resolving_list_rp0;

typedef PACKED(struct) hci_le_remove_device_from_resolving_list_cp0_s {
/**
 * Identity address type.
 * Values:
 * - 0x00: Public Identity Address
 * - 0x01: Random (static) Identity Address
 */
  uint8_t Peer_Identity_Address_Type;
/**
 * Public or Random (static) Identity address of the peer device
 */
  uint8_t Peer_Identity_Address[6];
} hci_le_remove_device_from_resolving_list_cp0;

typedef PACKED(struct) hci_le_remove_device_from_resolving_list_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_remove_device_from_resolving_list_rp0;

typedef PACKED(struct) hci_le_clear_resolving_list_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_clear_resolving_list_rp0;

typedef PACKED(struct) hci_le_read_resolving_list_size_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Number of address translation entries in the resolving list
 */
  uint8_t Resolving_List_Size;
} hci_le_read_resolving_list_size_rp0;

typedef PACKED(struct) hci_le_read_peer_resolvable_address_cp0_s {
/**
 * Identity address type.
 * Values:
 * - 0x00: Public Identity Address
 * - 0x01: Random (static) Identity Address
 */
  uint8_t Peer_Identity_Address_Type;
/**
 * Public or Random (static) Identity address of the peer device
 */
  uint8_t Peer_Identity_Address[6];
} hci_le_read_peer_resolvable_address_cp0;

typedef PACKED(struct) hci_le_read_peer_resolvable_address_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Resolvable Private Address being used by the peer device
 */
  uint8_t Peer_Resolvable_Address[6];
} hci_le_read_peer_resolvable_address_rp0;

typedef PACKED(struct) hci_le_read_local_resolvable_address_cp0_s {
/**
 * Identity address type.
 * Values:
 * - 0x00: Public Identity Address
 * - 0x01: Random (static) Identity Address
 */
  uint8_t Peer_Identity_Address_Type;
/**
 * Public or Random (static) Identity address of the peer device
 */
  uint8_t Peer_Identity_Address[6];
} hci_le_read_local_resolvable_address_cp0;

typedef PACKED(struct) hci_le_read_local_resolvable_address_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Resolvable Private Address being used by the local device
 */
  uint8_t Local_Resolvable_Address[6];
} hci_le_read_local_resolvable_address_rp0;

typedef PACKED(struct) hci_le_set_address_resolution_enable_cp0_s {
/**
 * Enable/disable address resolution in the controller. 0x00: Address Resolution
 * in controller disabled (default), 0x01: Address Resolution in controller
 * enabled
 * Values:
 * - 0x00: Address Resolution in controller disabled (default)
 * - 0x01: Address Resolution in controller enabled
 */
  uint8_t Address_Resolution_Enable;
} hci_le_set_address_resolution_enable_cp0;

typedef PACKED(struct) hci_le_set_address_resolution_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_address_resolution_enable_rp0;

typedef PACKED(struct) hci_le_set_resolvable_private_address_timeout_cp0_s {
/**
 * RPA_Timeout measured in seconds. Range for N: 0x0001 - 0x0E10 (1 sec - 1
 * hour) Default: N= 0x0384 (900 secs or 15 minutes)
 * Values:
 * - 0x0001 ... 0x0E10
 */
  uint16_t RPA_Timeout;
} hci_le_set_resolvable_private_address_timeout_cp0;

typedef PACKED(struct) hci_le_set_resolvable_private_address_timeout_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_resolvable_private_address_timeout_rp0;

typedef PACKED(struct) hci_le_read_maximum_data_length_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Maximum number of payload octets that the local Controller supports for
 * transmission of a single Link Layer Data Channel PDU. Range 0x001B-0x00FB
 * (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for future use)
 */
  uint16_t supportedMaxTxOctets;
/**
 * Maximum time, in microseconds, that the local Controller supports for
 * transmission of a single Link Layer Data Channel PDU. Range 0x0148-0x0848
 * (0x0000 - 0x0147 and 0x0849 - 0xFFFF Reserved for future use)
 */
  uint16_t supportedMaxTxTime;
/**
 * Maximum number of payload octets that the local Controller supports for
 * reception of a single Link Layer Data Channel PDU. Range 0x001B-0x00FB
 * (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for future use)
 */
  uint16_t supportedMaxRxOctets;
/**
 * Maximum time, in microseconds, that the local Controller supports for
 * reception of a single Link Layer Data Channel PDU. Range 0x0148-0x0848
 * (0x0000 - 0x0147 and 0x0849 - 0xFFFF Reserved for future use)
 */
  uint16_t supportedMaxRxTime;
} hci_le_read_maximum_data_length_rp0;

