sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_read_phy_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_read_phy_cp0;

typedef PACKED(struct) hci_le_read_phy_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection_Handle to be used to identify a connection.
 */
  uint16_t Connection_Handle;
/**
 * Transmitter PHY for the connection 0x01: The transmitter PHY for the
 * connection is LE 1M 0x02: The transmitter PHY for the connection is LE 2M
 * 0x03: The transmitter PHY for the connection is LE Coded
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t TX_PHY;
/**
 * Receiver PHY for the connection. 0x01: The receiver PHY for the connection is
 * LE 1M 0x02: The receiver PHY for the connection is LE 2M 0x03: The receiver
 * PHY for the connection is LE Coded All other values: Reserved for future use
 * Values:
 * - 0x01: The receiver PHY for the connection is LE 1M
 * - 0x02: The receiver PHY for the connection is LE 2M
 * - 0x03: The receiver PHY for the connection is LE Coded
 */
  uint8_t RX_PHY;
} hci_le_read_phy_rp0;

typedef PACKED(struct) hci_le_set_default_phy_cp0_s {
/**
 * The ALL_PHYS parameter is a bit field that allows the Host to specify, for
 * each direction, whether it has no preference among the PHYs that the
 * Controller supports in a given direction or whether it has specified
 * particular PHYs that it prefers in the TX_PHYS or RX_PHYS parameter. Bits: 0:
 * The Host has no preference among the transmitter PHYs supported by the
 * Controller 1: The Host has no preference among the receiver PHYs supported by
 * the Controller
 * Flags:
 * - 0x01: No preference for TX
 * - 0x02: No preference for RX
 */
  uint8_t ALL_PHYS;
/**
 * The TX_PHYS parameter is a bit field that indicates the transmitter PHYs that
 * the Host prefers the Controller to use. If the ALL_PHYS parameter specifies
 * that the Host has no preference, the TX_PHYS parameter is ignored; otherwise
 * at least one bit shall be set to 1. Bits: 0: The Host prefers to use the LE
 * 1M transmitter PHY (possibly among others) 1: The Host prefers to use the LE
 * 2M transmitter PHY (possibly among others) 2: The Host prefers to use the LE
 * Coded transmitter PHY (possibly among others) 3-7: Reserved for future use
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t TX_PHYS;
/**
 * The RX_PHYS parameter is a bit field that indicates the receiver PHYs that
 * the Host prefers the Controller to use. If the ALL_PHYS parameter specifies
 * that the Host has no preference, the RX_PHYS parameter is ignored; otherwise
 * at least one bit shall be set to 1. Bits: 0: The Host prefers to use the LE
 * 1M receiver PHY (possibly among others) 1: The Host prefers to use the LE 2M
 * receiver PHY (possibly among others) 2: The Host prefers to use the LE Coded
 * receiver PHY (possibly among others) 3-7: Reserved for future use
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t RX_PHYS;
} hci_le_set_default_phy_cp0;

typedef PACKED(struct) hci_le_set_default_phy_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_default_phy_rp0;

typedef PACKED(struct) hci_le_set_phy_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The ALL_PHYS parameter is a bit field that allows the Host to specify, for
 * each direction, whether it has no preference among the PHYs that the
 * Controller supports in a given direction or whether it has specified
 * particular PHYs that it prefers in the TX_PHYS or RX_PHYS parameter. Bits: 0:
 * The Host has no preference among the transmitter PHYs supported by the
 * Controller 1: The Host has no preference among the receiver PHYs supported by
 * the Controller
 * Flags:
 * - 0x01: No preference for TX
 * - 0x02: No preference for RX
 */
  uint8_t ALL_PHYS;
/**
 * The TX_PHYS parameter is a bit field that indicates the transmitter PHYs that
 * the Host prefers the Controller to use. If the ALL_PHYS parameter specifies
 * that the Host has no preference, the TX_PHYS parameter is ignored; otherwise
 * at least one bit shall be set to 1. Bits: 0: The Host prefers to use the LE
 * 1M transmitter PHY (possibly among others) 1: The Host prefers to use the LE
 * 2M transmitter PHY (possibly among others) 2: The Host prefers to use the LE
 * Coded transmitter PHY (possibly among others) 3-7: Reserved for future use
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t TX_PHYS;
/**
 * The RX_PHYS parameter is a bit field that indicates the receiver PHYs that
 * the Host prefers the Controller to use. If the ALL_PHYS parameter specifies
 * that the Host has no preference, the RX_PHYS parameter is ignored; otherwise
 * at least one bit shall be set to 1. Bits: 0: The Host prefers to use the LE
 * 1M receiver PHY (possibly among others) 1: The Host prefers to use the LE 2M
 * receiver PHY (possibly among others) 2: The Host prefers to use the LE Coded
 * receiver PHY (possibly among others) 3-7: Reserved for future use
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t RX_PHYS;
/**
 * The PHY_options parameter is a bit field that allows the Host to specify
 * options for PHYs. The default value for a new connection shall be all zero
 * bits. The Controller may override any preferred coding for transmitting on
 * the LE Coded PHY. The Host may specify a preferred coding even if it prefers
 * not to use the LE Coded transmitter PHY since the Controller may override the
 * PHY preference.  0 = the Host has no preferred coding when transmitting on
 * the LE Coded PHY 1 = the Host prefers that S=2 coding be used when
 * transmitting on the LE Coded PHY 2 = the Host prefers that S=8 coding be used
 * when transmitting on the LE Coded PHY
 * Values:
 * - 0: No preferred LE Coded PHY
 * - 1: S=2 preferred on LE Coded PHY
 * - 2: S=8 preferred on LE Coded PHY
 */
  uint16_t PHY_options;
} hci_le_set_phy_cp0;

typedef PACKED(struct) hci_le_set_phy_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_phy_rp0;

typedef PACKED(struct) hci_le_receiver_test_v2_cp0_s {
/**
 * Frequency Range : 2402 MHz to 2480 MHz N = (F - 2402) / 2.
 * Values:
 * - 0x00 ... 0x27: Frequency Range : 2402 MHz to 2480 MHz
 */
  uint8_t RX_Channel;
/**
 * PHY to be used by the receiver.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t PHY;
/**
 * The Modulation_Index parameter specifies whether or not the Controller should
 * assume the receiver has a stable modulation index.
 * Values:
 * - 0x00: Standard modulation index
 * - 0x01: Stable modulation index
 */
  uint8_t Modulation_index;
} hci_le_receiver_test_v2_cp0;

typedef PACKED(struct) hci_le_receiver_test_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_receiver_test_v2_rp0;

