sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_transmitter_test_v2_cp0_s {
/**
 * Frequency Range: 2402 MHz to 2480 MHz N = (F-2402) / 2
 * Values:
 * - 0x00 ... 0x27: Frequency Range: 2402 MHz to 2480 MHz
 */
  uint8_t TX_Channel;
/**
 * Length in bytes of payload data in each packet.     Supported ranges:       -
 * (0x00,0x25) if data length extension is disabled.       - (0x00,0xFF) if data
 * length extension is enabled.
 * Values:
 * - 0x00 ... 0xFF
 */
  uint8_t Length_Of_Test_Data;
/**
 * Content of the Payload of the test reference packets.  0: PRBS9 sequence
 * '11111111100000111101...' (in transmission order) 1: Repeated '11110000' (in
 * transmission order) sequence 2: Repeated '10101010' (in transmission order)
 * sequence 3: PRBS15 sequence 4: Repeated '11111111' (in transmission order)
 * sequence 5: Repeated '00000000' (in transmission order) sequence 6: Repeated
 * '00001111' (in transmission order) sequence 7: Repeated '01010101' (in
 * transmission order) sequence
 * Values:
 * - 0x00: PRBS9
 * - 0x01: Repeated '11110000'
 * - 0x02: Repeated '10101010'
 * - 0x03: PRBS15
 * - 0x04: Repeated '11111111'
 * - 0x05: Repeated '00000000'
 * - 0x06: Repeated '00001111'
 * - 0x07: Repeated '01010101'
 */
  uint8_t Packet_Payload;
/**
 * PHY to be used by the transmitter.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
} hci_le_transmitter_test_v2_cp0;

typedef PACKED(struct) hci_le_transmitter_test_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_transmitter_test_v2_rp0;

typedef PACKED(struct) hci_le_set_advertising_set_random_address_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * Random Device Address as defined by [Vol 6] Part B, Section 1.3.2
 */
  uint8_t Advertising_Random_Address[6];
} hci_le_set_advertising_set_random_address_cp0;

typedef PACKED(struct) hci_le_set_advertising_set_random_address_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_advertising_set_random_address_rp0;

typedef PACKED(struct) hci_le_set_extended_advertising_parameters_cp0_s {
/**
 * The Advertising_Handle parameter identifies the advertising set whose
 * parameters are being configured.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * The Advertising_Event_Properties parameter describes the type of advertising
 * event that is being configured and its basic properties. The type shall be
 * one supported by the Controller. Bits: 0 Connectable advertising 1 Scannable
 * advertising 2 Directed advertising 3 High Duty Cycle Directed Connectable
 * advertising (<= 3.75 ms Advertising Interval) 4 Use legacy advertising PDUs 5
 * Omit advertiser's address from all PDUs ("anonymous advertising") 6 Include
 * TxPower in the extended header of the advertising PDU
 * Flags:
 * - 0x0001: Connectable
 * - 0x0002: Scannable
 * - 0x0004: Directed
 * - 0x0008: HDC Directed Connectable
 * - 0x0010: Legacy
 * - 0x0020: Anonymous
 * - 0x0040: TxPower in ext header
 */
  uint16_t Advertising_Event_Properties;
/**
 * Minimum advertising interval for undirected and low duty cycle directed
 * advertising. Time = N * 0.625 ms; Time Range: 20 ms to 10,485.759375 s.
 * Values:
 * - 0x000020 (20.000 ms)  ... 0xFFFFFF (10485759.375 ms) 
 */
  uint8_t Primary_Advertising_Interval_Min[3];
/**
 * Maximum advertising interval for undirected and low duty cycle directed
 * advertising. Time = N * 0.625 ms; Time Range: 20 ms to 10,485.759375 s.
 * Values:
 * - 0x000020 (20.000 ms)  ... 0xFFFFFF (10485759.375 ms) 
 */
  uint8_t Primary_Advertising_Interval_Max[3];
/**
 * The Primary_Advertising_Channel_Map is a bit field that indicates the
 * advertising channels that shall be used when transmitting advertising
 * packets. At least one channel bit shall be set in the
 * Primary_Advertising_Channel_Map parameter.
 * Flags:
 * - 0x01: CH_37
 * - 0x02: CH_38
 * - 0x04: CH_39
 */
  uint8_t Primary_Advertising_Channel_Map;
/**
 * The Own_Address_Type parameter specifies the type of address being used in
 * the advertising packets. For random addresses, the address is specified by
 * the LE_Set_Advertising_Set_Random_Address command.  0x00 Public Device
 * Address 0x01 Random Device Address 0x02 Controller generates the Resolvable
 * Private Address based on the local IRK from the resolving list. If the
 * resolving list contains no matching entry, use the public address. 0x03
 * Controller generates the Resolvable Private Address based on the local IRK
 * from the resolving list. If the resolving list contains no matching entry,
 * use the random address from LE_Set_Advertising_Set_Random_Address. All other
 * values Reserved for future use
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Resolvable Private Address / Public Address
 * - 0x03: Resolvable Private Address / Random Address
 */
  uint8_t Own_Address_Type;
/**
 * Peer Address type
 * Values:
 * - 0x00: Public Device Address or Public Identity Address
 * - 0x01: Random Device Address or Random (static) Identity Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
/**
 * Advertising Filter Policy. This parameter is ignored when directed
 * advertising is enabled.  0x00 Process scan and connection requests from all
 * devices (i.e., the Filter Accept List is not in use) 0x01 Process connection
 * requests from all devices and scan requests only from devices that are in the
 * Filter Accept List 0x02 Process scan requests from all devices and connection
 * requests only from devices that are in the Filter Accept List. 0x03 Process
 * scan and connection requests only from devices in the Filter Accept List. All
 * other values are reserved for future use
 * Values:
 * - 0x00: HCI_ADV_FILTER_NONE
 * - 0x01: HCI_ADV_FILTER_ACCEPT_LIST_SCAN
 * - 0x02: HCI_ADV_FILTER_ACCEPT_LIST_CONNECT
 * - 0x03: HCI_ADV_FILTER_ACCEPT_LIST_SCAN_CONNECT
 */
  uint8_t Advertising_Filter_Policy;
/**
 * Units: dBm  The Advertising_Tx_Power parameter indicates the maximum power
 * level at which the advertising packets are to be transmitted on the
 * advertising channels. The Controller shall choose a power level lower than or
 * equal to the one specified by the Host.
 * Values:
 * - -127 ... 126
 * - 127: No preference
 */
  int8_t Advertising_Tx_Power;
/**
 * The Primary_Advertising_PHY parameter indicates the PHY on which the
 * advertising packets are transmitted on the primary advertising channel. If
 * legacy advertising PDUs are being used, the Primary_Advertising_PHY shall
 * indicate the LE 1M PHY.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t Primary_Advertising_PHY;
/**
 * The Secondary_Advertising_Max_Skip parameter is the maximum number of
 * advertising events that can be skipped before the AUX_ADV_IND can be sent.
 * 0x00 AUX_ADV_IND shall be sent prior to the next advertising event 0x01-0xFF
 * Maximum advertising events the Controller can skip before sending the
 * AUX_ADV_IND packets on the secondary advertising channel
 * Values:
 * - 0x00 ... 0xFF
 */
  uint8_t Secondary_Advertising_Max_Skip;
/**
 * The Secondary_Advertising_PHY parameter indicates the PHY on which the
 * advertising packets are transmitted on the secondary advertising channel.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t Secondary_Advertising_PHY;
/**
 * The Advertising_SID parameter specifies the value to be transmitted in the
 * Advertising SID subfield of the ADI field of the Extended Header of those
 * advertising channel PDUs that have an ADI field. If the advertising set only
 * uses PDUs that do not contain an ADI field, Advertising_SID is ignored.
 * Values:
 * - 0x00 ... 0x0F
 */
  uint8_t Advertising_SID;
/**
 * The Scan_Request_Notification_Enable parameter indicates whether the
 * Controller shall send notifications upon the receipt of a scan request PDU
 * that is in response to an advertisement from the specified advertising set
 * that contains its device address and is from a scanner that is allowed by the
 * advertising filter policy.
 * Values:
 * - 0x00: Scan request notifications disabled
 * - 0x01: Scan request notifications enabled
 */
  uint8_t Scan_Request_Notification_Enable;
} hci_le_set_extended_advertising_parameters_cp0;

typedef PACKED(struct) hci_le_set_extended_advertising_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Units: dBm. The Selected_Tx_Power return parameter indicates the transmit
 * power selected by the Controller. The Controller shall not change the
 * transmit power for this advertising set without being directed to by the
 * Host.
 * Values:
 * - -127 ... 126
 */
  int8_t Selected_Tx_Power;
} hci_le_set_extended_advertising_parameters_rp0;

