sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_set_extended_advertising_data_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * The Host may set the advertising data in one or more operations using this
 * parameter. 0x00: Intermediate fragment of fragmented extended advertising
 * data 0x01: First fragment of fragmented extended advertising data 0x02: Last
 * fragment of fragmented extended advertising data 0x03: Complete extended
 * advertising data 0x04: Unchanged data (just update the Advertising DID) All
 * other values: Reserved for future use
 * Values:
 * - 0x00: Intermediate fragment
 * - 0x01: First fragment
 * - 0x02: Last fragment
 * - 0x03: Complete data
 * - 0x04: Unchanged data
 */
  uint8_t Operation;
/**
 * The Fragment_Preference parameter provides a hint to the Controller as to
 * whether advertising data should be fragmented.
 * Values:
 * - 0x00: The Controller may fragment
 * - 0x01: The Controller should not fragment or should minimize fragmentation
 */
  uint8_t Fragment_Preference;
/**
 * The number of octets in the Advertising Data parameter
 * Values:
 * - 0 ... 251
 */
  uint8_t Advertising_Data_Length;
/**
 * Advertising data formatted as defined in [Vol 3] Part C, Section 11 Note:
 * This parameter has a variable length.
 */
  uint8_t Advertising_Data[(HCI_MAX_PAYLOAD_SIZE - 4)/sizeof(uint8_t)];
} hci_le_set_extended_advertising_data_cp0;

typedef PACKED(struct) hci_le_set_extended_advertising_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_extended_advertising_data_rp0;

typedef PACKED(struct) hci_le_set_extended_scan_response_data_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF: Used to identify an advertising set
 */
  uint8_t Advertising_Handle;
/**
 * The Host may set the scan response data in one or more operations using the
 * Operation parameter in the command. 0x00: Intermediate fragment of fragmented
 * scan response data 0x01: First fragment of fragmented scan response data
 * 0x02: Last fragment of fragmented scan response data 0x03: Complete scan
 * response data All other values: Reserved for future use
 * Values:
 * - 0x00: Intermediate fragment
 * - 0x01: First fragment
 * - 0x02: Last fragment
 * - 0x03: Complete data
 */
  uint8_t Operation;
/**
 * The Fragment_Preference parameter provides a hint to the Controller as to
 * whether advertising data should be fragmented.
 * Values:
 * - 0x00: The Controller may fragment all scan response data
 * - 0x01: The Controller should not fragment or should minimize fragmentation of
scan response data
 */
  uint8_t Fragment_Preference;
/**
 * The number of octets in the Scan_Response Data parameter
 * Values:
 * - 0x00 ... 0xFB: The number of octets in the Scan_Response Data parameter
 */
  uint8_t Scan_Response_Data_Length;
/**
 * Scan response data formatted as defined in [Vol 3] Part C, Section 11 Note:
 * This parameter has a variable length.
 */
  uint8_t Scan_Response_Data[(HCI_MAX_PAYLOAD_SIZE - 4)/sizeof(uint8_t)];
} hci_le_set_extended_scan_response_data_cp0;

typedef PACKED(struct) hci_le_set_extended_scan_response_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_extended_scan_response_data_rp0;

typedef PACKED(struct) hci_le_set_extended_advertising_enable_cp0_s {
/**
 * It allows to enable or disable one or more advertising sets using the
 * advertising sets identified by the Advertising_Handle[i] parameter.
 * Values:
 * - 0x00: Disable
 * - 0x01: Enable
 */
  uint8_t Enable;
/**
 * The Number_of_Sets parameter is the number of advertising sets contained in
 * the parameter arrays.
 * Values:
 * - 0x00: Disable all advertising sets
 * - 0x01 ... 0x3F: Number of advertising sets to enable or disable
 */
  uint8_t Number_of_Sets;
/**
 * See @ref Advertising_Set_Parameters_t
 */
  packed_Advertising_Set_Parameters_t Advertising_Set_Parameters[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(packed_Advertising_Set_Parameters_t)];
} hci_le_set_extended_advertising_enable_cp0;

typedef PACKED(struct) hci_le_set_extended_advertising_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_extended_advertising_enable_rp0;

typedef PACKED(struct) hci_le_read_maximum_advertising_data_length_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Maximum length of data supported by the Controller for use as advertisement
 * data or scan response data in an advertising event or as periodic
 * advertisement data.
 * Values:
 * - 0x001F ... 0x0672: Maximum supported advertising data length
 */
  uint16_t Maximum_Advertising_Data_Length;
} hci_le_read_maximum_advertising_data_length_rp0;

typedef PACKED(struct) hci_le_read_number_of_supported_advertising_sets_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Maximum number of advertising sets supported by the advertising Controller at
 * the same time.
 * Values:
 * - 0x01 ... 0xF0: Number of advertising sets supported at the same time
 */
  uint8_t Num_Supported_Advertising_Sets;
} hci_le_read_number_of_supported_advertising_sets_rp0;

typedef PACKED(struct) hci_le_remove_advertising_set_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF: Used to identify an advertising set
 */
  uint8_t Advertising_Handle;
} hci_le_remove_advertising_set_cp0;

typedef PACKED(struct) hci_le_remove_advertising_set_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_remove_advertising_set_rp0;

