sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_clear_advertising_sets_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_clear_advertising_sets_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_parameters_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF: Used to identify a periodic advertisement
 */
  uint8_t Advertising_Handle;
/**
 * Minimum advertising interval for periodic advertising. Time = N * 1.25 ms;
 * Time Range: 7.5ms to 81.91875 s.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 */
  uint16_t Periodic_Advertising_Interval_Min;
/**
 * Maximum advertising interval for periodic advertising. Time = N * 1.25 ms;
 * Time Range: 7.5ms to 81.91875 s.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 */
  uint16_t Periodic_Advertising_Interval_Max;
/**
 * The Periodic_Advertising_Properties parameter indicates which fields should
 * be included in the advertising packet.
 * Flags:
 * - 0x0040: Include TxPower in the advertising PDU
 */
  uint16_t Periodic_Advertising_Properties;
} hci_le_set_periodic_advertising_parameters_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_periodic_advertising_parameters_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_data_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF: Used to identify an advertising set
 */
  uint8_t Advertising_Handle;
/**
 * The Host may set the periodic advertising data in one or more operations
 * using the Operation parameter in the command.
 * Values:
 * - 0x00: Intermediate fragment of fragmented periodic advertising data
 * - 0x01: First fragment of fragmented periodic advertising data
 * - 0x02: Last fragment of fragmented periodic advertising data
 * - 0x03: Complete periodic advertising data
 */
  uint8_t Operation;
/**
 * The number of octets in the Advertising Data parameter
 * Values:
 * - 0 ... 252: The number of octets in the Advertising Data parameter
 */
  uint8_t Advertising_Data_Length;
/**
 * Periodic advertising data formatted as defined in [Vol 3] Part C, Section 11.
 * Note: This parameter has a variable length.
 */
  uint8_t Advertising_Data[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint8_t)];
} hci_le_set_periodic_advertising_data_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_periodic_advertising_data_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_enable_cp0_s {
/**
 * It is used to enabled advertising and include ADI field. If bit 0 is set,
 * enable periodic advertising. if bit 1 is set, Include the ADI field in
 * AUX_SYNC_IND PDUs.
 * Flags:
 * - 0x01: ENABLE_PERIODIC_ADV
 * - 0x02: INCLUDE_ADI_FIELD
 */
  uint8_t Enable;
/**
 * Used to identify an advertising set.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
} hci_le_set_periodic_advertising_enable_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_periodic_advertising_enable_rp0;

typedef PACKED(struct) hci_le_set_extended_scan_parameters_cp0_s {
/**
 * The Own_Address_Type parameter indicates the type of address being used in
 * the scan request packets.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
 * - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from LE_Set_Random_Address.
 */
  uint8_t Own_Address_Type;
/**
 * 0x00 Accept all advertisement packets. Directed advertising packets which are
 * not addressed for this device shall be ignored. 0x01 Ignore advertisement
 * packets from devices not in the Filter Accept List Only. Directed advertising
 * packets which are not addressed for this device shall be ignored 0x02 Accept
 * all undirected advertisement packets. Directed advertisement packets where
 * initiator address is a RPA and  Directed advertisement packets addressed to
 * this device shall be accepted. 0x03 Accept all undirected advertisement
 * packets from devices that are in the Filter Accept List.Directed
 * advertisement packets where initiator address is RPA and Directed
 * advertisement packets addressed to this device shall be accepted.
 * Values:
 * - 0x00: Accept all
 * - 0x01: Ignore devices not in the Filter Accept List
 * - 0x02: Accept all (use resolving list)
 * - 0x03: Ignore devices not in the Filter Accept List (use resolving list)
 */
  uint8_t Scanning_Filter_Policy;
/**
 * The Scanning_PHYs parameter indicates the PHY(s) on which the advertising
 * packets should be received on the primary advertising channel. The Host may
 * enable one or more scanning PHYs.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t Scanning_PHYs;
/**
 * See @ref Extended_Scan_Parameters_t
 */
  packed_Extended_Scan_Parameters_t Extended_Scan_Parameters[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(packed_Extended_Scan_Parameters_t)];
} hci_le_set_extended_scan_parameters_cp0;

typedef PACKED(struct) hci_le_set_extended_scan_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_extended_scan_parameters_rp0;

typedef PACKED(struct) hci_le_set_extended_scan_enable_cp0_s {
/**
 * The Enable parameter determines whether scanning is enabled or disabled. If
 * it is disabled, the remaining parameters are ignored.
 * Values:
 * - 0x00: Scanning disabled
 * - 0x01: Scanning enabled
 */
  uint8_t Enable;
/**
 * The Filter_Duplicates parameter controls whether the Link Layer should filter
 * out duplicate advertising reports (filtering duplicates enabled) to the Host
 * or if the Link Layer should generate advertising reports for each packet
 * received (filtering duplicates disabled). See [Vol 6] Part B, Section
 * 4.4.3.5.
 * Values:
 * - 0x00: Duplicate filtering disabled
 * - 0x01: Duplicate filtering enabled
 * - 0x02: Duplicate filtering enabled, reset for each scan period
 */
  uint8_t Filter_Duplicates;
/**
 * Scan duration. Time = N * 10 ms; Time Range: 10 ms to 655.35 s.
 * Values:
 * - 0x0000 (0.000 ms) : Scan continuously until explicitly disable
 * - 0x0001 (0.625 ms)  ... 0xFFFF (40959.375 ms) : Scan duration
 */
  uint16_t Duration;
/**
 * Time interval from when the Controller started its last Scan_Duration until
 * it begins the subsequent Scan_Duration. Time = N * 1.28 sec; Time Range: 1.28
 * s to 83,884.8 s.
 * Values:
 * - 0x0000: Periodic scanning disabled
 * - 0x0001 ... 0xFFFF: Time interval from when the Controller started its last Scan_Duration
until it begins the subsequent Scan_Duration
 */
  uint16_t Period;
} hci_le_set_extended_scan_enable_cp0;

typedef PACKED(struct) hci_le_set_extended_scan_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_extended_scan_enable_rp0;

typedef PACKED(struct) hci_le_extended_create_connection_cp0_s {
/**
 * The Initiator_Filter_Policy parameter is used to determine whether the Filter
 * Accept List is used. If the Filter Accept List is not used, the
 * Peer_Address_Type and the Peer_Address parameters specify the address type
 * and address of the advertising device to connect to. 0x00 - Filter Accept
 * List is not used to determine which advertiser to connect to.
 * Peer_Address_Type and Peer_Address shall be used. 0x01 - Filter Accept List
 * is used to determine which advertiser to connect to. Peer_Address_Type and
 * Peer_Address shall be ignored.
 * Values:
 * - 0x00: FILTER_ACCEPT_LIST_NOT_USED
 * - 0x01: FILTER_ACCEPT_LIST_USED
 */
  uint8_t Initiator_Filter_Policy;
/**
 * The Own_Address_Type parameter indicates the type of address being used in
 * the connection request packets.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
 * - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from the most recent successful
LE_Set_Random_Address Command.
 */
  uint8_t Own_Address_Type;
/**
 * The Peer_Address_Type parameter indicates the type of address used in the
 * connectable advertisement sent by the peer. 0x00: Public Device Address or
 * Public Identity Address 0x01: Random Device Address or Random (static)
 * Identity Address
 * Values:
 * - 0x00: Public Address
 * - 0x01: Random Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
/**
 * The Initiating_PHYs parameter indicates the PHY(s) on which the advertising
 * packets should be received on the primary advertising channel and the PHYs
 * for which connection parameters have been specified. The Host may enable one
 * or more initiating PHYs. 0x01: Scan connectable advertisements on the LE 1M
 * PHY. Connection parameters for the LE 1M PHY are provided. 0x02: Connection
 * parameters for the LE 2M PHY are provided 0x04: Scan connectable
 * advertisements on the LE Coded PHY. Connection parameters for the LE Coded
 * PHY are provided.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t Initiating_PHYs;
/**
 * See @ref Extended_Create_Connection_Parameters_t
 */
  packed_Extended_Create_Connection_Parameters_t Extended_Create_Connection_Parameters[(HCI_MAX_PAYLOAD_SIZE - 10)/sizeof(packed_Extended_Create_Connection_Parameters_t)];
} hci_le_extended_create_connection_cp0;

typedef PACKED(struct) hci_le_extended_create_connection_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_extended_create_connection_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_create_sync_cp0_s {
/**
 * The Options parameter is a bitmask used to determine whether the Periodic
 * Advertiser List is used, whether HCI_LE_Periodic_Advertising_Report events
 * for this periodic advertising train are initially enabled or disabled, and
 * whether duplicate reports are filtered or not. If bit 0 is 0: use the
 * Advertising_SID, Advertiser_Address_Type, and Advertiser_Address parameters
 * to determine which advertiser to listen to. If bit 0 is 1: use the Periodic
 * Advertiser List to determine which advertiser to listen to. If bit 1 is 0,
 * reporting is initially enabled, otherwise it is enabled. If bit 2 is 0,
 * duplicate filtering is initially disabled, otherwise it is enabled.
 * Flags:
 * - 0x01: USE_PERIODIC_ADV_LIST
 * - 0x02: DISABLE_REPORTING
 * - 0x04: ENABLE_DUPLICATE_FILTERING
 */
  uint8_t Options;
/**
 * The Advertising_SID parameter, if used, specifies the value that must match
 * the Advertising SID subfield in the ADI field of the received advertisement
 * for it to be used to synchronize.
 * Values:
 * - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
Advertising
 */
  uint8_t Advertising_SID;
/**
 * Advertising address type
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 */
  uint8_t Advertiser_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the advertiser
 */
  uint8_t Advertiser_Address[6];
/**
 * The Skip parameter specifies the number of consecutive periodic advertising
 * packets that the receiver may skip after successfully receiving a periodic
 * advertising packet.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Skip;
/**
 * Synchronization timeout for the periodic advertising train. Time = N*10 ms.
 * Values:
 * - 0x000A (100 ms)  ... 0x4000 (163840 ms) 
 */
  uint16_t Sync_Timeout;
/**
 * The Sync_CTE_Type parameter specifies whether to only synchronize to periodic
 * advertising with certain types of Constant Tone Extension (a value of 0
 * indicates that the presence or absence of a Constant Tone Extension is
 * irrelevant). If the periodic advertising has the wrong type of Constant Tone
 * Extension then: - If bit 0 of Options is set, the Controller shall ignore
 * this address and SID and continue to search for other periodic
 * advertisements. - Otherwise, the Controller shall cancel the synchronization
 * with the error code Unsupported Remote Feature/Unsupported LMP Feature
 * (0x1A).
 * Flags:
 * - 0x01: Do not sync to packets with an AoA Constant Tone Extension
 * - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecondslots
 * - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microsecondsslots
 * - 0x08: Do not sync to packets with a type 3 Constant Tone Extension (currentlyreserved for future use)
 * - 0x10: Do not sync to packets without a Constant Tone Extension
 */
  uint8_t Sync_CTE_Type;
} hci_le_periodic_advertising_create_sync_cp0;

