sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_receiver_test_v3_cp0_s {
/**
 *
 * Values:
 * - 0x00 ... 0x27: N = (F - 2402) / 2.Frequency Range : 2402 MHz to 2480 MHz
 */
  uint8_t RX_Channel;
/**
 * PHY to be used by the receiver.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t PHY;
/**
 *
 * Values:
 * - 0x00: Assume transmitter will have a standard modulation index
 * - 0x01: Assume transmitter will have a stable modulation index
 */
  uint8_t Modulation_Index;
/**
 *
 * Values:
 * - 0x00: No Constant Tone Extension expected (default)
 * - 0x02 ... 0x14: Expected length of the Constant Tone Extension in 8 microseconds units.
 */
  uint8_t Expected_CTE_Length;
/**
 *
 * Values:
 * - 0x00: Expect AoA Constant Tone Extension
 * - 0x01: Expect AoD Constant Tone Extension with 1 microsecond slots
 * - 0x02: Expect AoD Constant Tone Extension with 2 microseconds slots
 */
  uint8_t Expected_CTE_Type;
/**
 * Sampling rate used by the Controller.
 * Values:
 * - 0x01: CTE_SLOT_1us
 * - 0x02: CTE_SLOT_2us
 */
  uint8_t Slot_Durations;
/**
 *
 * Values:
 * - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
 */
  uint8_t Switching_Pattern_Length;
/**
 * List of Antenna IDs in the pattern
 */
  uint8_t Antenna_IDs[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} hci_le_receiver_test_v3_cp0;

typedef PACKED(struct) hci_le_receiver_test_v3_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_receiver_test_v3_rp0;

typedef PACKED(struct) hci_le_transmitter_test_v3_cp0_s {
/**
 * N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
 * Values:
 * - 0x00 ... 0x27
 */
  uint8_t TX_Channel;
/**
 * Length in bytes of payload data in each packet.     Supported ranges:       -
 * (0x00,0x25) if data length extension is disabled.       - (0x00,0xFF) if data
 * length extension is enabled.
 * Values:
 * - 0x00 ... 0xFF
 */
  uint8_t Test_Data_Length;
/**
 * Content of the Payload of the test reference packets.  0: PRBS9 sequence
 * '11111111100000111101...' (in transmission order) 1: Repeated '11110000' (in
 * transmission order) sequence 2: Repeated '10101010' (in transmission order)
 * sequence 3: PRBS15 sequence 4: Repeated '11111111' (in transmission order)
 * sequence 5: Repeated '00000000' (in transmission order) sequence 6: Repeated
 * '00001111' (in transmission order) sequence 7: Repeated '01010101' (in
 * transmission order) sequence
 * Values:
 * - 0x00: PRBS9
 * - 0x01: Repeated '11110000'
 * - 0x02: Repeated '10101010'
 * - 0x03: PRBS15
 * - 0x04: Repeated '11111111'
 * - 0x05: Repeated '00000000'
 * - 0x06: Repeated '00001111'
 * - 0x07: Repeated '01010101'
 */
  uint8_t Packet_Payload;
/**
 * PHY to be used by the transmitter.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
/**
 *
 * Values:
 * - 0x00: No Constant Tone Extension expected (default)
 * - 0x02 ... 0x14: Expected length of the Constant Tone Extension in 8 microseconds units.
 */
  uint8_t CTE_Length;
/**
 *
 * Values:
 * - 0x00: Expect AoA Constant Tone Extension
 * - 0x01: Expect AoD Constant Tone Extension with 1 microsecond slots
 * - 0x02: Expect AoD Constant Tone Extension with 2 microseconds slots
 */
  uint8_t CTE_Type;
/**
 * The number of Antenna IDs in the pattern.
 * Values:
 * - 0x02 ... 0x4B
 */
  uint8_t Switching_Pattern_Length;
/**
 * List of Antenna IDs in the pattern
 */
  uint8_t Antenna_IDs[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} hci_le_transmitter_test_v3_cp0;

typedef PACKED(struct) hci_le_transmitter_test_v3_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_transmitter_test_v3_rp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_parameters_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 *
 * Values:
 * - 0x02 ... 0x14: Constant Tone Extension length in 8 microseconds units
 */
  uint8_t CTE_Length;
/**
 *
 * Values:
 * - 0x00: AoA Constant Tone Extension
 * - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 * - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 */
  uint8_t CTE_Type;
/**
 * The CTE_Count parameter specifies how many packets with a Constant Tone
 * Extension are to be transmitted in each periodic advertising event. If the
 * number of packets that would otherwise be transmitted is less than this, the
 * Controller shall transmit sufficient AUX_CHAIN_IND PDUs with no AdvData to
 * make up the number. However, if a change in circumstances since this command
 * was issued means that the Controller can no longer schedule all of these
 * packets, it should transmit as many as possible.
 * Values:
 * - 0x01 ... 0x10: The number of Constant Tone Extensions to transmit in each periodic advertising interval
 */
  uint8_t CTE_Count;
/**
 *
 * Values:
 * - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
 */
  uint8_t Switching_Pattern_Length;
/**
 * List of Antenna IDs in the pattern
 */
  uint8_t Antenna_IDs[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(uint8_t)];
} hci_le_set_connectionless_cte_transmit_parameters_cp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_connectionless_cte_transmit_parameters_rp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_enable_cp0_s {
/**
 * Identifier for the advertising set in which Constant Tone Extension is being
 * enabled or disabled
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * It enables or disables the use of Constant Tone Extensions.
 * Values:
 * - 0x00: Advertising with Constant Tone Extension is disabled (default)
 * - 0x01: Advertising with Constant Tone Extension is enabled
 */
  uint8_t CTE_Enable;
} hci_le_set_connectionless_cte_transmit_enable_cp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_connectionless_cte_transmit_enable_rp0;

typedef PACKED(struct) hci_le_set_connectionless_iq_sampling_enable_cp0_s {
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * If the Sampling_Enable parameter is set to 0x01 (sampling is enabled), the
 * Controller starts attempting to capture IQ samples from the periodic
 * advertisements.
 * Values:
 * - 0x00: DISABLE
 * - 0x01: ENABLE
 */
  uint8_t Sampling_Enable;
/**
 * Sampling rate used by the Controller.
 * Values:
 * - 0x01: CTE_SLOT_1us
 * - 0x02: CTE_SLOT_2us
 */
  uint8_t Slot_Durations;
/**
 * It specifies the maximum number of Constant Tone Extensions in each periodic
 * advertising event that the Controller should collect and report IQ samples
 * from. The Controller should sample all Constant Tone Extensions up to this
 * number.
 * Values:
 * - 0x00: REPORT_ALL_CTES
 * - 0x01 ... 0x10
 */
  uint8_t Max_Sampled_CTEs;
/**
 * The number of Antenna IDs in the pattern.
 * Values:
 * - 0x02 ... 0x4B
 */
  uint8_t Switching_Pattern_Length;
/**
 * List of Antenna IDs in the pattern
 */
  uint8_t Antenna_IDs[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} hci_le_set_connectionless_iq_sampling_enable_cp0;

typedef PACKED(struct) hci_le_set_connectionless_iq_sampling_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
} hci_le_set_connectionless_iq_sampling_enable_rp0;

typedef PACKED(struct) hci_le_set_connection_cte_receive_parameters_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 *
 * Values:
 * - 0x00: Connection IQ sampling is disabled (default)
 * - 0x01: Connection IQ sampling is enabled
 */
  uint8_t Sampling_Enable;
/**
 * Sampling rate used by the Controller.
 * Values:
 * - 0x01: CTE_SLOT_1us
 * - 0x02: CTE_SLOT_2us
 */
  uint8_t Slot_Durations;
/**
 *
 * Values:
 * - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
 */
  uint8_t Switching_Pattern_Length;
/**
 * List of Antenna IDs in the pattern
 */
  uint8_t Antenna_IDs[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(uint8_t)];
} hci_le_set_connection_cte_receive_parameters_cp0;

typedef PACKED(struct) hci_le_set_connection_cte_receive_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_set_connection_cte_receive_parameters_rp0;

typedef PACKED(struct) hci_le_set_connection_cte_transmit_parameters_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 *
 * Flags:
 * - 0x01: Allow AoA Constant Tone Extension Response
 * - 0x02: Allow AoD Constant Tone Extension Response with 1 microsecond slots
 * - 0x04: Allow AoD Constant Tone Extension Response with 2 microseconds slots
 */
  uint8_t CTE_Type;
/**
 *
 * Values:
 * - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
 */
  uint8_t Switching_Pattern_Length;
/**
 * List of Antenna IDs in the pattern
 */
  uint8_t Antenna_IDs[(HCI_MAX_PAYLOAD_SIZE - 4)/sizeof(uint8_t)];
} hci_le_set_connection_cte_transmit_parameters_cp0;

