sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_set_connection_cte_transmit_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_set_connection_cte_transmit_parameters_rp0;

typedef PACKED(struct) hci_le_connection_cte_request_enable_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * If it is set to 0x00, the remaining parameters shall be ignored.
 * Values:
 * - 0x00: Disable Constant Tone Extension Request for the connection (default)
 * - 0x01: Enable Constant Tone Extension Request for the connection
 */
  uint8_t Enable;
/**
 * It defines whether the Constant Tone Extension Request procedure is initiated
 * only once or periodically. In the case of periodic operation, the procedure
 * is initiated every CTE_Request_Interval. However, the Controller may delay
 * initiating the procedure beyond the requested interval (e.g., in order to
 * prioritize other activities).
 * Values:
 * - 0x0000: Initiate the Constant Tone Extension Request procedure once, at the nearliest practical opportunity.
 * - 0x0001 ... 0xFFFF: Requested interval for initiating the Constant Tone Extension Request procedure in number of connection events.
 */
  uint16_t CTE_Request_Interval;
/**
 * It indicates the minimum length of the Constant Tone Extension and the
 * Requested_CTE_Type parameter indicates the type of Constant Tone Extension
 * that the Controller shall request from the remote device.
 * Values:
 * - 0x02 ... 0x14: Minimum length of the Constant Tone Extension being requested in 8 nmicroseconds units
 */
  uint8_t Requested_CTE_Length;
/**
 *
 * Flags:
 * - 0x00: AoA Constant Tone Extension
 * - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 * - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 */
  uint8_t Requested_CTE_Type;
} hci_le_connection_cte_request_enable_cp0;

typedef PACKED(struct) hci_le_connection_cte_request_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_connection_cte_request_enable_rp0;

typedef PACKED(struct) hci_le_connection_cte_response_enable_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 *
 * Values:
 * - 0x00: Disable Constant Tone Extension Response for the connection (default)
 * - 0x01: Enable Constant Tone Extension Response for the connection
 */
  uint8_t Enable;
} hci_le_connection_cte_response_enable_cp0;

typedef PACKED(struct) hci_le_connection_cte_response_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_connection_cte_response_enable_rp0;

typedef PACKED(struct) hci_le_read_antenna_information_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 * Flags:
 * - 0x00: 1 microsecond switching supported for AoD transmission
 * - 0x02: 1 microsecond switching supported for AoD reception
 * - 0x04: 1 microsecond switching and sampling supported for AoA reception
 */
  uint8_t Supported_Switching_Sampling_Rates;
/**
 *
 * Values:
 * - 0x01 ... 0x4B: The number of antennae supported by the Controller
 */
  uint8_t Num_Antennae;
/**
 *
 * Values:
 * - 0x02 ... 0x4B: Maximum length of antenna switching pattern supported by the Controller
 */
  uint8_t Max_Switching_Pattern_Length;
/**
 *
 * Values:
 * - 0x02 ... 0x14: Maximum length of a transmitted Constant Tone Extension supported in 8 microseconds units
 */
  uint8_t Max_CTE_Length;
} hci_le_read_antenna_information_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_receive_enable_cp0_s {
/**
 * Sync_Handle identifying the periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * Bit 0 to enable reporting. Bit 1 to enable duplicate filtering.
 * Flags:
 * - 0x01: ENABLE_REPORTING
 * - 0x02: ENABLE_DUPLICATE_FILTERING
 */
  uint8_t Enable;
} hci_le_set_periodic_advertising_receive_enable_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_receive_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_periodic_advertising_receive_enable_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_sync_transfer_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The Service_Data parameter is a value provided by the Host for use by the
 * Host of the peer device. It is not used by the Controller.
 */
  uint16_t Service_Data;
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
} hci_le_periodic_advertising_sync_transfer_cp0;

typedef PACKED(struct) hci_le_periodic_advertising_sync_transfer_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_periodic_advertising_sync_transfer_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_set_info_transfer_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * It is a value provided by the Host to identify the periodic advertising train
 * to the peer device. It is not used by the Controller.
 */
  uint16_t Service_Data;
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
} hci_le_periodic_advertising_set_info_transfer_cp0;

typedef PACKED(struct) hci_le_periodic_advertising_set_info_transfer_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_periodic_advertising_set_info_transfer_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_sync_transfer_parameters_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The action to be taken when periodic advertising synchronization information
 * is received. If 0, no attempt is made to synchronize to the periodic
 * advertising and no HCI_LE_Periodic_Advertising_Sync_Transfer_Received event
 * is sent to the Host. If 1, an
 * HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
 * HCI_LE_Periodic_Advertising_Report events will be disabled. If 2, an
 * HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
 * HCI_LE_Periodic_Advertising_Report events will be enabled with duplicate
 * filtering disabled. If 3, an
 * HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
 * HCI_LE_Periodic_Advertising_Report events will be enabled with duplicate
 * filtering enabled.
 * Values:
 * - 0x00: NO_SYNC
 * - 0x01: REPORTS_DISABLED
 * - 0x02: REPORTS_ENABLED
 * - 0x03: REPORTS_ENABLED_WITH_DUPLICATE_FILTERING
 */
  uint8_t Mode;
/**
 * The number of periodic advertising packets that can be skipped after a
 * successful receive.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Skip;
/**
 * Synchronization timeout for the periodic advertising train. Time = N*10 ms.
 * Values:
 * - 0x000A (100 ms)  ... 0x4000 (163840 ms) 
 */
  uint16_t Sync_Timeout;
/**
 * It specifies whether to only synchronize to periodic advertising with certain
 * types of Constant Tone Extension.  If bit 0 is set: do not sync to packets
 * with an AoA Constant Tone Extension. If bit 1 is set: Do not sync to packets
 * with an AoD Constant Tone Extension with 1 us slots. If bit 2 is set: Do not
 * sync to packets with an AoD Constant Tone Extension with 2 us slots. If bit 3
 * is set: Do not sync to packets without a Constant Tone Extension.
 * Flags:
 * - 0x01: DO_NOT_SYNC_WITH_AOA
 * - 0x02: DO_NOT_SYNC_WITH_AOD_1US
 * - 0x04: DO_NOT_SYNC_WITH_AOD_2US
 * - 0x10: DO_NOT_SYNC_WITHOUT_CTE
 */
  uint8_t CTE_Type;
} hci_le_set_periodic_advertising_sync_transfer_parameters_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_sync_transfer_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_set_periodic_advertising_sync_transfer_parameters_rp0;

typedef PACKED(struct) hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0_s {
/**
 * The action to be taken when periodic advertising synchronization information
 * is received. If 0, no attempt is made to synchronize to the periodic
 * advertising and no HCI_LE_Periodic_Advertising_Sync_Transfer_Received event
 * is sent to the Host. If 1, an
 * HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
 * HCI_LE_Periodic_Advertising_Report events will be disabled. If 2, an
 * HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
 * HCI_LE_Periodic_Advertising_Report events will be enabled with duplicate
 * filtering disabled. If 3, an
 * HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
 * HCI_LE_Periodic_Advertising_Report events will be enabled with duplicate
 * filtering enabled.
 * Values:
 * - 0x00: NO_SYNC
 * - 0x01: REPORTS_DISABLED
 * - 0x02: REPORTS_ENABLED
 * - 0x03: REPORTS_ENABLED_WITH_DUPLICATE_FILTERING
 */
  uint8_t Mode;
/**
 * The number of periodic advertising packets that can be skipped after a
 * successful receive.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Skip;
/**
 * Synchronization timeout for the periodic advertising train. Time = N*10 ms.
 * Values:
 * - 0x000A (100 ms)  ... 0x4000 (163840 ms) 
 */
  uint16_t Sync_Timeout;
/**
 * It specifies whether to only synchronize to periodic advertising with certain
 * types of Constant Tone Extension.  If bit 0 is set: do not sync to packets
 * with an AoA Constant Tone Extension. If bit 1 is set: Do not sync to packets
 * with an AoD Constant Tone Extension with 1 us slots. If bit 2 is set: Do not
 * sync to packets with an AoD Constant Tone Extension with 2 us slots. If bit 3
 * is set: Do not sync to packets without a Constant Tone Extension.
 * Flags:
 * - 0x01: DO_NOT_SYNC_WITH_AOA
 * - 0x02: DO_NOT_SYNC_WITH_AOD_1US
 * - 0x04: DO_NOT_SYNC_WITH_AOD_2US
 * - 0x10: DO_NOT_SYNC_WITHOUT_CTE
 */
  uint8_t CTE_Type;
} hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0;

