sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_set_default_periodic_advertising_sync_transfer_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_default_periodic_advertising_sync_transfer_parameters_rp0;

typedef PACKED(struct) hci_le_read_buffer_size_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * 0x0000: No dedicated LE Buffer exists. Use the HCI_Read_Buffer_Size command.
 * 0x001B - 0xFFFF Maximum length (in octets) of the data portion of each HCI
 * ACL data packet.
 * Values:
 * - 0x0000: NO_BUFFER
 * - 0x001B ... 0xFFFF
 */
  uint16_t HC_LE_ACL_Data_Packet_Length;
/**
 * 0x00: No dedicated LE Buffer exists. Use the HCI_Read_Buffer_Size command.
 * 0x01 - 0xFF: Total number of HCI ACL Data Packets that can be stored in the
 * data buffers of the Controller.
 * Values:
 * - 0x00: NO_BUFFER
 * - 0x01 ... 0xFF
 */
  uint8_t HC_Total_Num_LE_ACL_Data_Packets;
/**
 * 0x0000: No dedicated ISO Buffer exists. 0x0001 to 0xFFFF: The maximum length
 * (in octets) of the data portion of each HCI ISO data packet.
 * Values:
 * - 0x0000: NO_BUFFER
 * - 0x0001 ... 0xFFFF
 */
  uint16_t ISO_Data_Packet_Length;
/**
 * 0x00: No dedicated ISO Buffer exists. 0x01 to 0xFF: The total number of HCI
 * ISO data packets that can be stored in the ISO buffers of the Controller.
 * Values:
 * - 0x00: NO_BUFFER
 * - 0x01 ... 0xFF
 */
  uint8_t Total_Num_ISO_Data_Packets;
} hci_le_read_buffer_size_v2_rp0;

typedef PACKED(struct) hci_le_read_iso_tx_sync_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_read_iso_tx_sync_cp0;

typedef PACKED(struct) hci_le_read_iso_tx_sync_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The packet sequence number of an SDU.
 */
  uint16_t Packet_Sequence_Number;
/**
 * The CIG reference point or BIG anchor point of a transmitted SDU derived
 * using the Controller's free running reference clock (in microseconds).
 */
  uint32_t TX_Time_Stamp;
/**
 * The time offset, in microseconds, that is associated with a transmitted SDU.
 */
  uint8_t Time_Offset[3];
} hci_le_read_iso_tx_sync_rp0;

typedef PACKED(struct) hci_le_set_cig_parameters_cp0_s {
/**
 * Used to identify the CIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t CIG_ID;
/**
 * The interval, in microseconds, of periodic SDUs.
 * Values:
 * - 0x0000FF ... 0x0FFFFF
 */
  uint8_t SDU_Interval_C_To_P[3];
/**
 * The interval, in microseconds, of periodic SDUs.
 * Values:
 * - 0x0000FF ... 0x0FFFFF
 */
  uint8_t SDU_Interval_P_To_C[3];
/**
 * Worst-case sleep clock accuracy of all the Peripherals.
 * Values:
 * - 0x00: 251 ppm to 500 ppm
 * - 0x01: 151 ppm to 250 ppm
 * - 0x02: 101 ppm to 150 ppm
 * - 0x03: 76 ppm to 100 ppm
 * - 0x04: 51 ppm to 75 ppm
 * - 0x05: 31 ppm to 50 ppm
 * - 0x06: 21 ppm to 30 ppm
 * - 0x07: 0 ppm to 20 ppm
 */
  uint8_t Worst_Case_SCA;
/**
 * Preferred method of arranging subevents of multiple CISes.
 * Values:
 * - 0x00: Sequential
 * - 0x01: Interleaved
 */
  uint8_t Packing;
/**
 * Format of the CIS Data PDUs of the specified CISes.
 * Values:
 * - 0x00: Unframed
 * - 0x01: Framed
 */
  uint8_t Framing;
/**
 * Maximum transport latency, in milliseconds, from the Central's Controller to
 * the Peripheral's Controller.
 * Values:
 * - 0x0005 ... 0x0FA0
 */
  uint16_t Max_Transport_Latency_C_To_P;
/**
 * Maximum transport latency, in milliseconds, from the Peripheral's Controller
 * to the Central's Controller.
 * Values:
 * - 0x0005 ... 0x0FA0
 */
  uint16_t Max_Transport_Latency_P_To_C;
/**
 * Total number of CIS configurations in the CIG being added or modified.
 * Values:
 * - 0x00 ... 0x1F
 */
  uint8_t CIS_Count;
/**
 * See @ref CIS_Param_t
 */
  packed_CIS_Param_t CIS_Param[(HCI_MAX_PAYLOAD_SIZE - 15)/sizeof(packed_CIS_Param_t)];
} hci_le_set_cig_parameters_cp0;

typedef PACKED(struct) hci_le_set_cig_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Total number of CIS configurations added or modified by this command.
 * Values:
 * - 0x00 ... 0x1F
 */
  uint8_t CIG_ID;
/**
 * Total number of CIS configurations added or modified by this command.
 * Values:
 * - 0x00 ... 0x1F
 */
  uint8_t CIS_Count;
/**
 * Connection handle of the CIS in the CIG.
 */
  uint16_t Connection_Handle[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint16_t)];
} hci_le_set_cig_parameters_rp0;

typedef PACKED(struct) hci_le_set_cig_parameters_test_cp0_s {
/**
 * Used to identify the CIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t CIG_ID;
/**
 * The interval, in microseconds, of periodic SDUs.
 * Values:
 * - 0x0000FF ... 0x0FFFFF
 */
  uint8_t SDU_Interval_C_To_P[3];
/**
 * The interval, in microseconds, of periodic SDUs.
 * Values:
 * - 0x0000FF ... 0x0FFFFF
 */
  uint8_t SDU_Interval_P_To_C[3];
/**
 * The flush timeout in multiples of ISO_Interval for each payload sent from the
 * Central to Peripheral.
 * Values:
 * - 0x01 ... 0xFF
 */
  uint8_t FT_C_To_P;
/**
 * The flush timeout in multiples of ISO_Interval for each payload sent from the
 * Peripheral to Central.
 * Values:
 * - 0x01 ... 0xFF
 */
  uint8_t FT_P_To_C;
/**
 * Time between consecutive CIS anchor points. Time = N * 1.25 ms
 * Values:
 * - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t ISO_Interval;
/**
 * Worst-case sleep clock accuracy of all the Peripherals.
 * Values:
 * - 0x00: 251 ppm to 500 ppm
 * - 0x01: 151 ppm to 250 ppm
 * - 0x02: 101 ppm to 150 ppm
 * - 0x03: 76 ppm to 100 ppm
 * - 0x04: 51 ppm to 75 ppm
 * - 0x05: 31 ppm to 50 ppm
 * - 0x06: 21 ppm to 30 ppm
 * - 0x07: 0 ppm to 20 ppm
 */
  uint8_t Worst_Case_SCA;
/**
 * Preferred method of arranging subevents of multiple CISes.
 * Values:
 * - 0x00: Sequential
 * - 0x01: Interleaved
 */
  uint8_t Packing;
/**
 * Format of the CIS Data PDUs of the specified CISes.
 * Values:
 * - 0x00: Unframed
 * - 0x01: Framed
 */
  uint8_t Framing;
/**
 * Total number of CIS configurations in the CIG being added or modified.
 * Values:
 * - 0x00 ... 0x1F
 */
  uint8_t CIS_Count;
/**
 * See @ref CIS_Param_Test_t
 */
  packed_CIS_Param_Test_t CIS_Param_Test[(HCI_MAX_PAYLOAD_SIZE - 15)/sizeof(packed_CIS_Param_Test_t)];
} hci_le_set_cig_parameters_test_cp0;

typedef PACKED(struct) hci_le_set_cig_parameters_test_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Total number of CIS configurations added or modified by this command.
 * Values:
 * - 0x00 ... 0x1F
 */
  uint8_t CIG_ID;
/**
 * Total number of CIS configurations added or modified by this command.
 * Values:
 * - 0x00 ... 0x1F
 */
  uint8_t CIS_Count;
/**
 * Connection handle of the CIS in the CIG.
 */
  uint16_t Connection_Handle[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint16_t)];
} hci_le_set_cig_parameters_test_rp0;

typedef PACKED(struct) hci_le_create_cis_cp0_s {
/**
 * Total number of CISes to be created.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t CIS_Count;
/**
 * See @ref CIS_Handles_t
 */
  packed_CIS_Handles_t CIS_Handles[(HCI_MAX_PAYLOAD_SIZE - 1)/sizeof(packed_CIS_Handles_t)];
} hci_le_create_cis_cp0;

typedef PACKED(struct) hci_le_create_cis_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_create_cis_rp0;

