sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_remove_cig_cp0_s {
/**
 * Identifier of a CIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t CIG_ID;
} hci_le_remove_cig_cp0;

typedef PACKED(struct) hci_le_remove_cig_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Identifier of a CIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t CIG_ID;
} hci_le_remove_cig_rp0;

typedef PACKED(struct) hci_le_accept_cis_request_cp0_s {
/**
 * Connection handle of the CIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_accept_cis_request_cp0;

typedef PACKED(struct) hci_le_accept_cis_request_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_accept_cis_request_rp0;

typedef PACKED(struct) hci_le_reject_cis_request_cp0_s {
/**
 * Reason the CIS request was rejected. See [Vol 1] Part F, Controller Error
 * Codes for a list of error codes and descriptions.
 */
  uint16_t Connection_Handle;
/**
 * Reason the CIS request was rejected. See [Vol 1] Part F, Controller Error
 * Codes for a list of error codes and descriptions.
 */
  uint8_t Reason;
} hci_le_reject_cis_request_cp0;

typedef PACKED(struct) hci_le_reject_cis_request_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * The connection handle of the CIS to be rejected.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_reject_cis_request_rp0;

typedef PACKED(struct) hci_le_create_big_cp0_s {
/**
 * Used to identify the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * Used to identify the periodic advertising train.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * Total number of BISes in the BIG.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t Num_BIS;
/**
 * The interval, in microseconds, of periodic SDUs.
 * Values:
 * - 0x0000FF ... 0x0FFFFF
 */
  uint8_t SDU_Interval[3];
/**
 * Maximum size of an SDU, in octets.
 * Values:
 * - 0x0001 ... 0x0FFF
 */
  uint16_t Max_SDU;
/**
 * Maximum transport latency, in milliseconds.
 * Values:
 * - 0x0005 ... 0x0FA0
 */
  uint16_t Max_Transport_Latency;
/**
 * The number of times that every BIS Data PDU should be retransmitted.
 * Values:
 * - 0x00 ... 0x1E
 */
  uint8_t RTN;
/**
 * Transmitter PHY of packets.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t PHY;
/**
 * Used to indicate the preferred method of arranging subevents of multiple
 * BISes.
 * Values:
 * - 0x00: Sequential
 * - 0x01: Interleaved
 */
  uint8_t Packing;
/**
 * The format for sending BIS Data PDUs.
 * Values:
 * - 0x00: Unframed
 * - 0x01: Framed
 */
  uint8_t Framing;
/**
 * The encryption mode of the BISes.
 * Values:
 * - 0x00: Unencrypted
 * - 0x01: Encrypted
 */
  uint8_t Encryption;
/**
 * 128-bit code used for deriving the session key for decrypting payloads of
 * BISes in the BIG.
 */
  uint8_t Broadcast_Code[16];
} hci_le_create_big_cp0;

typedef PACKED(struct) hci_le_create_big_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_create_big_rp0;

typedef PACKED(struct) hci_le_create_big_test_cp0_s {
/**
 * Used to identify the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * Used to identify the periodic advertising train.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * Total number of BISes in the BIG.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t Num_BIS;
/**
 * The interval, in microseconds, of periodic SDUs.
 * Values:
 * - 0x0000FF ... 0x0FFFFF
 */
  uint8_t SDU_Interval[3];
/**
 * The time between consecutive BIG anchor points. Time = N * 1.25 ms Time
 * Range: 5 ms to 4 s
 * Values:
 * - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t ISO_Interval;
/**
 * The total number of subevents in each interval of each BIS in the BIG.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t NSE;
/**
 * Maximum size of an SDU, in octets.
 * Values:
 * - 0x0001 ... 0x0FFF
 */
  uint16_t Max_SDU;
/**
 * Maximum size, in octets, of payload
 * Values:
 * - 0x0001 ... 0x00FB
 */
  uint16_t Max_PDU;
/**
 * Transmitter PHY of packets.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t PHY;
/**
 * Used to indicate the preferred method of arranging subevents of multiple
 * BISes.
 * Values:
 * - 0x00: Sequential
 * - 0x01: Interleaved
 */
  uint8_t Packing;
/**
 * The format for sending BIS Data PDUs.
 * Values:
 * - 0x00: Unframed
 * - 0x01: Framed
 */
  uint8_t Framing;
/**
 * The number of new payloads in each interval for each BIS.
 * Values:
 * - 0x01 ... 0x07
 */
  uint8_t BN;
/**
 * The number of times the scheduled payload(s) are transmitted in a given
 * event.
 * Values:
 * - 0x01 ... 0x0F
 */
  uint8_t IRC;
/**
 * Offset used for pre-transmissions.
 * Values:
 * - 0x00 ... 0x0F
 */
  uint8_t PTO;
/**
 * The encryption mode of the BISes.
 * Values:
 * - 0x00: Unencrypted
 * - 0x01: Encrypted
 */
  uint8_t Encryption;
/**
 * 128-bit code used for deriving the session key for decrypting payloads of
 * BISes in the BIG.
 */
  uint8_t Broadcast_Code[16];
} hci_le_create_big_test_cp0;

typedef PACKED(struct) hci_le_create_big_test_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_create_big_test_rp0;

typedef PACKED(struct) hci_le_terminate_big_cp0_s {
/**
 * Used to identify the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * Reason for disconnection. See Error Codes.
 */
  uint8_t Reason;
} hci_le_terminate_big_cp0;

