sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_terminate_big_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_terminate_big_rp0;

typedef PACKED(struct) hci_le_big_create_sync_cp0_s {
/**
 * Used to identify the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * Identifier of the periodic advertising train.
 * Values:
 * - 0x0000 ... 0x00EF
 */
  uint16_t Sync_Handle;
/**
 * The encryption mode of the BIG.
 * Values:
 * - 0x00: Unencrypted
 * - 0x01: Encrypted
 */
  uint8_t Encryption;
/**
 * 128-bit code used for deriving the session key for decrypting payloads of
 * BISes in the BIG.
 */
  uint8_t Broadcast_Code[16];
/**
 * The MSE (Maximum Subevents) parameter is the maximum number of subevents that
 * a Controller should use to receive data payloads in each interval for a BIS.
 * The Host should set MSE to reduce the maximum continuous radio receiving time
 * for a Synchronized Receiver with limited battery capacity.
 * Values:
 * - 0x00: Any number of subevents
 * - 0x01 ... 0x1F
 */
  uint8_t MSE;
/**
 * The BIG_Sync_Timeout parameter specifies the maximum permitted time between
 * successful receptions of BIS PDUs. If this time is exceeded, synchronization
 * is lost. When the Controller establishes synchronization and if the
 * BIG_Sync_Timeout set by the Host is less than 6 * ISO_Interval, the
 * Controller shall set the timeout to 6 * ISO_Interval.
 * Values:
 * - 0x000A (100 ms)  ... 0x4000 (163840 ms) 
 */
  uint16_t BIG_Sync_Timeout;
/**
 * Total number of BISes to synchronize.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t Num_BIS;
/**
 * List of indices of BISes.
 */
  uint8_t BIS[(HCI_MAX_PAYLOAD_SIZE - 24)/sizeof(uint8_t)];
} hci_le_big_create_sync_cp0;

typedef PACKED(struct) hci_le_big_create_sync_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_big_create_sync_rp0;

typedef PACKED(struct) hci_le_big_terminate_sync_cp0_s {
/**
 * Used to identify the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
} hci_le_big_terminate_sync_cp0;

typedef PACKED(struct) hci_le_big_terminate_sync_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Identifer of the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
} hci_le_big_terminate_sync_rp0;

typedef PACKED(struct) hci_le_request_peer_sca_cp0_s {
/**
 * Connection handle of the ACL.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_request_peer_sca_cp0;

typedef PACKED(struct) hci_le_request_peer_sca_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_request_peer_sca_rp0;

typedef PACKED(struct) hci_le_setup_iso_data_path_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The Data_Path_Direction parameter specifies the direction for which the data
 * path is being configured. The input and output directions are defined from
 * the perspective of the Controller, so "input" refers to data flowing from the
 * Host to the Controller.
 * Values:
 * - 0x00: Input
 * - 0x01: Output
 */
  uint8_t Data_Path_Direction;
/**
 * The Data_Path_ID parameter specifies the data transport path used. When set
 * to 0x00, the data path shall be over the HCI transport. When set to 0xFF the
 * path shall be disabled. When set to a value in the range 0x01 to 0xFE, the
 * data path shall use a vendor-specific transport interface (e.g., a PCM
 * interface) with logical transport numbers. The meanings of these logical
 * transport numbers are vendor-specific.
 * Values:
 * - 0x00: HCI
 * - 0x01 ... 0xFE
 * - 0xFF: Disabled
 */
  uint8_t Data_Path_ID;
/**
 * The Codec_ID parameter specifies the coding format used over the air. Octet
 * 0: See Assigned Numbers for Coding Format. Octets 1 to 2: Company ID, see
 * Assigned Numbers for Company Identifier. Shall be ignored if octet 0 is not
 * 0xFF. Octets 3 to 4: Vendor-defined codec ID. Shall be ignored if octet 0 is
 * not 0xFF.
 */
  uint8_t Codec_ID[5];
/**
 * Controller delay in microseconds. When Data_Path_Direction is set to 0x00
 * (input), the Controller_Delay parameter specifies the delay at the data
 * source from the reference time of an SDU to the CIG reference point (see
 * Bluetooth Core v5.2 [Vol 6] Part B, Section 4.5.14.1) or BIG anchor point
 * (see Core v5.2 [Vol 6] Part B, Section 4.4.6.4). When Data_Path_Direction is
 * set to 0x01 (output), Controller_Delay specifies the delay from the CIG
 * synchronization point or BIG synchronization point to the point in time at
 * which the Controller begins to transfer the corresponding data to the data
 * path interface.
 * Values:
 * - 0x000000 ... 0x3D0900
 */
  uint8_t Controller_Delay[3];
/**
 * Length of codec configuration.
 */
  uint8_t Codec_Configuration_Length;
/**
 * The Codec_Configuration parameter specifies codec-specific configuration
 * information for the specified direction.
 */
  uint8_t Codec_Configuration[(HCI_MAX_PAYLOAD_SIZE - 13)/sizeof(uint8_t)];
} hci_le_setup_iso_data_path_cp0;

typedef PACKED(struct) hci_le_setup_iso_data_path_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_setup_iso_data_path_rp0;

typedef PACKED(struct) hci_le_remove_iso_data_path_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The Data_Path_Direction parameter specifies which directions are to have the
 * data path removed.
 * Flags:
 * - 0x01: Input
 * - 0x02: Output
 */
  uint8_t Data_Path_Direction;
} hci_le_remove_iso_data_path_cp0;

typedef PACKED(struct) hci_le_remove_iso_data_path_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_remove_iso_data_path_rp0;

typedef PACKED(struct) hci_le_iso_transmit_test_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The Payload_Type parameter defines the configuration of SDUs in the payload.
 * Values:
 * - 0x00: ZERO_LENGTH_PAYLOAD
 * - 0x01: VARIABLE_LENGTH_PAYLOAD
 * - 0x02: MAXIMUM_LENGTH_PAYLOAD
 */
  uint8_t Payload_Type;
} hci_le_iso_transmit_test_cp0;

typedef PACKED(struct) hci_le_iso_transmit_test_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_iso_transmit_test_rp0;

typedef PACKED(struct) hci_le_iso_receive_test_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The Payload_Type parameter defines the configuration of SDUs in the payload.
 * Values:
 * - 0x00: ZERO_LENGTH_PAYLOAD
 * - 0x01: VARIABLE_LENGTH_PAYLOAD
 * - 0x02: MAXIMUM_LENGTH_PAYLOAD
 */
  uint8_t Payload_Type;
} hci_le_iso_receive_test_cp0;

typedef PACKED(struct) hci_le_iso_receive_test_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_iso_receive_test_rp0;

typedef PACKED(struct) hci_le_iso_read_test_counters_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_iso_read_test_counters_cp0;

