sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_iso_read_test_counters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Number in the Received_Packet_Count.
 */
  uint32_t Received_Packet_Count;
/**
 * Number in the Missed_Packet_Count.
 */
  uint32_t Missed_Packet_Count;
/**
 * Number in the Failed_Packet_Count.
 */
  uint32_t Failed_Packet_Count;
} hci_le_iso_read_test_counters_rp0;

typedef PACKED(struct) hci_le_iso_test_end_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_iso_test_end_cp0;

typedef PACKED(struct) hci_le_iso_test_end_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Number in the Received_Packet_Count.
 */
  uint32_t Received_Packet_Count;
/**
 * Number in the Missed_Packet_Count.
 */
  uint32_t Missed_Packet_Count;
/**
 * Number in the Failed_Packet_Count.
 */
  uint32_t Failed_Packet_Count;
} hci_le_iso_test_end_rp0;

typedef PACKED(struct) hci_le_set_host_feature_cp0_s {
/**
 * Bit position in the FeatureSet.
 * Values:
 * - 0x00 ... 0x3F
 */
  uint8_t Bit_Number;
/**
 * If 0, the Host feature is disabled, if 1 the Host feature is enablded.
 * Values:
 * - 0x00: DISABLED
 * - 0x01: ENABLED
 */
  uint8_t Bit_Value;
} hci_le_set_host_feature_cp0;

typedef PACKED(struct) hci_le_set_host_feature_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_set_host_feature_rp0;

typedef PACKED(struct) hci_le_read_iso_link_quality_cp0_s {
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_read_iso_link_quality_cp0;

typedef PACKED(struct) hci_le_read_iso_link_quality_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS or BIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Value of the Tx_UnACKed_Packets counter. Incremented when the Link Layer does
 * not receive an acknowledgment for a CIS Data PDU that it transmitted at least
 * once by its flush point (see Core 5.2 [Vol 6] Part B, Section 4.5.13.5).
 */
  uint32_t Tx_UnACKed_Packets;
/**
 * Value of the Tx_Flushed_Packets counter. Incremented when the Link Layer does
 * not transmit a specific payload by its flush point.
 */
  uint32_t Tx_Flushed_Packets;
/**
 * Value of the Tx_Last_Subevent_Packets counter. Incremented when the Link
 * Layer transmits a CIS Data PDU in the last subevent of a CIS event.
 */
  uint32_t Tx_Last_Subevent_Packets;
/**
 * Value of the Retransmitted_Packets counter. Incremented when the Link Layer
 * retransmits a CIS Data PDU.
 */
  uint32_t Retransmitted_Packets;
/**
 * Value of the CRC_Error_Packets counter. Incremented when the Link Layer
 * receives a packet with a CRC error.
 */
  uint32_t CRC_Error_Packets;
/**
 * Value of the Rx_Unreceived_Packets counter. Incremented when the Link Layer
 * does not receive a specific payload by its flush point (on a CIS) or the end
 * of the event it is associated with (on a BIS; see Core v5.2 [Vol 6] Part B,
 * Section 4.4.6.6).
 */
  uint32_t Rx_Unreceived_Packets;
/**
 * Value of the Duplicate_Packets counter. Incremented when the Link Layer
 * receives a retransmission of a CIS Data PDU.
 */
  uint32_t Duplicate_Packets;
} hci_le_read_iso_link_quality_rp0;

typedef PACKED(struct) hci_le_enhanced_read_transmit_power_level_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * PHY associated with the connection  (not necessarily the currently used one).
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
} hci_le_enhanced_read_transmit_power_level_cp0;

typedef PACKED(struct) hci_le_enhanced_read_transmit_power_level_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * PHY associated with the connection  (not necessarily the currently used one).
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
/**
 * Current TX power level (dBm).
 * Values:
 * - -127 ... 20
 * - 127: NA
 */
  int8_t Current_Transmit_Power_Level;
/**
 * Maximum TX power level (dBm).
 * Values:
 * - -127 ... 20
 */
  int8_t Max_Transmit_Power_Level;
} hci_le_enhanced_read_transmit_power_level_rp0;

typedef PACKED(struct) hci_le_read_remote_transmit_power_level_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * PHY associated with the connection  (not necessarily the currently used one).
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
} hci_le_read_remote_transmit_power_level_cp0;

typedef PACKED(struct) hci_le_read_remote_transmit_power_level_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_read_remote_transmit_power_level_rp0;

typedef PACKED(struct) hci_le_set_path_loss_reporting_parameters_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * High threshold for the path loss. Units: dB.
 * Values:
 * - 0 ... 254
 * - 255: UNUSED
 */
  uint8_t High_Threshold;
/**
 * Hysteresis value for the high threshold. Units: dB.
 */
  uint8_t High_Hysteresis;
/**
 * Low threshold for the path loss. Units: dB.
 */
  uint8_t Low_Threshold;
/**
 * Hysteresis value for the low threshold. Units: dB.
 */
  uint8_t Low_Hysteresis;
/**
 * Minimum time in number of connection events to be observed once the path
 * crosses the threshold before an event is generated.
 */
  uint16_t Min_Time_Spent;
} hci_le_set_path_loss_reporting_parameters_cp0;

