sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_set_extended_advertising_parameters_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Units: dBm. The Selected_Tx_Power return parameter indicates the transmit
 * power selected by the Controller. The Controller shall not change the
 * transmit power for this advertising set without being directed to by the
 * Host.
 * Values:
 * - -127 ... 126
 */
  int8_t Selected_Tx_Power;
} hci_le_set_extended_advertising_parameters_v2_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_subevent_data_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF: Used to identify an advertising set
 */
  uint8_t Advertising_Handle;
/**
 * Number of subevent data in the command.
 * Values:
 * - 0x01 ... 0x0F
 */
  uint8_t Num_Subevents;
/**
 * See @ref Subevent_Data_Parameters_t
 */
  packed_Subevent_Data_Parameters_t Subevent_Data_Parameters[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(packed_Subevent_Data_Parameters_t)];
} hci_le_set_periodic_advertising_subevent_data_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_subevent_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Used to identify a periodic advertising train.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
} hci_le_set_periodic_advertising_subevent_data_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_response_data_cp0_s {
/**
 * Sync_Handle identifying the PAwR train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * The value of paEventCounter (see [Vol 6] Part B, Section 4.4.2.1) for the
 * periodic advertising packet that the Host is responding to.
 */
  uint16_t Request_Event;
/**
 * Used to identify the subevent of the PAwR train.
 * Values:
 * - 0x00 ... 0x7F
 */
  uint8_t Request_Subevent;
/**
 * Used to identify the response slot of the PAwR train.
 */
  uint8_t Response_Subevent;
/**
 * Used to identify the response slot of the PAwR train.
 */
  uint8_t Response_Slot;
/**
 * The number of octets in the Response_Data parameter.
 * Values:
 * - 0x00 ... 0xFB
 */
  uint8_t Response_Data_Length;
/**
 * Response data formatted as defined in [Vol 3] Part C, Section 11.
 */
  uint8_t Response_Data[(HCI_MAX_PAYLOAD_SIZE - 8)/sizeof(uint8_t)];
} hci_le_set_periodic_advertising_response_data_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_response_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Sync_Handle identifying the periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
} hci_le_set_periodic_advertising_response_data_rp0;

typedef PACKED(struct) hci_le_set_periodic_sync_subevent_cp0_s {
/**
 * Sync_Handle identifying the PAwR train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * If bit 6 is set, include TxPower in the advertising PDU.
 * Flags:
 * - 0x0040: TX_POWER
 */
  uint16_t Periodic_Advertising_Properties;
/**
 * Number of subevent data in the command.
 * Values:
 * - 0x01 ... 0x0F
 */
  uint8_t Num_Subevents;
/**
 * The subevent to synchronize with.
 */
  uint8_t Subevent[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(uint8_t)];
} hci_le_set_periodic_sync_subevent_cp0;

typedef PACKED(struct) hci_le_set_periodic_sync_subevent_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Sync_Handle identifying the periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
} hci_le_set_periodic_sync_subevent_rp0;

typedef PACKED(struct) hci_le_extended_create_connection_v2_cp0_s {
/**
 * Advertising_Handle identifying the periodic advertising train.
 * Values:
 * - 0x00 ... 0xEF
 * - 0xFF: Not specified
 */
  uint8_t Advertising_Handle;
/**
 * Subevent where the connection request is to be sent.
 * Values:
 * - 0x00 ... 0x7F
 * - 0xFF: Not specified
 */
  uint8_t Subevent;
/**
 * The Initiator_Filter_Policy parameter is used to determine whether the Filter
 * Accept List is used. If the Filter Accept List is not used, the
 * Peer_Address_Type and the Peer_Address parameters specify the address type
 * and address of the advertising device to connect to. 0x00 - Filter Accept
 * List is not used to determine which advertiser to connect to.
 * Peer_Address_Type and Peer_Address shall be used. 0x01 - Filter Accept List
 * is used to determine which advertiser to connect to. Peer_Address_Type and
 * Peer_Address shall be ignored.
 * Values:
 * - 0x00: FILTER_ACCEPT_LIST_NOT_USED
 * - 0x01: FILTER_ACCEPT_LIST_USED
 */
  uint8_t Initiator_Filter_Policy;
/**
 * The Own_Address_Type parameter indicates the type of address being used in
 * the connection request packets.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
 * - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from the most recent successful
LE_Set_Random_Address Command.
 */
  uint8_t Own_Address_Type;
/**
 * The Peer_Address_Type parameter indicates the type of address used in the
 * connectable advertisement sent by the peer. 0x00: Public Device Address or
 * Public Identity Address 0x01: Random Device Address or Random (static)
 * Identity Address
 * Values:
 * - 0x00: Public Address
 * - 0x01: Random Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
/**
 * The Initiating_PHYs parameter indicates the PHY(s) on which the advertising
 * packets should be received on the primary advertising channel and the PHYs
 * for which connection parameters have been specified. The Host may enable one
 * or more initiating PHYs. 0x01: Scan connectable advertisements on the LE 1M
 * PHY. Connection parameters for the LE 1M PHY are provided. 0x02: Connection
 * parameters for the LE 2M PHY are provided 0x04: Scan connectable
 * advertisements on the LE Coded PHY. Connection parameters for the LE Coded
 * PHY are provided.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t Initiating_PHYs;
/**
 * See @ref Extended_Create_Connection_Parameters_t
 */
  packed_Extended_Create_Connection_Parameters_t Extended_Create_Connection_Parameters[(HCI_MAX_PAYLOAD_SIZE - 12)/sizeof(packed_Extended_Create_Connection_Parameters_t)];
} hci_le_extended_create_connection_v2_cp0;

typedef PACKED(struct) hci_le_extended_create_connection_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} hci_le_extended_create_connection_v2_rp0;

