sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) hci_le_set_periodic_advertising_parameters_v2_cp0_s {
/**
 * Used to identify a periodic advertising train.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * Minimum advertising interval for periodic advertising. Time = N * 1.25 ms;
 * Time Range: 7.5ms to 81.91875 s.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 */
  uint16_t Periodic_Advertising_Interval_Min;
/**
 * Maximum advertising interval for periodic advertising. Time = N * 1.25 ms;
 * Time Range: 7.5ms to 81.91875 s.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 */
  uint16_t Periodic_Advertising_Interval_Max;
/**
 * The Periodic_Advertising_Properties parameter indicates which fields should
 * be included in the advertising packet.
 * Flags:
 * - 0x0040
 */
  uint16_t Periodic_Advertising_Properties;
/**
 * Number of subevents.
 * Values:
 * - 0x00 ... 0x80
 */
  uint8_t Num_Subevents;
/**
 * Interval between subevents. Time = N x 1.25 ms.
 * Values:
 * - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 */
  uint8_t Subevent_Interval;
/**
 * Time between the advertising packet in a subevent and the first response
 * slot. Time = N x 1.25 ms.
 * Values:
 * - 0x00 (NaN) : No response slots
 * - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 */
  uint8_t Response_Slot_Delay;
/**
 * Time between response slots. Time = N x 0.125 ms
 * Values:
 * - 0x00 (0.000 ms) : No response slots
 * - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 */
  uint8_t Response_Slot_Spacing;
/**
 * Number of subevent response slots.
 * Values:
 * - 0x00 ... 0xFF
 */
  uint8_t Num_Response_Slots;
} hci_le_set_periodic_advertising_parameters_v2_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_parameters_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Used to identify a periodic advertising train.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
} hci_le_set_periodic_advertising_parameters_v2_rp0;

typedef PACKED(struct) aci_hal_get_fw_build_number_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Build number of the firmware.
 */
  uint16_t Build_Number;
} aci_hal_get_fw_build_number_rp0;

typedef PACKED(struct) aci_hal_get_firmware_details_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Major version number of the DTM application part
 */
  uint8_t DTM_version_major;
/**
 * Minor version number of the DTM application part
 */
  uint8_t DTM_version_minor;
/**
 * Patch version number of the DTM application part
 */
  uint8_t DTM_version_patch;
/**
 * Transport layer mode (numbers not defined reserved for future use)
 * Values:
 * - 0x01: UART
 * - 0x02: SPI
 */
  uint8_t DTM_variant;
/**
 * Build number for DTM application part
 */
  uint16_t DTM_Build_Number;
/**
 * Major version number of BTLE stack
 */
  uint8_t BTLE_Stack_version_major;
/**
 * Minor version number of BTLE stack
 */
  uint8_t BTLE_Stack_version_minor;
/**
 * Patch version number of BTLE stack
 */
  uint8_t BTLE_Stack_version_patch;
/**
 * Specific variant build
 * Values:
 * - 0x00: Official release
 * - 0x01: Internal development release
 */
  uint8_t BTLE_Stack_development;
/**
 * Bitmask of BLE stack v4.x or later variants (modular configurations options
 * and link layer only)
 * Flags:
 * - 0x0001: CONTROLLER_PRIVACY_ENABLED
 * - 0x0002: SECURE_CONNECTIONS_ENABLED
 * - 0x0004: CONTROLLER_SCAN_ENABLED
 * - 0x0008: CONTROLLER_DATA_LENGTH_EXTENSION_ENABLED
 * - 0x0010: LINK LAYER ONLY
 * - 0x0020: CONTROLLER_2M_CODED_PHY_ENABLED
 * - 0x0040: CONTROLLER_EXT_ADV_SCAN_ENABLED
 * - 0x0080: L2CAP_COS_ENABLED
 * - 0x0100: CONTROLLER_PERIODIC_ADV_ENABLED
 * - 0x0200: CONTROLLER_CTE_ENABLED
 * - 0x0400: CONTROLLER_POWER_CONTROL_ENABLED
 * - 0x0800: CONNECTION_ENABLED
 */
  uint16_t BTLE_Stack_variant;
/**
 * Build number for BTLE stack
 */
  uint16_t BTLE_Stack_Build_Number;
} aci_hal_get_firmware_details_rp0;

typedef PACKED(struct) aci_hal_get_firmware_details_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Major version number of the DTM application part
 */
  uint8_t DTM_version_major;
/**
 * Minor version number of the DTM application part
 */
  uint8_t DTM_version_minor;
/**
 * Patch version number of the DTM application part
 */
  uint8_t DTM_version_patch;
/**
 * Transport layer mode (numbers not defined reserved for future use)
 * Values:
 * - 0x01: UART
 * - 0x02: SPI
 */
  uint8_t DTM_variant;
/**
 * Build number for DTM application part
 */
  uint16_t DTM_Build_Number;
/**
 * Major version number of BTLE stack
 */
  uint8_t BTLE_Stack_version_major;
/**
 * Minor version number of BTLE stack
 */
  uint8_t BTLE_Stack_version_minor;
/**
 * Patch version number of BTLE stack
 */
  uint8_t BTLE_Stack_version_patch;
/**
 * Specific variant build
 * Values:
 * - 0x00: Official release
 * - 0x01: Internal development release
 */
  uint8_t BTLE_Stack_development;
/**
 * Bitmask of BLE stack v4.x or later variants (modular configurations options
 * and link layer only)
 * Flags:
 * - 0x00000001: CONTROLLER_PRIVACY_ENABLED
 * - 0x00000002: SECURE_CONNECTIONS_ENABLED
 * - 0x00000004: CONTROLLER_SCAN_ENABLED
 * - 0x00000008: CONTROLLER_DATA_LENGTH_EXTENSION_ENABLED
 * - 0x00000010: LINK LAYER ONLY
 * - 0x00000020: CONTROLLER_2M_CODED_PHY_ENABLED
 * - 0x00000040: CONTROLLER_EXT_ADV_SCAN_ENABLED
 * - 0x00000080: L2CAP_COS_ENABLED
 * - 0x00000100: CONTROLLER_PERIODIC_ADV_ENABLED
 * - 0x00000200: CONTROLLER_CTE_ENABLED
 * - 0x00000400: CONTROLLER_POWER_CONTROL_ENABLED
 * - 0x00000800: CONNECTION_ENABLED
 * - 0x00010000: CONTROLLER_CHAN_CLASS_ENABLED
 * - 0x00020000: CONTROLLER_BIS_ENABLED
 * - 0x00080000: CONNECTION_SUBRATING_ENABLED
 * - 0x00100000: CONTROLLER_CIS_ENABLED
 * - 0x00400000: CONTROLLER_PERIODIC_ADV_WR
 */
  uint32_t BTLE_Stack_variant;
/**
 * Build number for BTLE stack
 */
  uint16_t BTLE_Stack_Build_Number;
} aci_hal_get_firmware_details_v2_rp0;

typedef PACKED(struct) aci_hal_write_config_data_cp0_s {
/**
 * Offset of the element in the configuration data structure which has to be
 * written. The valid offsets are:  - 0x00: Bluetooth public address, Value
 * length to be written: 6 bytes - 0x08: Encryption root key used to derive LTK
 * and CSRK, Value length to be written: 16 bytes - 0x18: Identity root key used
 * to derive LTK and CSRK, Value length to be written: 16 bytes - 0x2C: Link
 * layer without host (for certification purposes), Value length to be written:
 * 1 byte - 0x2E: If set, the stack uses this address as the static random
 * address instead of the one stored in NVM. - 0x2F: Value is a bit field that
 * indicates the advertising channel indices that shall be used when scanning.
 * At least one channel bit shall be set. Bit 0: ch. 37; bit 1: ch. 38; bit 2:
 * ch 39. - 0xD0: Use debug key for Secure connection: 1 byte - 0xD1: Set the
 * maximum allowed parameter values for Data Length Extension: 8 bytes, 2 bytes
 * for each of the following parameters:         supportedMaxTxOctets,
 * supportedMaxTxTime, supportedMaxRxOctets, supportedMaxRxTime, in little-
 * endian order.         (default 251,2120,251,2120).
 * Values:
 * - 0x00: CONFIG_DATA_PUBADDR_OFFSET
 * - 0x08: CONFIG_DATA_ER_OFFSET
 * - 0x18: CONFIG_DATA_IR_OFFSET
 * - 0x2C: LL_WITHOUT_HOST
 * - 0x2E: CONFIG_DATA_STATIC_RANDOM_ADDRESS
 * - 0x2F: CONFIG_DATA_SCAN_CH_MAP
 * - 0xD0: CONFIG_DATA_DEBUG_KEY
 * - 0xD1: CONFIG_DATA_DLE
 */
  uint8_t Offset;
/**
 * Length of data to be written
 */
  uint8_t Length;
/**
 * Data to be written
 */
  uint8_t Value[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(uint8_t)];
} aci_hal_write_config_data_cp0;

typedef PACKED(struct) aci_hal_write_config_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_write_config_data_rp0;

typedef PACKED(struct) aci_hal_read_config_data_cp0_s {
/**
 * Offset of the element in the configuration data structure which has to be
 * read. The valid offsets are:  - 0x00: Bluetooth public address, Value length
 * returned: 6 bytes - 0x08: Encryption root key used to derive LTK and CSRK,
 * Value length returned: 16 bytes - 0x18: Identity root key used to derive LTK
 * and CSRK, Value length returned: 16 bytes - 0x2C: Link layer without host
 * (for certification purposes), Value length returned: 1 byte - 0x80: The
 * static random address stored in NVM. Value length returned: 6 bytes (read-
 * only)
 * Values:
 * - 0x00: CONFIG_DATA_PUBADDR_OFFSET
 * - 0x08: CONFIG_DATA_ER_OFFSET
 * - 0x18: CONFIG_DATA_IR_OFFSET
 * - 0x2C: LL_WITHOUT_HOST
 * - 0x80: CONFIG_DATA_STORED_STATIC_RANDOM_ADDRESS
 */
  uint8_t Offset;
} aci_hal_read_config_data_cp0;

typedef PACKED(struct) aci_hal_read_config_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Length of Data in octets
 */
  uint8_t Data_Length;
/**
 * Data field associated with Offset parameter
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(uint8_t)];
} aci_hal_read_config_data_rp0;

typedef PACKED(struct) aci_hal_set_tx_power_level_cp0_s {
/**
 * Enable High Power mode, by changing SMPS level. High power mode should be
 * enabled only to reach the maximum output power. Normal power (0x00) is the
 * default.
 * Values:
 * - 0x00: Normal Power
 * - 0x01: High Power
 */
  uint8_t En_High_Power;
/**
 * Power amplifier output level. PA_Level 32 is available only for STM32WB09, to
 * select 8 dBm of output power.
 * Values:
 * - 0: -54/-54 dBm
 * - 1: -21/-19 dBm
 * - 2: -20/-18 dBm
 * - 3: -19/-17 dBm
 * - 4: -17/-16 dBm
 * - 5: -16/-15 dBm
 * - 6: -15/-14 dBm
 * - 7: -14/-13 dBm
 * - 8: -13/-12 dBm
 * - 9: -12/-11 dBm
 * - 10: -11/-10 dBm
 * - 11: -10/-9 dBm
 * - 12: -9/-8 dBm
 * - 13: -8/-7 dBm
 * - 14: -7/-6 dBm
 * - 15: -6/-5 dBm
 * - 16: -6/-4 dBm
 * - 17: -4/-3 dBm
 * - 18: -3/-3 dBm
 * - 19: -3/-2 dBm
 * - 20: -2/-1 dBm
 * - 21: -2/+0 dBm
 * - 22: -1/+1 dBm
 * - 23: -1/+2 dBm
 * - 24: +0/+3 dBm
 * - 25: +0/+8 dBm
 * - 26: +1/+8 dBm
 * - 27: +2/+8 dBm
 * - 28: +3/+8 dBm
 * - 29: +4/+8 dBm
 * - 30: +5/+8 dBm
 * - 31: +6/+8 dBm
 * - 32: +8 dBm
 */
  uint8_t PA_Level;
} aci_hal_set_tx_power_level_cp0;

typedef PACKED(struct) aci_hal_set_tx_power_level_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_set_tx_power_level_rp0;

typedef PACKED(struct) aci_hal_le_tx_test_packet_number_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Number of packets sent during the last Direct TX test.
 */
  uint32_t Number_Of_Packets;
} aci_hal_le_tx_test_packet_number_rp0;

