sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_hal_tone_start_cp0_s {
/**
 * BLE Channel ID, from 0x00 to 0x27 meaning (2.402 + 2*0xXX) GHz.
 * Values:
 * - 0x00 ... 0x27
 */
  uint8_t RF_Channel;
/**
 * Specify if the tone must be emitted with an offset from the channel center
 * frequency.  If 0, the tone is emitted at the channel center frequency. If 1
 * or 2, the device will continuously emit the tone at the center frequency plus
 * or minus 250 kHz respectively.
 * Values:
 * - 0x00: 0 kHz offset
 * - 0x01: +250 kHz offset
 * - 0x02: -250 kHz offset
 */
  uint8_t Offset;
} aci_hal_tone_start_cp0;

typedef PACKED(struct) aci_hal_tone_start_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_tone_start_rp0;

typedef PACKED(struct) aci_hal_tone_stop_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_tone_stop_rp0;

typedef PACKED(struct) aci_hal_get_link_status_cp0_s {
/**
 * Index that identifies the link bank. Each bank is made by 8 links. Set
 * Bank_Index to 0 to retrieve the status of the first 8 links, Bank_Index 1 to
 * retrieve the status of the second 8 links and so on.
 * Values:
 * - 0x00 ... 0x15
 */
  uint8_t Bank_index;
} aci_hal_get_link_status_cp0;

typedef PACKED(struct) aci_hal_get_link_status_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Array of link status (8 links). Each link status is 1 byte. - 0x00: Idle -
 * 0x01: Advertising - 0x02: Connected as peripheral - 0x03: Scanning - 0x04:
 * Initiating - 0x05: Connected as central - 0x06: TX test mode - 0x07: RX test
 * mode
 */
  uint8_t Link_Status[8];
/**
 * Array of connection handles (2 bytes) for 8 links.
 */
  uint16_t Link_Connection_Handle[16 / 2];
} aci_hal_get_link_status_rp0;

typedef PACKED(struct) aci_hal_set_radio_activity_mask_cp0_s {
/**
 * Bitmask of radio events
 * Flags:
 * - 0x0001: Idle
 * - 0x0002: Advertising
 * - 0x0004: Connection event peripheral
 * - 0x0008: Scanning
 * - 0x0010: Connection request
 * - 0x0020: Connection event central
 * - 0x0040: TX test mode
 * - 0x0080: RX test mode
 */
  uint16_t Radio_Activity_Mask;
} aci_hal_set_radio_activity_mask_cp0;

typedef PACKED(struct) aci_hal_set_radio_activity_mask_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_set_radio_activity_mask_rp0;

typedef PACKED(struct) aci_hal_set_le_power_control_cp0_s {
/**
 * Enable (1) or disable (0) LE power control on following connections. Default:
 * 1.
 * Values:
 * - 0x00: DISABLE
 * - 0x01: ENABLE
 */
  uint8_t Enable;
/**
 * PHY on which the power control must be enabled or disabled.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
/**
 * Target RSSI in dBm. Default: -55 dBm.
 */
  int8_t RSSI_Target;
/**
 * Hysteresis applied on the target RSSI in dB. Default: 15 dB.
 */
  uint8_t RSSI_Hysteresis;
/**
 * Initial TX power in dBm. Default: max TX power supported by the platform.
 */
  int8_t Initial_TX_Power;
/**
 * Coefficient used for the filtering of the RSSI samples and the calculation of
 * the average RSSI. Allowed values are from 0 (fast moving average, low
 * accuracy, max weight of last RSSI) to 4 (slow moving average, high accuracy,
 * min weight of last RSSI). Default: 2.
 * Values:
 * - 0x00 ... 0x04
 */
  uint8_t RSSI_Filtering_Coefficient;
} aci_hal_set_le_power_control_cp0;

typedef PACKED(struct) aci_hal_set_le_power_control_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_set_le_power_control_rp0;

typedef PACKED(struct) aci_hal_updater_start_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_updater_start_rp0;

typedef PACKED(struct) aci_hal_get_updater_version_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 */
  uint8_t Version;
} aci_hal_get_updater_version_rp0;

typedef PACKED(struct) aci_hal_get_updater_bufsize_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 */
  uint8_t Buffer_Size;
} aci_hal_get_updater_bufsize_rp0;

typedef PACKED(struct) aci_hal_updater_erase_blue_flag_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_updater_erase_blue_flag_rp0;

typedef PACKED(struct) aci_hal_updater_reset_blue_flag_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_updater_reset_blue_flag_rp0;

typedef PACKED(struct) aci_hal_updater_erase_sector_cp0_s {
/**
 *
 */
  uint32_t Address;
} aci_hal_updater_erase_sector_cp0;

typedef PACKED(struct) aci_hal_updater_erase_sector_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_updater_erase_sector_rp0;

typedef PACKED(struct) aci_hal_updater_prog_data_blk_cp0_s {
/**
 *
 */
  uint32_t Address;
/**
 * Length of Data in octets
 */
  uint16_t Data_Length;
/**
 *
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_hal_updater_prog_data_blk_cp0;

