sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_hal_updater_prog_data_blk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_updater_prog_data_blk_rp0;

typedef PACKED(struct) aci_hal_updater_read_data_blk_cp0_s {
/**
 *
 */
  uint32_t Address;
/**
 *
 */
  uint16_t Data_Length;
} aci_hal_updater_read_data_blk_cp0;

typedef PACKED(struct) aci_hal_updater_read_data_blk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 1)/sizeof(uint8_t)];
} aci_hal_updater_read_data_blk_rp0;

typedef PACKED(struct) aci_hal_updater_calc_crc_cp0_s {
/**
 *
 */
  uint32_t Address;
/**
 *
 */
  uint8_t Num_Of_Sectors;
} aci_hal_updater_calc_crc_cp0;

typedef PACKED(struct) aci_hal_updater_calc_crc_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 */
  uint32_t crc;
} aci_hal_updater_calc_crc_rp0;

typedef PACKED(struct) aci_hal_updater_hw_version_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * It is the content of Die ID register.
 */
  uint8_t HW_Version;
} aci_hal_updater_hw_version_rp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_cp0_s {
/**
 * N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
 * Values:
 * - 0x00 ... 0x27
 */
  uint8_t TX_Frequency;
/**
 * Length in bytes of payload data in each packet.     Supported ranges:       -
 * (0x00,0x25): BlueNRG-1 and BlueNRG-2 with BLE stack version < 2.1       -
 * (0x00,0xFF): BlueNRG-2 with BLE stack version >= 2.1 and extended packet
 * length.
 * Values:
 * - 0x00 ... 0xFF
 */
  uint8_t Length_Of_Test_Data;
/**
 * Type of packet payload.
 * Values:
 * - 0x00: Pseudo-Random bit sequence 9
 * - 0x01: Pattern of alternating bits '11110000'
 * - 0x02: Pattern of alternating bits '10101010'
 * - 0x03: Pseudo-Random bit sequence 15
 * - 0x04: Pattern of All '1' bits
 * - 0x05: Pattern of All '0' bits
 * - 0x06: Pattern of alternating bits '00001111'
 * - 0x07: Pattern of alternating bits '0101'
 */
  uint8_t Packet_Payload;
/**
 * Number of packets to be sent
 */
  uint16_t Number_Of_Packets;
/**
 * PHY to be used by the transmitter.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
} aci_hal_transmitter_test_packets_cp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_transmitter_test_packets_rp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_v2_cp0_s {
/**
 * N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
 * Values:
 * - 0x00 ... 0x27
 */
  uint8_t TX_Channel;
/**
 * Length in bytes of payload data in each packet.
 */
  uint8_t Test_Data_Length;
/**
 * Content of the Payload of the test reference packets.  0: PRBS9 sequence
 * '11111111100000111101...' (in transmission order) 1: Repeated '11110000' (in
 * transmission order) sequence 2: Repeated '10101010' (in transmission order)
 * sequence 3: PRBS15 sequence 4: Repeated '11111111' (in transmission order)
 * sequence 5: Repeated '00000000' (in transmission order) sequence 6: Repeated
 * '00001111' (in transmission order) sequence 7: Repeated '01010101' (in
 * transmission order) sequence
 * Values:
 * - 0x00: PRBS9
 * - 0x01: Repeated '11110000'
 * - 0x02: Repeated '10101010'
 * - 0x03: PRBS15
 * - 0x04: Repeated '11111111'
 * - 0x05: Repeated '00000000'
 * - 0x06: Repeated '00001111'
 * - 0x07: Repeated '01010101'
 */
  uint8_t Packet_Payload;
/**
 * Number of packets to be sent.
 */
  uint16_t Number_Of_Packets;
/**
 * PHY to be used by the transmitter.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
/**
 * Expected length of the Constant Tone Extension in 8 microseconds units. If 0,
 * no Constant Tone Extension expected.
 * Values:
 * - 0x00
 * - 0x02 ... 0x14
 */
  uint8_t CTE_Length;
/**
 * Type of the Constant Tone Extension in the test reference packets. 0: AoA; 1:
 * AoD with 1 us slots; 2: AoD with 2 us slots.
 * Values:
 * - 0x00: CTE_AOA
 * - 0x01: CTE_AOD_1us
 * - 0x02: CTE_AOD_2us
 */
  uint8_t CTE_Type;
/**
 * The number of Antenna IDs in the pattern.
 * Values:
 * - 0x02 ... 0x4B
 */
  uint8_t Switching_Pattern_Length;
/**
 * List of Antenna IDs in the pattern.
 */
  uint8_t Antenna_IDs[(HCI_MAX_PAYLOAD_SIZE - 9)/sizeof(uint8_t)];
} aci_hal_transmitter_test_packets_v2_cp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_v2_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_transmitter_test_packets_v2_rp0;

typedef PACKED(struct) aci_hal_write_radio_reg_cp0_s {
/**
 *
 */
  uint32_t Start_Address;
/**
 * Length of Data in octets
 */
  uint8_t Num_Bytes;
/**
 *
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(uint8_t)];
} aci_hal_write_radio_reg_cp0;

typedef PACKED(struct) aci_hal_write_radio_reg_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_write_radio_reg_rp0;

typedef PACKED(struct) aci_hal_read_radio_reg_cp0_s {
/**
 *
 */
  uint32_t Start_Address;
/**
 *
 */
  uint8_t Num_Bytes;
} aci_hal_read_radio_reg_cp0;

typedef PACKED(struct) aci_hal_read_radio_reg_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Length of Data in octets
 */
  uint8_t Data_Length;
/**
 *
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(uint8_t)];
} aci_hal_read_radio_reg_rp0;

typedef PACKED(struct) aci_hal_set_antenna_switch_parameters_cp0_s {
/**
 * ANTENNA_ID pins to be enabled. Each bit in the mask enables the corresponding
 * bit of the ANTENNA_ID signal, which is output on PB[0:6].
 * Flags:
 * - 0x01: ANTENNA_ID_0
 * - 0x02: ANTENNA_ID_1
 * - 0x04: ANTENNA_ID_2
 * - 0x08: ANTENNA_ID_3
 * - 0x10: ANTENNA_ID_4
 * - 0x20: ANTENNA_ID_5
 * - 0x40: ANTENNA_ID_6
 */
  uint8_t Antenna_IDs;
/**
 * This parameter can be set to a value different from zero to left shift the
 * ANTENNA_ID signal by the given number of bits. This number does not affect
 * the pin selected by Antenna_IDs parameter. E.g. to have the ANTENNA_ID signal
 * output on PB[2:4], set Antenna_IDs to enable ANTENNA_ID[2:4] (Antenna_IDs =
 * 0x1C) and Antenna_ID_Shift to 2.
 * Values:
 * - 0 ... 6
 */
  uint8_t Antenna_ID_Shift;
/**
 * The ID of antenna that the controller will select for regular communication.
 * The antenna to be used when sending or receiving the CTE field needs to be
 * specified through the Antenna_IDs parameter of the dedicated HCI commands
 * (i.e. hci_le_set_connectionless_cte_transmit_parameters,
 * hci_le_set_connectionless_iq_sampling_enable,
 * hci_le_set_connection_cte_receive_parameters and
 * hci_le_set_connection_cte_transmit_parameters).
 * Values:
 * - 0x00 ... 0x7F
 */
  uint8_t Default_Antenna_ID;
/**
 * Enable or disable the RF Activity signal, if supported by the device. This
 * signal can be used to enable the antenna switch only when necessary.
 * Values:
 * - 0x00: DISABLED
 * - 0x01: ENABLED
 */
  uint8_t RF_Activity_Enable;
} aci_hal_set_antenna_switch_parameters_cp0;

