sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_hal_set_antenna_switch_parameters_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_set_antenna_switch_parameters_rp0;

typedef PACKED(struct) aci_hal_peripheral_latency_enable_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Enable (1) or disable (0) the peripheral latency. Default value is Enabled
 * (1).
 * Values:
 * - 0x00: DISABLED
 * - 0x01: ENABLED
 */
  uint8_t Enable;
} aci_hal_peripheral_latency_enable_cp0;

typedef PACKED(struct) aci_hal_peripheral_latency_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_hal_peripheral_latency_enable_rp0;

typedef PACKED(struct) aci_hal_get_evt_fifo_max_level_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Maximum size reached by the FIFO used for critical controller events produced
 * by the ISR (e.g. rx data packets). See isr0_fifo_size parameter field of
 * BLE_STACK_InitTypeDef structure, used by BLE_STACK_Init().
 */
  uint16_t ISR0_FIFO_Max_Level;
/**
 * Maximum size reached by the FIFO used for non-critical controller events
 * produced by the ISR (e.g. advertising or IQ sampling reports). See
 * isr1_fifo_size parameter field of BLE_STACK_InitTypeDef structure, used by
 * BLE_STACK_Init().
 */
  uint16_t ISR1_FIFO_Max_Level;
/**
 * Maximum size reached by the FIFO used for controller and host events produced
 * outside the ISR. See user_fifo_size parameter field of BLE_STACK_InitTypeDef
 * structure, used by BLE_STACK_Init().
 */
  uint16_t User_FIFO_Max_Level;
} aci_hal_get_evt_fifo_max_level_rp0;

typedef PACKED(struct) aci_gap_init_cp0_s {
/**
 * Specify if privacy is enabled or not and which one .
 * Values:
 * - 0x00: Privacy disabled
 * - 0x01: Privacy host enabled
 * - 0x02: Privacy controller enabled
 */
  uint8_t Privacy_Type;
/**
 * Specify which address has to be used as Identity Address. 0x00: The public
 * address is used as identity address 0x01: The static random address is used
 * as identity address
 * Values:
 * - 0x00: Public Address
 * - 0x01: Static Random Address
 */
  uint8_t Identity_Address_Type;
} aci_gap_init_cp0;

typedef PACKED(struct) aci_gap_init_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_init_rp0;

typedef PACKED(struct) aci_gap_set_io_capability_cp0_s {
/**
 * IO capability of the device.
 * Values:
 * - 0x00: GAP_IO_CAP_DISPLAY_ONLY
 * - 0x01: GAP_IO_CAP_DISPLAY_YES_NO
 * - 0x02: GAP_IO_CAP_KEYBOARD_ONLY
 * - 0x03: GAP_IO_CAP_NO_INPUT_NO_OUTPUT
 * - 0x04: GAP_IO_CAP_KEYBOARD_DISPLAY
 */
  uint8_t IO_Capability;
} aci_gap_set_io_capability_cp0;

typedef PACKED(struct) aci_gap_set_io_capability_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_io_capability_rp0;

typedef PACKED(struct) aci_gap_set_security_requirements_cp0_s {
/**
 * Bonding mode. Only if bonding is enabled (0x01), the bonding information is
 * stored in flash
 * Values:
 * - 0x00: NO_BONDING
 * - 0x01: BONDING
 */
  uint8_t Bonding_Mode;
/**
 * MITM mode.
 * Values:
 * - 0x00: MITM_PROTECTION_NOT_REQUIRED
 * - 0x01: MITM_PROTECTION_REQUIRED
 */
  uint8_t MITM_Mode;
/**
 * LE Secure connections support. Secure Connections Only Mode (0x02) is the
 * recommended value. However it is no compatible with old devices not
 * supporting LE Secure Connections. - 0x00: Secure Connections Pairing not
 * supported. - 0x01: Secure Connections Pairing supported but optional. - 0x02:
 * Secure Connections Pairing supported and mandatory (SC Only Mode). This is
 * the recommended value.
 * Values:
 * - 0x00: GAP_SC_NOT_SUPPORTED
 * - 0x01: GAP_SC_OPTIONAL
 * - 0x02: GAP_SC_MANDATORY
 */
  uint8_t SC_Support;
/**
 * Keypress notification support
 * Values:
 * - 0x00: GAP_KEYPRESS_NOT_SUPPORTED
 * - 0x01: GAP_KEYPRESS_SUPPORTED
 */
  uint8_t KeyPress_Notification_Support;
/**
 * Minimum encryption key size to be used during pairing
 * Values:
 * - 7 ... 16
 */
  uint8_t Min_Encryption_Key_Size;
/**
 * Maximum encryption key size to be used during pairing
 * Values:
 * - 7 ... 16
 */
  uint8_t Max_Encryption_Key_Size;
/**
 * This parameter controls how pairing confirmation is managed.
 * Values:
 * - 0x00: GAP_PAIRING_RESP_NONE
 * - 0x01: GAP_PAIRING_RESP_FOR_BONDED_DEVICES
 * - 0x02: GAP_PAIRING_RESP_FOR_ALL
 */
  uint8_t Pairing_Response;
} aci_gap_set_security_requirements_cp0;

typedef PACKED(struct) aci_gap_set_security_requirements_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_security_requirements_rp0;

typedef PACKED(struct) aci_gap_passkey_resp_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Pass key that will be used during the pairing process.  Must be a six-digit
 * decimal number.
 * Values:
 * - 0 ... 999999
 */
  uint32_t Passkey;
} aci_gap_passkey_resp_cp0;

typedef PACKED(struct) aci_gap_passkey_resp_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_passkey_resp_rp0;

typedef PACKED(struct) aci_gap_profile_init_cp0_s {
/**
 * Bitmap of allowed roles. Ignored in stack v3.2 and earlier.
 * Flags:
 * - 0x01: Peripheral
 * - 0x02: Broadcaster
 * - 0x04: Central
 * - 0x08: Observer
 */
  uint8_t Role;
/**
 * Specify if privacy is enabled or not and which one .
 * Values:
 * - 0x00: Privacy disabled
 * - 0x01: Privacy host enabled
 * - 0x02: Privacy controller enabled
 */
  uint8_t Privacy_Type;
} aci_gap_profile_init_cp0;

typedef PACKED(struct) aci_gap_profile_init_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Device Name Characteristic handle
 */
  uint16_t Dev_Name_Char_Handle;
/**
 * Appearance Characteristic handle
 */
  uint16_t Appearance_Char_Handle;
/**
 * Appearance Characteristic handle
 */
  uint16_t Periph_Pref_Conn_Param_Char_Handle;
} aci_gap_profile_init_rp0;

