sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gap_set_security_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Indicates the minimum Security Level to be achieved.
 * Values:
 * - 0x01: GAP_SECURITY_LEVEL_1
 * - 0x02: GAP_SECURITY_LEVEL_2
 * - 0x03: GAP_SECURITY_LEVEL_3
 * - 0x04: GAP_SECURITY_LEVEL_4
 */
  uint8_t Security_Level;
/**
 * Valid only for Central role. Ignored if role is Peripheral.  The bit b0
 * indicates whether pairing request has to be sent even if the peer device is
 * bonded.   The bit b1 indicates whether the link has to be re-encrypted after
 * the key exchange.
 * Flags:
 * - 0x01: FORCE_PAIRING
 * - 0x02: ENCRYPT_AFTER_KEY_EXCHANGE
 */
  uint8_t Force_Pairing;
} aci_gap_set_security_cp0;

typedef PACKED(struct) aci_gap_set_security_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_security_rp0;

typedef PACKED(struct) aci_gap_get_security_level_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} aci_gap_get_security_level_cp0;

typedef PACKED(struct) aci_gap_get_security_level_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Security mode.
 * Values:
 * - 0x01: Security Mode 1
 * - 0x02: Security Mode 2
 */
  uint8_t Security_Mode;
/**
 * Security Level.
 * Values:
 * - 0x01: Security Level 1
 * - 0x02: Security Level 2
 * - 0x03: Security Level 3
 * - 0x04: Security Level 4
 */
  uint8_t Security_Level;
} aci_gap_get_security_level_rp0;

typedef PACKED(struct) aci_gap_set_le_event_mask_cp0_s {
/**
 * LE event mask. Default: 0x000000000000001F.
 * Flags:
 * - 0x0000000000000000: No LE events specified
 * - 0x0000000000000001: LE Connection Complete Event
 * - 0x0000000000000002: LE Advertising Report Event
 * - 0x0000000000000004: LE Connection Update Complete Event
 * - 0x0000000000000008: LE Read Remote Used Features Complete Event
 * - 0x0000000000000010: LE Long Term Key Request Event
 * - 0x0000000000000020: LE Remote Connection Parameter Request Event
 * - 0x0000000000000040: LE Data Length Change Event
 * - 0x0000000000000080: LE Read Local P-256 Public Key Complete Event
 * - 0x0000000000000100: LE Generate DHKey Complete Event
 * - 0x0000000000000200: LE Enhanced Connection Complete Event
 * - 0x0000000000000400: LE Directed Advertising Report Event
 * - 0x0000000000000800: LE PHY Update Complete event
 * - 0x0000000000001000: LE Extended Advertising Report event
 * - 0x0000000000002000: LE Periodic Advertising Sync Established event
 * - 0x0000000000004000: LE Periodic Advertising Report event
 * - 0x0000000000008000: LE Periodic Advertising Sync Lost event
 * - 0x0000000000010000: LE Scan Timeout event
 * - 0x0000000000020000: LE Advertising Set Terminated event
 * - 0x0000000000040000: LE Scan Request Received event
 * - 0x0000000000080000: LE Channel Selection Algorithm event
 * - 0x0000000000100000: LE Connectionless IQ Report event
 * - 0x0000000000200000: LE Connection IQ Report event
 * - 0x0000000000400000: LE CTE Request Failed event
 * - 0x0000000000800000: LE Periodic Advertising Sync Transfer Received event
 * - 0x0000000001000000: LE CIS Established event
 * - 0x0000000002000000: LE CIS Request event
 * - 0x0000000004000000: LE Create BIG Complete event
 * - 0x0000000008000000: LE Terminate BIG Complete event
 * - 0x0000000010000000: LE BIG Sync Established event
 * - 0x0000000020000000: LE BIG Sync Lost event
 * - 0x0000000040000000: LE Request Peer SCA Complete event
 * - 0x0000000080000000: LE Path Loss Threshold event
 * - 0x0000000100000000: LE Transmit Power Reporting event
 * - 0x0000000200000000: LE BIGInfo Advertising Report event
 * - 0x0000000400000000: LE Subrate Change event
 * - 0x0000000800000000: LE Periodic Advertising Sync Established event [v2]
 * - 0x0000001000000000: LE Periodic Advertising Report event [v2]
 * - 0x0000002000000000: LE Periodic Advertising Sync Transfer Received event [v2]
 * - 0x0000004000000000: LE Periodic Advertising Subevent Data Request event
 * - 0x0000008000000000: LE Periodic Advertising Response Report event
 * - 0x0000010000000000: LE Enhanced Connection Complete event [v2]
 */
  uint8_t LE_Event_Mask[8];
} aci_gap_set_le_event_mask_cp0;

typedef PACKED(struct) aci_gap_set_le_event_mask_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_le_event_mask_rp0;

typedef PACKED(struct) aci_gap_terminate_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The reason for ending the connection.
 * Values:
 * - 0x05: Authentication Failure
 * - 0x13: Remote User Terminated Connection
 * - 0x14: Remote Device Terminated Connection due to Low Resources
 * - 0x15: Remote Device Terminated Connection due to Power Off
 * - 0x1A: Unsupported Remote Feature
 * - 0x3B: Unacceptable Connection Parameters
 */
  uint8_t Reason;
} aci_gap_terminate_cp0;

typedef PACKED(struct) aci_gap_terminate_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_terminate_rp0;

typedef PACKED(struct) aci_gap_clear_security_db_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_clear_security_db_rp0;

typedef PACKED(struct) aci_gap_pairing_resp_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 *
 * Values:
 * - 0x00: REJECT
 * - 0x01: ACCEPT
 */
  uint8_t Accept;
} aci_gap_pairing_resp_cp0;

