sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gap_pairing_resp_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_pairing_resp_rp0;

typedef PACKED(struct) aci_gap_create_connection_cp0_s {
/**
 * PHYs that will be used for initiating the connection.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t Initiating_PHY;
/**
 * The Peer_Address_Type parameter indicates the type of address used in the
 * connectable advertisement sent by the peer. 0: Public Device Address or
 * Public Identity Address 1: Random Device Address or Random (static) Identity
 * Address
 * Values:
 * - 0x00: Public Address
 * - 0x01: Random Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
} aci_gap_create_connection_cp0;

typedef PACKED(struct) aci_gap_create_connection_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_create_connection_rp0;

typedef PACKED(struct) aci_gap_terminate_proc_cp0_s {
/**
 * Code identifying the procedure.
 * Values:
 * - 0x00: GAP_LIMITED_DISCOVERY_PROC
 * - 0x01: GAP_GENERAL_DISCOVERY_PROC
 * - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
 * - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
 * - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
 * - 0x05: GAP_OBSERVATION_PROC
 * - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
 * - 0x07: GAP_NAME_DISCOVERY_PROC
 */
  uint8_t Procedure_Code;
} aci_gap_terminate_proc_cp0;

typedef PACKED(struct) aci_gap_terminate_proc_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_terminate_proc_rp0;

typedef PACKED(struct) aci_gap_start_connection_update_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Minimum value for the connection event interval. This shall be less than or
 * equal to Connection_Interval_Max. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Min;
/**
 * Maximum value for the connection event interval. This shall be greater than
 * or equal to Connection_Interval_Min. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Max;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Max_Latency;
/**
 * Supervision timeout for the LE Link. It shall be a multiple of 10 ms and
 * larger than (1 + connPeripheralLatency) * connInterval * 2. Time = N * 10
 * msec.
 * Values:
 * - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 */
  uint16_t Supervision_Timeout;
/**
 * The minimum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Min_CE_Length;
/**
 * The maximum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Max_CE_Length;
} aci_gap_start_connection_update_cp0;

typedef PACKED(struct) aci_gap_start_connection_update_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_start_connection_update_rp0;

typedef PACKED(struct) aci_gap_resolve_private_addr_cp0_s {
/**
 * Address to be resolved
 */
  uint8_t Address[6];
} aci_gap_resolve_private_addr_cp0;

typedef PACKED(struct) aci_gap_resolve_private_addr_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * The public or static random address of the peer device, distributed during
 * pairing phase.
 */
  uint8_t Actual_Address[6];
} aci_gap_resolve_private_addr_rp0;

typedef PACKED(struct) aci_gap_get_bonded_devices_cp0_s {
/**
 * Index of the first record to be returned.
 */
  uint8_t Offset;
/**
 * Used to specify the maximum number of devices to be returned.
 */
  uint8_t Max_Num_Of_Addresses;
} aci_gap_get_bonded_devices_cp0;

typedef PACKED(struct) aci_gap_get_bonded_devices_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * The number of bonded devices returned by this command.
 */
  uint8_t Num_of_Addresses;
/**
 * See @ref Bonded_Device_Entry_t
 */
  packed_Bonded_Device_Entry_t Bonded_Device_Entry[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(packed_Bonded_Device_Entry_t)];
} aci_gap_get_bonded_devices_rp0;

typedef PACKED(struct) aci_gap_is_device_bonded_cp0_s {
/**
 * Address type.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 */
  uint8_t Peer_Address_Type;
/**
 * Address used by the peer device while advertising
 */
  uint8_t Peer_Address[6];
} aci_gap_is_device_bonded_cp0;

typedef PACKED(struct) aci_gap_is_device_bonded_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_is_device_bonded_rp0;

typedef PACKED(struct) aci_gap_numeric_comparison_value_confirm_yesno_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * 0 : The Numeric Values showed on both local and peer device are different! 1
 * : The Numeric Values showed on both local and peer device are equal!
 * Values:
 * - 0x00: No
 * - 0x01: YES
 */
  uint8_t Confirm_Yes_No;
} aci_gap_numeric_comparison_value_confirm_yesno_cp0;

typedef PACKED(struct) aci_gap_numeric_comparison_value_confirm_yesno_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_numeric_comparison_value_confirm_yesno_rp0;

typedef PACKED(struct) aci_gap_passkey_input_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Passkey input type detected
 * Values:
 * - 0x00: Passkey entry started
 * - 0x01: Passkey digit entered
 * - 0x02: Passkey digit erased
 * - 0x03: Passkey cleared
 * - 0x04: Passkey entry completed
 */
  uint8_t Input_Type;
} aci_gap_passkey_input_cp0;

typedef PACKED(struct) aci_gap_passkey_input_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_passkey_input_rp0;

typedef PACKED(struct) aci_gap_get_oob_data_cp0_s {
/**
 * OOB Data type. - 0x00: Legacy Pairing (LP) v.4.1 TK (Temporary Key) - 0x01:
 * Secure Connections (SC) v.4.2 Random value r used for generation of Confirm
 * value - 0x02: Secure Connections (SC) v.4.2 Confirm value C generated through
 * AES-CMAC-128 based cryptographic function: C=f4(PKx, PKx, r, 0)
 * Values:
 * - 0x00: SM_TK
 * - 0x01: SM_RANDOM_VALUE
 * - 0x02: SM_CONFIRM_VALUE
 */
  uint8_t OOB_Data_Type;
} aci_gap_get_oob_data_cp0;

typedef PACKED(struct) aci_gap_get_oob_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Identity address type.
 * Values:
 * - 0x00: Public Identity Address
 * - 0x01: Random (static) Identity Address
 */
  uint8_t Address_Type;
/**
 * Public or Random (static) address of this device
 */
  uint8_t Address[6];
/**
 * OOB Data type. - 0x00: Legacy Pairing (LP) v.4.1 TK (Temporary Key) - 0x01:
 * Secure Connections (SC) v.4.2 Random value r used for generation of Confirm
 * value - 0x02: Secure Connections (SC) v.4.2 Confirm value C generated through
 * AES-CMAC-128 based cryptographic function: C=f4(PKx, PKx, r, 0)
 * Values:
 * - 0x00: SM_TK
 * - 0x01: SM_RANDOM_VALUE
 * - 0x02: SM_CONFIRM_VALUE
 */
  uint8_t OOB_Data_Type;
/**
 * Length of OOB Data carried by next data field
 */
  uint8_t OOB_Data_Len;
/**
 * OOB Data to be exported via OOB.
 */
  uint8_t OOB_Data[16];
} aci_gap_get_oob_data_rp0;

typedef PACKED(struct) aci_gap_set_oob_data_cp0_s {
/**
 * If Device_Type is 0x00 (Local Device), it sets the local OOB authentication
 * data. If Device_Type is 0x01 (Remote Device), the command sets the OOB data
 * for the specified remote device (only one device at a time is supported).
 * Values:
 * - 0x00: Local device
 * - 0x01: Remote device
 */
  uint8_t Device_Type;
/**
 * Identity address type of the remote device. Ignored if Device_Type is 0.
 * Values:
 * - 0x00: Public Identity Address
 * - 0x01: Random (static) Identity Address
 */
  uint8_t Address_Type;
/**
 * Public or Random (static) address of the peer device. Ignored if Device_Type
 * is 0.
 */
  uint8_t Address[6];
/**
 * OOB Data type. - 0x00: Legacy Pairing (LP) v.4.1 TK (Temporary Key) - 0x01:
 * Secure Connections (SC) v.4.2 Random value r used for generation of Confirm
 * value - 0x02: Secure Connections (SC) v.4.2 Confirm value C generated through
 * AES-CMAC-128 based cryptographic function: C=f4(PKx, PKx, r, 0)
 * Values:
 * - 0x00: SM_TK
 * - 0x01: SM_RANDOM_VALUE
 * - 0x02: SM_CONFIRM_VALUE
 */
  uint8_t OOB_Data_Type;
/**
 * Length of OOB Data carried by next data field. It may be set to 0x00 to
 * trigger the automatic generation of local Random and Confirm values for LE
 * Secure Connections pairing.
 * Values:
 * - 0x00 ... 0x10
 */
  uint8_t OOB_Data_Len;
/**
 * OOB Data to be exported via OOB.
 */
  uint8_t OOB_Data[16];
} aci_gap_set_oob_data_cp0;

typedef PACKED(struct) aci_gap_set_oob_data_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_oob_data_rp0;

typedef PACKED(struct) aci_gap_remove_bonded_device_cp0_s {
/**
 * Identity address type.
 * Values:
 * - 0x00: Public Identity Address
 * - 0x01: Random (static) Identity Address
 */
  uint8_t Peer_Identity_Address_Type;
/**
 * Public or Random (static) Identity address of the peer device
 */
  uint8_t Peer_Identity_Address[6];
} aci_gap_remove_bonded_device_cp0;

typedef PACKED(struct) aci_gap_remove_bonded_device_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_remove_bonded_device_rp0;

