sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gap_set_advertising_configuration_cp0_s {
/**
 * Used to identify an advertising set. This parameter is only meaningful if
 * Extended Advertising Feature is enabled.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * Specifies the discoverable mode of the device.
 * Values:
 * - 0: Not Discoverable
 * - 1: Limited Discoverable
 * - 2: General Discoverable
 * - 3: Broadcast
 */
  uint8_t Discoverable_Mode;
/**
 * The Advertising_Event_Properties parameter describes the type of advertising
 * event that is being configured and its basic properties according to V5.1,
 * Vol 2, Part E, section 7.8.53.
 * Flags:
 * - 0x0001: Connectable
 * - 0x0002: Scannable
 * - 0x0004: Directed
 * - 0x0008: High Duty Cycle Directed Connectable
 * - 0x0010: Legacy
 * - 0x0020: Anonymous
 * - 0x0040: Include TX Power
 */
  uint16_t Advertising_Event_Properties;
/**
 * Minimum advertising interval for undirected and low duty cycle directed
 * advertising. Time = N * 0.625 msec.
 * Values:
 * - 0x00000020 (20.000 ms)  ... 0x00FFFFFF (10485759.375 ms) 
 */
  uint32_t Primary_Advertising_Interval_Min;
/**
 * Maximum advertising interval for undirected and low duty cycle directed
 * advertising. Time = N * 0.625 msec.
 * Values:
 * - 0x00000020 (20.000 ms)  ... 0x00FFFFFF (10485759.375 ms) 
 */
  uint32_t Primary_Advertising_Interval_Max;
/**
 * It is a bit field that indicates the advertising channels that shall be used
 * when transmitting advertising packets.
 * Flags:
 * - 0x01: CH_37
 * - 0x02: CH_38
 * - 0x04: CH_39
 */
  uint8_t Primary_Advertising_Channel_Map;
/**
 * The peer address type.
 * Values:
 * - 0x00: Public
 * - 0x01: Random
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
/**
 * Advertising Filter Policy. If Directed advertising is selected, the
 * Peer_Address_Type and Peer_Address shall be valid and the
 * Advertising_Filter_Policy parameter shall be ignored.  0x00 Process scan and
 * connection requests from all devices (i.e., the Filter Accept List is not in
 * use) 0x01 Process connection requests from all devices and scan requests only
 * from devices that are in the Filter Accept List 0x02 Process scan requests
 * from all devices and connection requests only from devices that are in the
 * Filter Accept List. 0x03 Process scan and connection requests only from
 * devices in the Filter Accept List. All other values Reserved for future use
 * Values:
 * - 0x00: Scan and Connection requests from any
 * - 0x01: Connection requests from any, scan requests from Filter Accept List only
 * - 0x02: Scan requests from any, connection requests from Filter Accept List only
 * - 0x03: Scan and connection requests from Filter Accept List only
 */
  uint8_t Advertising_Filter_Policy;
/**
 * The Advertising_Tx_Power parameter indicates the maximum power level at which
 * the advertising packets are to be transmitted on the advertising channels.
 * The Controller shall choose a power level lower than or equal to the one
 * specified by the Host. (Units: dBm). This parameter is ignored if extended
 * advertising is not enabled.
 * Values:
 * - -127 ... 126
 * - 127: No preference
 */
  int8_t Advertising_Tx_Power;
/**
 * The Primary_Advertising_PHY parameter indicates the PHY on which the
 * advertising packets are transmitted on the primary advertising channel. If
 * legacy advertising PDUs are being used, the Primary_Advertising_PHY shall
 * indicate the LE 1M PHY. This parameter is ignored if extended advertising is
 * not enabled.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t Primary_Advertising_PHY;
/**
 * The Secondary_Advertising_Max_Skip parameter is the maximum number of
 * advertising events that can be skipped before the AUX_ADV_IND can be sent.
 * This parameter is ignored if extended advertising is not enabled. 0x00
 * AUX_ADV_IND shall be sent prior to the next advertising event 0x01-0xFF
 * Maximum advertising events the Controller can skip before sending the
 * AUX_ADV_IND packets on the secondary advertising channel
 */
  uint8_t Secondary_Advertising_Max_Skip;
/**
 * The Secondary_Advertising_PHY parameter indicates the PHY on which the
 * advertising packets are be transmitted on the secondary advertising channel.
 * This parameter is ignored if extended advertising is not enabled.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t Secondary_Advertising_PHY;
/**
 * The Advertising_SID parameter specifies the value to be transmitted in the
 * Advertising SID subfield of the ADI field of the Extended Header of those
 * advertising channel PDUs that have an ADI field. If the advertising set only
 * uses PDUs that do not contain an ADI field, Advertising_SID is ignored. This
 * parameter is ignored if extended advertising is not enabled.
 * Values:
 * - 0x00 ... 0x0F
 */
  uint8_t Advertising_SID;
/**
 * The Scan_Request_Notification_Enable parameter indicates whether the
 * Controller shall send notifications upon the receipt of a scan request PDU
 * that is in response to an advertisement from the specified advertising set
 * that contains its device address and is from a scanner that is allowed by the
 * advertising filter policy. This parameter is ignored if extended advertising
 * is not enabled.
 * Values:
 * - 0x00: Scan request notifications disabled
 * - 0x01: Scan request notifications enabled
 */
  uint8_t Scan_Request_Notification_Enable;
} aci_gap_set_advertising_configuration_cp0;

typedef PACKED(struct) aci_gap_set_advertising_configuration_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_advertising_configuration_rp0;

typedef PACKED(struct) aci_gap_set_advertising_enable_cp0_s {
/**
 * It allows to enable or disable one or more advertising sets using the
 * advertising sets identified by the Advertising_Handle[i] parameter.
 * Values:
 * - 0x00: Disable
 * - 0x01: Enable
 */
  uint8_t Enable;
/**
 * The Number_of_Sets parameter is the number of advertising sets contained in
 * the parameter arrays. 0x00: Disable all advertising sets 0x01 to 0x3F: Number
 * of advertising sets to enable or disable. Ignored if extended advertising
 * feature is disabled through modular configuration
 * (CONTROLLER_EXT_ADV_SCAN_ENABLED=0).
 * Values:
 * - 0x00: Disable all sets
 * - 0x01 ... 0x3F
 */
  uint8_t Number_of_Sets;
/**
 * See @ref Advertising_Set_Parameters_t
 */
  packed_Advertising_Set_Parameters_t Advertising_Set_Parameters[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(packed_Advertising_Set_Parameters_t)];
} aci_gap_set_advertising_enable_cp0;

typedef PACKED(struct) aci_gap_set_advertising_enable_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_advertising_enable_rp0;

typedef PACKED(struct) aci_gap_set_advertising_data_nwk_cp0_s {
/**
 * Used to identify an advertising set. This parameter is only meaningful if
 * Extended Advertising Feature is enabled.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * The Host may set the advertising data in one or more operations using this
 * parameter. 0x00: Intermediate fragment of fragmented extended advertising
 * data 0x01: First fragment of fragmented extended advertising data 0x02: Last
 * fragment of fragmented extended advertising data 0x03: Complete extended
 * advertising data 0x04: Unchanged data (just update the Advertising DID) All
 * other values: Reserved for future use
 * Values:
 * - 0x00: Intermediate fragment
 * - 0x01: First fragment
 * - 0x02: Last fragment
 * - 0x03: Complete data
 * - 0x04: Unchanged data
 */
  uint8_t Operation;
/**
 * Length of advertising data. For legacy PDUs which supports advertising data
 * maximum value is 31 octets.
 * Values:
 * - 0 ... 251
 */
  uint8_t Advertising_Data_Length;
/**
 * Advertising data, that must be properly formatted (see Core v5.1 Vol 3, part
 * C, chapter 11).
 */
  uint8_t Advertising_Data[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint8_t)];
} aci_gap_set_advertising_data_nwk_cp0;

typedef PACKED(struct) aci_gap_set_advertising_data_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_advertising_data_nwk_rp0;

typedef PACKED(struct) aci_gap_set_scan_response_data_nwk_cp0_s {
/**
 * Used to identify an advertising set. This parameter is only meaningful if
 * Extended Advertising Feature is enabled.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t Advertising_Handle;
/**
 * The Host may set the scan response data in one or more operations using the
 * Operation parameter in the command. 0x00: Intermediate fragment of fragmented
 * scan response data 0x01: First fragment of fragmented scan response data
 * 0x02: Last fragment of fragmented scan response data 0x03: Complete scan
 * response data All other values: Reserved for future use
 * Values:
 * - 0x00: Intermediate fragment
 * - 0x01: First fragment
 * - 0x02: Last fragment
 * - 0x03: Complete data
 */
  uint8_t Operation;
/**
 * Length of scan response data. If the advertising set uses scannable legacy
 * advertising PDUs maximum length is 31 octets.
 * Values:
 * - 0 ... 251
 */
  uint8_t Scan_Response_Data_Length;
/**
 * Scan response data, that must be properly formatted (see Core v5.1 Vol 3,
 * part C, chapter 11).
 */
  uint8_t Scan_Response_Data[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint8_t)];
} aci_gap_set_scan_response_data_nwk_cp0;

typedef PACKED(struct) aci_gap_set_scan_response_data_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_scan_response_data_nwk_rp0;

