sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gap_set_scan_configuration_cp0_s {
/**
 * The Filter_Duplicates parameter controls whether the Link Layer should filter
 * out duplicate advertising reports (filtering duplicates enabled) to the Host
 * or if the Link Layer should generate advertising reports for each packet
 * received (filtering duplicates disabled). See [Vol 6] Part B, Section
 * 4.4.3.5.
 * Values:
 * - 0x00: Duplicate filtering disabled
 * - 0x01: Duplicate filtering enabled
 * - 0x02: Duplicate filtering enabled, reset for each scan period
 */
  uint8_t Filter_Duplicates;
/**
 * 0x00 Accept all advertisement packets. Directed advertising packets which are
 * not addressed for this device shall be ignored. 0x01 Ignore advertisement
 * packets from devices not in the Filter Accept List Only. Directed advertising
 * packets which are not addressed for this device shall be ignored 0x02 Accept
 * all undirected advertisement packets. Directed advertisement packets where
 * initiator address is a RPA and  Directed advertisement packets addressed to
 * this device shall be accepted. 0x03 Accept all undirected advertisement
 * packets from devices that are in the Filter Accept List.Directed
 * advertisement packets where initiator address is RPA and Directed
 * advertisement packets addressed to this device shall be accepted.
 * Values:
 * - 0x00: Accept All
 * - 0x01: Filter Accept List Only
 * - 0x02: Accept All (use resolving list)
 * - 0x03: Filter Accept List Only (use resolving list)
 */
  uint8_t Scanning_Filter_Policy;
/**
 * PHY that is going to be configured. Only one bit can be set.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t Scanning_PHY;
/**
 * The Scan_Type parameter specifies the type of scan to perform. 0: Passive
 * Scanning. No scan request PDUs shall be sent. 1: Active Scanning. Scan
 * request PDUs may be sent.
 * Values:
 * - 0x00: Passive Scanning
 * - 0x01: Active Scanning
 */
  uint8_t Scan_Type;
/**
 * Time interval from when the Controller started its last scan until it begins
 * the subsequent scan on the primary advertising physical channel.  Time = N *
 * 0.625 ms
 * Values:
 * - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
 */
  uint16_t Scan_Interval;
/**
 * Time interval from when the Controller started its last scan until it begins
 * the subsequent scan on the primary advertising physical channel. Time = N *
 * 0.625 msec.
 * Values:
 * - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
 */
  uint16_t Scan_Window;
} aci_gap_set_scan_configuration_cp0;

typedef PACKED(struct) aci_gap_set_scan_configuration_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_scan_configuration_rp0;

typedef PACKED(struct) aci_gap_set_connection_configuration_cp0_s {
/**
 * PHY that is going to be configured. Only one bit can be set.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x02: LE_2M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t Initiating_PHY;
/**
 * Minimum value for the connection event interval. This shall be less than or
 * equal to Connection_Interval_Max. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Min;
/**
 * Maximum value for the connection event interval. This shall be greater than
 * or equal to Connection_Interval_Min. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Max;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Max_Latency;
/**
 * Supervision timeout for the LE Link. It shall be a multiple of 10 ms and
 * larger than (1 + connPeripheralLatency) * connInterval * 2. Time = N * 10
 * msec.
 * Values:
 * - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 */
  uint16_t Supervision_Timeout;
/**
 * The minimum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Min_CE_Length;
/**
 * The maximum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Max_CE_Length;
} aci_gap_set_connection_configuration_cp0;

typedef PACKED(struct) aci_gap_set_connection_configuration_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_set_connection_configuration_rp0;

typedef PACKED(struct) aci_gap_start_procedure_cp0_s {
/**
 * Procedure to be started.
 * Values:
 * - 0x00: GAP_LIMITED_DISCOVERY_PROC
 * - 0x01: GAP_GENERAL_DISCOVERY_PROC
 * - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
 * - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
 * - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
 * - 0x05: GAP_OBSERVATION_PROC
 */
  uint8_t Procedure_Code;
/**
 * PHYs that will be used for Scanning or Initiating .
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t PHYs;
/**
 * Ignored. Reserved for future use.
 */
  uint16_t Duration;
/**
 * Ignored. Reserved for future use.
 */
  uint16_t Period;
} aci_gap_start_procedure_cp0;

typedef PACKED(struct) aci_gap_start_procedure_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_start_procedure_rp0;

typedef PACKED(struct) aci_gap_discover_name_cp0_s {
/**
 * PHYs that will be used for initiating the connection.
 * Flags:
 * - 0x01: LE_1M_PHY_BIT
 * - 0x04: LE_CODED_PHY_BIT
 */
  uint8_t PHYs;
/**
 * The Peer_Address_Type parameter indicates the type of address used in the
 * connectable advertisement sent by the peer. 0: Public Device Address or
 * Public Identity Address 1: Random Device Address or Random (static) Identity
 * Address
 * Values:
 * - 0x00: Public Address
 * - 0x01: Random Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
} aci_gap_discover_name_cp0;

