sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gap_discover_name_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_discover_name_rp0;

typedef PACKED(struct) aci_gap_add_devices_to_filter_accept_and_resolving_list_cp0_s {
/**
 * Select in which list the device addresses will be added: Filter Accept List,
 * resolving list or both.
 * Flags:
 * - 0x01: Filter Accept List
 * - 0x02: Resolving List
 */
  uint8_t Lists;
/**
 * Clear the selected lists before adding the device addresses.
 * Values:
 * - 0x00: Do not clear
 * - 0x01: Clear before adding
 */
  uint8_t Clear_Lists;
/**
 * Number of devices that have to be added to the Filter Accept List.
 * Values:
 * - 0x00 ... 0xFF
 */
  uint8_t Num_of_List_Entries;
/**
 * See @ref List_Entry_t
 */
  packed_List_Entry_t List_Entry[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(packed_List_Entry_t)];
} aci_gap_add_devices_to_filter_accept_and_resolving_list_cp0;

typedef PACKED(struct) aci_gap_add_devices_to_filter_accept_and_resolving_list_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_add_devices_to_filter_accept_and_resolving_list_rp0;

typedef PACKED(struct) aci_gap_configure_filter_accept_and_resolving_list_cp0_s {
/**
 * Select in which list the device addresses will be added: Filter Accept List,
 * resolving list or both.
 * Flags:
 * - 0x01: Filter Accept List
 * - 0x02: Resolving List
 */
  uint8_t Lists;
} aci_gap_configure_filter_accept_and_resolving_list_cp0;

typedef PACKED(struct) aci_gap_configure_filter_accept_and_resolving_list_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_configure_filter_accept_and_resolving_list_rp0;

typedef PACKED(struct) aci_gap_remove_advertising_set_cp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF: Used to identify an advertising set
 */
  uint8_t Advertising_Handle;
} aci_gap_remove_advertising_set_cp0;

typedef PACKED(struct) aci_gap_remove_advertising_set_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_remove_advertising_set_rp0;

typedef PACKED(struct) aci_gap_clear_advertising_sets_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_clear_advertising_sets_rp0;

typedef PACKED(struct) aci_gap_create_periodic_advertising_connection_cp0_s {
/**
 * Advertising_Handle identifying the periodic advertising train.
 * Values:
 * - 0x00 ... 0xEF
 * - 0xFF: Not specified
 */
  uint8_t Advertising_Handle;
/**
 * Subevent where the connection request is to be sent.
 * Values:
 * - 0x00 ... 0x7F
 * - 0xFF: Not specified
 */
  uint8_t Subevent;
/**
 * The Initiator_Filter_Policy parameter is used to determine whether the Filter
 * Accept List is used. If the Filter Accept List is not used, the
 * Peer_Address_Type and the Peer_Address parameters specify the address type
 * and address of the device to connect to.  0x00 - Filter Accept List is not
 * used to determine which device to connect to. Peer_Address_Type and
 * Peer_Address shall be used. 0x01 - Filter Accept List is used to determine
 * which device to connect to. Peer_Address_Type and Peer_Address shall be
 * ignored.
 * Values:
 * - 0x00: FILTER_ACCEPT_LIST_NOT_USED
 * - 0x01: FILTER_ACCEPT_LIST_USED
 */
  uint8_t Initiator_Filter_Policy;
/**
 * The Own_Address_Type parameter indicates the type of address being used in
 * the connection request packets.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
 * - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from the most recent successful
LE_Set_Random_Address Command.
 */
  uint8_t Own_Address_Type;
/**
 * The Peer_Address_Type parameter indicates the type of address used in the
 * connectable advertisement sent by the peer. 0x00: Public Device Address or
 * Public Identity Address 0x01: Random Device Address or Random (static)
 * Identity Address
 * Values:
 * - 0x00: Public Address
 * - 0x01: Random Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
/**
 * Minimum value for the connection interval. This shall be less than or equal
 * to Connection_Interval_Max. Time = N x 1.25 ms.
 * Values:
 * - 0x0006 ... 0x0C80
 */
  uint16_t Connection_Interval_Min;
/**
 * Maximum value for the connection interval. This shall be greater than or
 * equal to Connection_Interval_Min.  Time = N x 1.25 ms
 * Values:
 * - 0x0006 ... 0x0C80
 */
  uint16_t Connection_Interval_Max;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Max_Latency;
/**
 * Supervision timeout for the LE Link.  Time = N x 10 ms
 * Values:
 * - 0x000A ... 0x0C80
 */
  uint16_t Supervision_Timeout;
/**
 * The minimum length of connection event recommended for this LE connection.
 */
  uint16_t Min_CE_Length;
/**
 * The maximum length of connection event recommended for this LE connection.
 */
  uint16_t Max_CE_Length;
} aci_gap_create_periodic_advertising_connection_cp0;

typedef PACKED(struct) aci_gap_create_periodic_advertising_connection_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gap_create_periodic_advertising_connection_rp0;

typedef PACKED(struct) aci_gap_encrypt_adv_data_nwk_cp0_s {
/**
 *
 */
  uint8_t Session_Key[16];
/**
 *
 */
  uint8_t IV[8];
/**
 * Length of Data.
 */
  uint8_t Data_Length;
/**
 * Data to be encrypted.
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 25)/sizeof(uint8_t)];
} aci_gap_encrypt_adv_data_nwk_cp0;

