sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gap_encrypt_adv_data_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Length of Encrypted_Data.
 */
  uint8_t Encrypted_Data_Length;
/**
 * Encrypted data, including Randomizer (5 bytes) and MIC (4 bytes).
 */
  uint8_t Encrypted_Data[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(uint8_t)];
} aci_gap_encrypt_adv_data_nwk_rp0;

typedef PACKED(struct) aci_gap_decrypt_adv_data_nwk_cp0_s {
/**
 *
 */
  uint8_t Session_Key[16];
/**
 *
 */
  uint8_t IV[8];
/**
 * Length of Encrypted_Data.
 */
  uint8_t Encrypted_Data_Length;
/**
 * Encrypted Data, containing Randomizer and MIC.
 */
  uint8_t Encrypted_Data[(HCI_MAX_PAYLOAD_SIZE - 25)/sizeof(uint8_t)];
} aci_gap_decrypt_adv_data_nwk_cp0;

typedef PACKED(struct) aci_gap_decrypt_adv_data_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Length of Decrypted_Data.
 */
  uint8_t Decrypted_Data_Length;
/**
 * Decrypted data, without Randomizer and MIC.
 */
  uint8_t Decrypted_Data[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(uint8_t)];
} aci_gap_decrypt_adv_data_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_profile_init_cp0_s {
/**
 * This is a bit field indicating if a characteristic in the GATT service shall
 * be added or not. bit 0: if set, the Service Changed Characteristic will be
 * added to the GATT Service. Service Changed characteristic is required if
 * service definitions may be added, changed, or removed. Otherwise it is
 * optional.
 * Flags:
 * - 0x01: SERVICE_CHANGED_CHAR_BIT
 */
  uint8_t Characteristics;
} aci_gatt_srv_profile_init_cp0;

typedef PACKED(struct) aci_gatt_srv_profile_init_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Handle of the Service Changed Characteristic. Characteristic value is at
 * following handle.
 */
  uint16_t Service_Changed_Handle;
} aci_gatt_srv_profile_init_rp0;

typedef PACKED(struct) aci_gatt_srv_add_service_nwk_cp0_s {
/**
 * UUID type.
 * Values:
 * - 0x01: 16-bit UUID
 * - 0x02: 128-bit UUID
 */
  uint8_t Service_UUID_Type;
/**
 * See @ref Service_UUID_t
 */
  packed_Service_UUID_t Service_UUID;
} aci_gatt_srv_add_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_add_service_nwk_cp1_s {
/**
 * Service type.
 * Values:
 * - 0x01: Primary Service
 * - 0x02: Secondary Service
 */
  uint8_t Service_Type;
/**
 * Number of handles reserved for the service. If 0, no handles are served and
 * when the next service is added to the GATT database, the first available
 * handle is assigned to that service (this means that no more attributes can be
 * assigned to the previously created service).
 */
  uint8_t Max_Attribute_Records;
} aci_gatt_srv_add_service_nwk_cp1;

typedef PACKED(struct) aci_gatt_srv_add_service_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Handle of the Service. When this service is added, a handle is allocated by
 * the server for this service.  Server also allocates a range of handles for
 * this service from serviceHandle to <serviceHandle + max_attr_records - 1>
 */
  uint16_t Service_Handle;
} aci_gatt_srv_add_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_include_service_nwk_cp0_s {
/**
 * Handle of the Service to which another service has to be included.
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Service_Handle;
/**
 * Attribute Handle of the Service which has to be included in service
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Included_Service_Handle;
} aci_gatt_srv_include_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_include_service_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Handle of the include declaration
 */
  uint16_t Include_Handle;
} aci_gatt_srv_include_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_add_char_nwk_cp0_s {
/**
 * Handle of the Service to which the characteristic will be added.
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Service_Handle;
/**
 * UUID type.
 * Values:
 * - 0x01: 16-bit UUID
 * - 0x02: 128-bit UUID
 */
  uint8_t Char_UUID_Type;
/**
 * See @ref Char_UUID_t
 */
  packed_Char_UUID_t Char_UUID;
} aci_gatt_srv_add_char_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_add_char_nwk_cp1_s {
/**
 * Maximum length of the characteristic value.
 * Values:
 * - 0 ... 512
 */
  uint16_t Char_Value_Length;
/**
 * Characteristic Properties (Volume 3, Part G, section 3.3.1.1 of Bluetooth
 * Specification 4.1)
 * Flags:
 * - 0x00: CHAR_PROP_NONE
 * - 0x01: CHAR_PROP_BROADCAST (Broadcast)
 * - 0x02: CHAR_PROP_READ (Read)
 * - 0x04: CHAR_PROP_WRITE_WITHOUT_RESP (Write w/o resp)
 * - 0x08: CHAR_PROP_WRITE (Write)
 * - 0x10: CHAR_PROP_NOTIFY (Notify)
 * - 0x20: CHAR_PROP_INDICATE (Indicate)
 * - 0x40: CHAR_PROP_SIGNED_WRITE (Authenticated Signed Writes)
 * - 0x80: CHAR_PROP_EXT (Extended Properties)
 */
  uint8_t Char_Properties;
/**
 * Security permission flags.
 * Flags:
 * - 0x00
 * - 0x01: AUTHEN_READ (Need authentication to read)
 * - 0x04: ENCRY_READ (Need encryption to read)
 * - 0x08: AUTHEN_WRITE (need authentication to write)
 * - 0x20: ENCRY_WRITE (need encryption to write)
 */
  uint8_t Security_Permissions;
/**
 * GATT event mask. - GATT_NOTIFY_ATTRIBUTE_WRITE:
 * aci_gatt_srv_attribute_modified_event is generated when characteristic value
 * is modified. - GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP:
 * aci_gatt_srv_authorize_nwk_event is generated when a write operation is
 * received on the characteristic value. -
 * GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP: aci_gatt_srv_authorize_nwk_event
 * is generated when a read request is received on the characteristic value.
 * Flags:
 * - 0x00: GATT_DONT_NOTIFY_EVENTS
 * - 0x01: GATT_NOTIFY_ATTRIBUTE_WRITE
 * - 0x02: GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP
 * - 0x04: GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP
 */
  uint8_t GATT_Evt_Mask;
/**
 * Minimum encryption key size required to read the characteristic.
 * Values:
 * - 0x07 ... 0x10
 */
  uint8_t Enc_Key_Size;
/**
 * Specify if the characteristic value has a fixed length or a variable length.
 * Values:
 * - 0x00: Fixed length
 * - 0x01: Variable length
 */
  uint8_t Is_Variable;
} aci_gatt_srv_add_char_nwk_cp1;

typedef PACKED(struct) aci_gatt_srv_add_char_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Handle of the Characteristic that has been added.  It is the handle of the
 * characteristic declaration.  The attribute that holds the characteristic
 * value is allocated at the next handle,  followed by the Client Characteristic
 * Configuration descriptor if the characteristic  has CHAR_PROP_NOTIFY or
 * CHAR_PROP_INDICATE properties.
 */
  uint16_t Char_Handle;
} aci_gatt_srv_add_char_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_cp0_s {
/**
 * Handle of the characteristic to which description has to be added
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Char_Handle;
/**
 * UUID type.
 * Values:
 * - 0x01: 16-bit UUID
 * - 0x02: 128-bit UUID
 */
  uint8_t Char_Desc_Uuid_Type;
/**
 * See @ref Char_Desc_Uuid_t
 */
  packed_Char_Desc_Uuid_t Char_Desc_Uuid;
} aci_gatt_srv_add_char_desc_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_cp1_s {
/**
 * The maximum length of the descriptor value
 * Values:
 * - 0 ... 512
 */
  uint16_t Char_Desc_Value_Max_Len;
/**
 * Current Length of the characteristic descriptor value
 * Values:
 * - 0 ... 512
 */
  uint16_t Char_Desc_Value_Length;
/**
 * Value of the characteristic description
 */
  uint8_t Char_Desc_Value[(HCI_MAX_PAYLOAD_SIZE - 4)/sizeof(uint8_t)];
} aci_gatt_srv_add_char_desc_nwk_cp1;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_cp2_s {
/**
 * Security permission flags.
 * Flags:
 * - 0x00
 * - 0x01: AUTHEN_READ (Need authentication to read)
 * - 0x04: ENCRY_READ (Need encryption to read)
 * - 0x08: AUTHEN_WRITE (need authentication to write)
 * - 0x20: ENCRY_WRITE (need encryption to write)
 */
  uint8_t Security_Permissions;
/**
 * Access permission
 * Flags:
 * - 0x00: None
 * - 0x01: READ
 * - 0x02: WRITE
 * - 0x04: WRITE_WO_RESP
 * - 0x08: SIGNED_WRITE
 */
  uint8_t Access_Permissions;
/**
 * GATT event mask. - GATT_NOTIFY_ATTRIBUTE_WRITE:
 * aci_gatt_srv_attribute_modified_event is generated when characteristic value
 * is modified. - GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP:
 * aci_gatt_srv_authorize_nwk_event is generated when a write operation is
 * received on the characteristic value. -
 * GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP: aci_gatt_srv_authorize_nwk_event
 * is generated when a read request is received on the characteristic value.
 * Flags:
 * - 0x00: GATT_DONT_NOTIFY_EVENTS
 * - 0x01: GATT_NOTIFY_ATTRIBUTE_WRITE
 * - 0x02: GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP
 * - 0x04: GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP
 */
  uint8_t GATT_Evt_Mask;
/**
 * Minimum encryption key size required to read the characteristic.
 * Values:
 * - 0x07 ... 0x10
 */
  uint8_t Enc_Key_Size;
/**
 * Specify if the characteristic value has a fixed length or a variable length.
 * Values:
 * - 0x00: Fixed length
 * - 0x01: Variable length
 */
  uint8_t Is_Variable;
} aci_gatt_srv_add_char_desc_nwk_cp2;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Handle of the characteristic descriptor
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Char_Desc_Handle;
} aci_gatt_srv_add_char_desc_nwk_rp0;

