sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gatt_srv_write_handle_value_nwk_cp0_s {
/**
 * Handle of the attribute
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * The offset from which the attribute value has to be updated.  If this is set
 * to 0 and the attribute value is of variable length, then the length of the
 * attribute will be set to the Char_Value_Length.  If the Val_Offset is set to
 * a value greater than 0, then the length of the attribute will be set to the
 * maximum length as  specified for the attribute while adding the
 * characteristic.
 * Values:
 * - 0 ... 511
 */
  uint16_t Val_Offset;
/**
 * Length of the attribute value in octets
 */
  uint16_t Value_Length;
/**
 * Attribute value
 */
  uint8_t Value[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_gatt_srv_write_handle_value_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_write_handle_value_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_write_handle_value_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_rm_char_nwk_cp0_s {
/**
 * Handle of the characteristic which has to be deleted
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Char_Handle;
} aci_gatt_srv_rm_char_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_rm_char_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_rm_char_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_rm_service_nwk_cp0_s {
/**
 * Handle of the service to be deleted
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Serv_Handle;
} aci_gatt_srv_rm_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_rm_service_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_rm_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_rm_include_service_nwk_cp0_s {
/**
 * Handle of the included service which has to be deleted
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Include_Handle;
} aci_gatt_srv_rm_include_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_rm_include_service_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_rm_include_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_set_event_mask_cp0_s {
/**
 * GATT/ATT event mask.
 * Values:
 * - 0x00000001: ACI_GATT_ATTRIBUTE_MODIFIED_EVENT
 * - 0x00000002: ACI_GATT_PROC_TIMEOUT_EVENT
 * - 0x00000004: ACI_ATT_EXCHANGE_MTU_RESP_EVENT
 * - 0x00000008: ACI_ATT_FIND_INFO_RESP_EVENT
 * - 0x00000010: ACI_ATT_FIND_BY_TYPE_VALUE_RESP_EVENT
 * - 0x00000020: ACI_ATT_READ_BY_TYPE_RESP_EVENT
 * - 0x00000040: ACI_ATT_READ_RESP_EVENT
 * - 0x00000080: ACI_ATT_READ_BLOB_RESP_EVENT
 * - 0x00000100: ACI_ATT_READ_MULTIPLE_RESP_EVENT
 * - 0x00000200: ACI_ATT_READ_BY_GROUP_TYPE_RESP_EVENT
 * - 0x00000800: ACI_ATT_PREPARE_WRITE_RESP_EVENT
 * - 0x00001000: ACI_ATT_EXEC_WRITE_RESP_EVENT
 * - 0x00002000: ACI_GATT_INDICATION_EVENT
 * - 0x00004000: ACI_GATT_NOTIFICATION_EVENT
 * - 0x00008000: ACI_GATT_ERROR_RESP_EVENT
 * - 0x00010000: ACI_GATT_PROC_COMPLETE_EVENT
 * - 0x00020000: ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_EVENT
 * - 0x00040000: ACI_GATT_TX_POOL_AVAILABLE_EVENT
 */
  uint32_t GATT_Evt_Mask;
} aci_gatt_set_event_mask_cp0;

typedef PACKED(struct) aci_gatt_set_event_mask_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_set_event_mask_rp0;

typedef PACKED(struct) aci_gatt_clt_exchange_config_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} aci_gatt_clt_exchange_config_cp0;

typedef PACKED(struct) aci_gatt_clt_exchange_config_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_exchange_config_rp0;

typedef PACKED(struct) aci_gatt_clt_prepare_write_req_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * The offset of the first octet to be written
 * Values:
 * - 0 ... 511
 */
  uint16_t Val_Offset;
/**
 * Length of attribute value (maximum value is ATT_MTU - 5).
 */
  uint16_t Attribute_Val_Length;
/**
 * The value of the attribute to be written
 */
  uint8_t Attribute_Val[(HCI_MAX_PAYLOAD_SIZE - 10)/sizeof(uint8_t)];
} aci_gatt_clt_prepare_write_req_cp0;

typedef PACKED(struct) aci_gatt_clt_prepare_write_req_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_prepare_write_req_rp0;

typedef PACKED(struct) aci_gatt_clt_execute_write_req_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Execute or cancel writes.
 * Values:
 * - 0x00: Cancel all prepared writes
 * - 0x01: Immediately write all pending prepared values
 */
  uint8_t Execute;
} aci_gatt_clt_execute_write_req_cp0;

typedef PACKED(struct) aci_gatt_clt_execute_write_req_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_execute_write_req_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_primary_services_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
} aci_gatt_clt_disc_all_primary_services_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_primary_services_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_disc_all_primary_services_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_primary_service_by_uuid_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * UUID type.
 * Values:
 * - 0x01: 16-bit UUID
 * - 0x02: 128-bit UUID
 */
  uint8_t UUID_Type;
/**
 * See @ref UUID_t
 */
  packed_UUID_t UUID;
} aci_gatt_clt_disc_primary_service_by_uuid_cp0;

