sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gatt_clt_disc_primary_service_by_uuid_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_disc_primary_service_by_uuid_rp0;

typedef PACKED(struct) aci_gatt_clt_find_included_services_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Start attribute handle of the service
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Start_Handle;
/**
 * End attribute handle of the service
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t End_Handle;
} aci_gatt_clt_find_included_services_cp0;

typedef PACKED(struct) aci_gatt_clt_find_included_services_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_find_included_services_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_of_service_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Start attribute handle of the service
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Start_Handle;
/**
 * End attribute handle of the service
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t End_Handle;
} aci_gatt_clt_disc_all_char_of_service_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_of_service_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_disc_all_char_of_service_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_char_by_uuid_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Start attribute handle of the service
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Start_Handle;
/**
 * End attribute handle of the service
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t End_Handle;
/**
 * UUID type.
 * Values:
 * - 0x01: 16-bit UUID
 * - 0x02: 128-bit UUID
 */
  uint8_t UUID_Type;
/**
 * See @ref UUID_t
 */
  packed_UUID_t UUID;
} aci_gatt_clt_disc_char_by_uuid_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_char_by_uuid_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_disc_char_by_uuid_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_desc_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the characteristic value
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Char_Handle;
/**
 * End handle of the characteristic
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t End_Handle;
} aci_gatt_clt_disc_all_char_desc_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_desc_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_disc_all_char_desc_rp0;

typedef PACKED(struct) aci_gatt_clt_read_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be read
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
} aci_gatt_clt_read_cp0;

typedef PACKED(struct) aci_gatt_clt_read_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_read_rp0;

typedef PACKED(struct) aci_gatt_clt_read_using_char_uuid_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Starting handle of the range to be searched
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Start_Handle;
/**
 * End handle of the range to be searched
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t End_Handle;
/**
 * UUID type.
 * Values:
 * - 0x01: 16-bit UUID
 * - 0x02: 128-bit UUID
 */
  uint8_t UUID_Type;
/**
 * See @ref UUID_t
 */
  packed_UUID_t UUID;
} aci_gatt_clt_read_using_char_uuid_cp0;

typedef PACKED(struct) aci_gatt_clt_read_using_char_uuid_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_read_using_char_uuid_rp0;

typedef PACKED(struct) aci_gatt_clt_read_long_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be read
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Offset from which the value needs to be read
 * Values:
 * - 0 ... 511
 */
  uint16_t Val_Offset;
} aci_gatt_clt_read_long_cp0;

typedef PACKED(struct) aci_gatt_clt_read_long_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_read_long_rp0;

