sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gatt_clt_read_multiple_char_value_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * The number of handles for which the value has to be read. From 2 to
 * (ATT_MTU-1)/2
 * Values:
 * - 0x02 ... 0xFF
 */
  uint8_t Number_of_Handles;
/**
 * The handles for which the attribute value has to be read
 */
  uint16_t Handle[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(uint16_t)];
} aci_gatt_clt_read_multiple_char_value_cp0;

typedef PACKED(struct) aci_gatt_clt_read_multiple_char_value_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_read_multiple_char_value_rp0;

typedef PACKED(struct) aci_gatt_clt_write_nwk_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Length of the value to be written
 */
  uint16_t Attribute_Val_Length;
/**
 * Value to be written
 */
  uint8_t Attribute_Val[(HCI_MAX_PAYLOAD_SIZE - 8)/sizeof(uint8_t)];
} aci_gatt_clt_write_nwk_cp0;

typedef PACKED(struct) aci_gatt_clt_write_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_write_nwk_rp0;

typedef PACKED(struct) aci_gatt_clt_write_long_nwk_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Offset at which the attribute has to be written
 * Values:
 * - 0 ... 511
 */
  uint16_t Val_Offset;
/**
 * Length of the value to be written
 */
  uint16_t Attribute_Val_Length;
/**
 * Value to be written
 */
  uint8_t Attribute_Val[(HCI_MAX_PAYLOAD_SIZE - 10)/sizeof(uint8_t)];
} aci_gatt_clt_write_long_nwk_cp0;

typedef PACKED(struct) aci_gatt_clt_write_long_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_write_long_nwk_rp0;

typedef PACKED(struct) aci_gatt_clt_write_char_reliable_nwk_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Offset at which the attribute has to be written
 * Values:
 * - 0 ... 511
 */
  uint16_t Val_Offset;
/**
 * Length of the value to be written
 */
  uint16_t Attribute_Val_Length;
/**
 * Value to be written
 */
  uint8_t Attribute_Val[(HCI_MAX_PAYLOAD_SIZE - 10)/sizeof(uint8_t)];
} aci_gatt_clt_write_char_reliable_nwk_cp0;

typedef PACKED(struct) aci_gatt_clt_write_char_reliable_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_write_char_reliable_nwk_rp0;

typedef PACKED(struct) aci_gatt_clt_write_without_resp_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Length of the value to be written (maximum value is ATT_MTU - 3)
 */
  uint16_t Attribute_Val_Length;
/**
 * Value to be written
 */
  uint8_t Attribute_Val[(HCI_MAX_PAYLOAD_SIZE - 8)/sizeof(uint8_t)];
} aci_gatt_clt_write_without_resp_cp0;

typedef PACKED(struct) aci_gatt_clt_write_without_resp_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_write_without_resp_rp0;

typedef PACKED(struct) aci_gatt_clt_signed_write_without_resp_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Length of the value to be written (up to ATT_MTU - 13)
 */
  uint16_t Attribute_Val_Length;
/**
 * Value to be written
 */
  uint8_t Attribute_Val[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_gatt_clt_signed_write_without_resp_cp0;

typedef PACKED(struct) aci_gatt_clt_signed_write_without_resp_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_signed_write_without_resp_rp0;

typedef PACKED(struct) aci_gatt_clt_confirm_indication_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
} aci_gatt_clt_confirm_indication_cp0;

typedef PACKED(struct) aci_gatt_clt_confirm_indication_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_confirm_indication_rp0;

typedef PACKED(struct) aci_gatt_srv_set_security_permission_nwk_cp0_s {
/**
 * Handle of the attribute whose security permission has to be modified
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Security permission flags.
 * Flags:
 * - 0x00
 * - 0x01: AUTHEN_READ (Need authentication to read)
 * - 0x04: ENCRY_READ (Need encryption to read)
 * - 0x08: AUTHEN_WRITE (need authentication to write)
 * - 0x20: ENCRY_WRITE (need encryption to write)
 */
  uint8_t Security_Permissions;
} aci_gatt_srv_set_security_permission_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_set_security_permission_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_set_security_permission_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_read_handle_value_nwk_cp0_s {
/**
 * Handle of the attribute to read
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Offset from which the value needs to be read
 * Values:
 * - 0 ... 511
 */
  uint16_t Offset;
/**
 * Maximum number of octets to be returned as attribute value
 * Values:
 * - 0 ... 512
 */
  uint16_t Value_Length_Requested;
} aci_gatt_srv_read_handle_value_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_read_handle_value_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Length of the attribute value
 */
  uint16_t Length;
/**
 * Length in octets of the Value parameter
 */
  uint16_t Value_Length;
/**
 * Attribute value
 */
  uint8_t Value[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(uint8_t)];
} aci_gatt_srv_read_handle_value_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_set_access_permission_nwk_cp0_s {
/**
 * Handle of the attribute whose security permission has to be modified
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Access permission
 * Flags:
 * - 0x00
 * - 0x01: READ
 * - 0x02: WRITE
 * - 0x04: WRITE_NO_RESP
 * - 0x08: SIGNED_WRITE
 */
  uint8_t Access_Permissions;
} aci_gatt_srv_set_access_permission_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_set_access_permission_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_set_access_permission_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_notify_cp0_s {
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute to be notified
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Select the notification type.
 * Values:
 * - 0x00: GATT_NOTIFICATION
 * - 0x02: GATT_INDICATION
 */
  uint8_t Flags;
/**
 * Length of the Val field.
 */
  uint16_t Val_Length;
/**
 *
 */
  uint8_t Val[(HCI_MAX_PAYLOAD_SIZE - 9)/sizeof(uint8_t)];
} aci_gatt_srv_notify_cp0;

typedef PACKED(struct) aci_gatt_srv_notify_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_notify_rp0;

typedef PACKED(struct) aci_gatt_srv_exec_write_resp_nwk_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Conn_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * If 1, allow execution of queued writes. If 0 flush all queued writes for the
 * given connection handle.
 * Values:
 * - 0x00: FLUSH
 * - 0x01: EXECUTE
 */
  uint8_t Exec;
} aci_gatt_srv_exec_write_resp_nwk_cp0;

