sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gatt_srv_exec_write_resp_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_exec_write_resp_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_authorize_resp_nwk_cp0_s {
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Conn_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Offset from which the value needs to be read or write
 * Values:
 * - 0 ... 511
 */
  uint16_t Attr_Handle;
/**
 *
 * Values:
 * - 0x00: Read
 * - 0x10: Write Request
 * - 0x11: Write Command or Signed Write Command
 * - 0x12: Prepare Write Request
 */
  uint8_t Operation_Type;
/**
 * Set to 0 if operation is authorized, otherwise Error_Code is the ATT error
 * code that will be sent to the peer in reaponse to the request.
 * Values:
 * - 0: Authorize
 * - 0 ... 255
 */
  uint8_t Error_Code;
/**
 * Offset from which the attribute needs to be read or written. For a read
 * operation it is always 0.
 * Values:
 * - 0 ... 511
 */
  uint16_t Attr_Val_Offset;
/**
 * Length of Data field
 */
  uint16_t Data_Length;
/**
 * The data that the client has requested to write.
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 12)/sizeof(uint8_t)];
} aci_gatt_srv_authorize_resp_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_authorize_resp_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_authorize_resp_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_read_prepare_queue_nwk_cp0_s {
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Conn_Handle;
/**
 * The index of the entry in the queue for the selected connection handle.
 */
  uint8_t Item_Index;
} aci_gatt_srv_read_prepare_queue_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_read_prepare_queue_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * The attribute handle of the returned entry.
 */
  uint16_t Attr_Handle;
/**
 * The offset from which the peer is requesting to start writing.
 */
  uint16_t Value_Offset;
/**
 * Length in octets of the Value parameter
 */
  uint16_t Value_Length;
/**
 * The value to be written.
 */
  uint8_t Value[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} aci_gatt_srv_read_prepare_queue_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_write_multiple_instance_handle_value_cp0_s {
/**
 * Connection handle for which the attribute value will be written.
 */
  uint16_t Connection_Handle;
/**
 * Handle of the attribute
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Length of the attribute value in octets.
 */
  uint16_t Value_Length;
/**
 * Attribute value.
 */
  uint8_t Value[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_gatt_srv_write_multiple_instance_handle_value_cp0;

typedef PACKED(struct) aci_gatt_srv_write_multiple_instance_handle_value_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_write_multiple_instance_handle_value_rp0;

typedef PACKED(struct) aci_gatt_srv_read_multiple_instance_handle_value_nwk_cp0_s {
/**
 * Connection handle for which the attribute value will be read.
 */
  uint16_t Connection_Handle;
/**
 * Handle of the attribute
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
} aci_gatt_srv_read_multiple_instance_handle_value_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_read_multiple_instance_handle_value_nwk_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Length of the attribute value in octets.
 */
  uint16_t Value_Length;
/**
 * Attribute value.
 */
  uint8_t Value[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint8_t)];
} aci_gatt_srv_read_multiple_instance_handle_value_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_multi_notify_cp0_s {
/**
 * Connection handle for which the attribute value will be read.
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * Reserved for future use. Its value must be set to 0.
 * Values:
 * - 0x00
 */
  uint8_t Flags;
/**
 *
 */
  uint8_t Num_Of_Attr;
/**
 * See @ref Gatt_Srv_Notify_Attr_t
 */
  packed_Gatt_Srv_Notify_Attr_t Gatt_Srv_Notify_Attr[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(packed_Gatt_Srv_Notify_Attr_t)];
} aci_gatt_srv_multi_notify_cp0;

typedef PACKED(struct) aci_gatt_srv_multi_notify_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_srv_multi_notify_rp0;

typedef PACKED(struct) aci_gatt_clt_read_multiple_var_len_char_value_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Channel Identifier of the ATT bearer. It must be set to 0x0004 for unenhanced
 * ATT bearer.
 */
  uint16_t CID;
/**
 * The number of handles for which the value has to be read. From 2 to
 * (ATT_MTU-1)/2
 * Values:
 * - 0x02 ... 0xFF
 */
  uint8_t Number_of_Handles;
/**
 * The handles for which the attribute value has to be read
 */
  uint16_t Handle[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(uint16_t)];
} aci_gatt_clt_read_multiple_var_len_char_value_cp0;

typedef PACKED(struct) aci_gatt_clt_read_multiple_var_len_char_value_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_gatt_clt_read_multiple_var_len_char_value_rp0;

