sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_gatt_clt_add_subscription_security_level_nwk_cp0_s {
  uint16_t Conn_Handle;
  uint16_t Char_Value_Handle;
  uint8_t Sec_Level;
} aci_gatt_clt_add_subscription_security_level_nwk_cp0;

typedef PACKED(struct) aci_gatt_clt_add_subscription_security_level_nwk_rp0_s {
  uint8_t Status;
} aci_gatt_clt_add_subscription_security_level_nwk_rp0;
typedef PACKED(struct) aci_l2cap_connection_parameter_update_req_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Minimum value for the connection event interval. This shall be less than or
 * equal to Connection_Interval_Max. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Min;
/**
 * Maximum value for the connection event interval. This shall be greater than
 * or equal to Connection_Interval_Min. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Max;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Peripheral_Latency;
/**
 * Defines connection timeout parameter in the following manner: Timeout
 * Multiplier * 10ms.
 * Values:
 * - 10 (100 ms)  ... 3200 (32000 ms) 
 */
  uint16_t Timeout_Multiplier;
} aci_l2cap_connection_parameter_update_req_cp0;

typedef PACKED(struct) aci_l2cap_connection_parameter_update_req_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_l2cap_connection_parameter_update_req_rp0;

typedef PACKED(struct) aci_l2cap_connection_parameter_update_resp_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Minimum value for the connection event interval. This shall be less than or
 * equal to Connection_Interval_Max. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Min;
/**
 * Maximum value for the connection event interval. This shall be greater than
 * or equal to Connection_Interval_Min. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Max;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Peripheral_Latency;
/**
 * Defines connection timeout parameter in the following manner: Timeout
 * Multiplier * 10ms.
 * Values:
 * - 10 (100 ms)  ... 3200 (32000 ms) 
 */
  uint16_t Timeout_Multiplier;
/**
 * The minimum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Min_CE_Length;
/**
 * The maximum length of connection event recommended for this LE connection.
 * Time = N * 0.625 msec.
 */
  uint16_t Max_CE_Length;
/**
 * Identifier received in ACI_L2CAP_Connection_Update_Req event.
 */
  uint8_t Identifier;
/**
 * Specify if connection update parameters are acceptable or not.
 * Values:
 * - 0x00: Reject
 * - 0x01: Accept
 */
  uint8_t Accept;
} aci_l2cap_connection_parameter_update_resp_cp0;

typedef PACKED(struct) aci_l2cap_connection_parameter_update_resp_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_l2cap_connection_parameter_update_resp_rp0;

typedef PACKED(struct) aci_l2cap_cos_connection_req_cp0_s {
/**
 * Handle identifying the connection.
 */
  uint16_t Connection_Handle;
/**
 * Simplified Protocol/Service Multiplexer
 * Values:
 * - 0x0001 ... 0x00FF
 */
  uint16_t SPSM;
/**
 * The maximum SDU size (in octets) that the L2CAP layer entity sending the
 * L2CAP_LE_CREDIT_BASED_CONNECTION_REQ can receive on this channel.
 * Values:
 * - 23 ... 65535
 */
  uint16_t MTU;
/**
 * The maximum PDU payload size (in octets) that the L2CAP layer entity sending
 * the L2CAP_LE_CREDIT_BASED_CONNECTION_REQ is capable of receiving on this
 * channel.
 * Values:
 * - 23 ... 65533
 */
  uint16_t MPS;
/**
 * Type of channel: LE Credit Based Flow Control Mode or Enhanced Credit Based
 * Flow Control Mode.
 * Values:
 * - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 * - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 */
  uint8_t Channel_Type;
/**
 *
 */
  uint8_t CID_Count;
} aci_l2cap_cos_connection_req_cp0;

typedef PACKED(struct) aci_l2cap_cos_connection_req_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_l2cap_cos_connection_req_rp0;

typedef PACKED(struct) aci_l2cap_cos_connection_resp_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Identifier of the request.
 */
  uint8_t Identifier;
/**
 * The MTU field specifies the maximum SDU size (in octets) that the L2CAP layer
 * entity sending the L2CAP_LE_CREDIT_BASED_CONNECTION_RSP can receive on this
 * channel.
 * Values:
 * - 23 ... 65535
 */
  uint16_t MTU;
/**
 * The MPS field specifies the maximum PDU payload size (in octets) that the
 * L2CAP layer entity sending the L2CAP_LE_CREDIT_BASED_CONNECTION_RSP is
 * capable of receiving on this channel.
 * Values:
 * - 23 ... 65533
 */
  uint16_t MPS;
/**
 * It indicates the outcome of the connection request. A result value of 0x0000
 * indicates success while a non-zero value indicates a fail. Code values
 * starting from 0x000C can be used only for ECFC channel type.
 * Values:
 * - 0x0000: L2CAP_CONN_SUCCESSFUL
 * - 0x0002: L2CAP_CONN_FAIL_SPSM_NOT_SUPPORTED
 * - 0x0004: L2CAP_CONN_FAIL_INSUFFICIENT_RESOURCES
 * - 0x0005: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHENTICATION
 * - 0x0006: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHORIZATION
 * - 0x0007: L2CAP_CONN_FAIL_KEY_SIZE_TOO_SHORT
 * - 0x0008: L2CAP_CONN_FAIL_INSUFFICIENT_ENCRYPTION
 * - 0x000B: L2CAP_CONN_FAIL_UNACCEPTABLE_PARAMETERS
 * - 0x000C: L2CAP_CONN_FAIL_INVALID_PARAMETERS
 * - 0x000D: L2CAP_CONN_FAIL_NO_INFO
 * - 0x000E: L2CAP_CONN_FAIL_AUTHENTICATION_PENDING
 * - 0x000F: L2CAP_CONN_FAIL_AUTHORIZATION_PENDING
 */
  uint16_t Result;
/**
 *
 */
  uint8_t CID_Count;
} aci_l2cap_cos_connection_resp_cp0;

typedef PACKED(struct) aci_l2cap_cos_connection_resp_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 */
  uint8_t CID_Count;
/**
 *
 */
  uint16_t CID[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(uint16_t)];
} aci_l2cap_cos_connection_resp_rp0;

typedef PACKED(struct) aci_l2cap_cos_flow_control_credits_ind_cp0_s {
  uint16_t Connection_Handle;
  uint16_t CID;
  uint16_t RX_Credits;
  uint8_t CFC_Policy;
} aci_l2cap_cos_flow_control_credits_ind_cp0;

typedef PACKED(struct) aci_l2cap_cos_flow_control_credits_ind_rp0_s {
  uint8_t Status;
  uint16_t RX_Credit_Balance;
} aci_l2cap_cos_flow_control_credits_ind_rp0;
typedef PACKED(struct) aci_l2cap_cos_disconnect_req_cp0_s {
/**
 *
 */
  uint16_t Connection_Handle;
/**
 * Local endpoint of the channel to be disconnected.
 */
  uint16_t CID;
} aci_l2cap_cos_disconnect_req_cp0;

typedef PACKED(struct) aci_l2cap_cos_disconnect_req_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_l2cap_cos_disconnect_req_rp0;

