sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
typedef PACKED(struct) aci_l2cap_cos_sdu_data_transmit_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The local channel endpoint that identifies the L2CAP channel.
 */
  uint16_t CID;
/**
 * Length of the SDU to be transmitted.
 */
  uint16_t SDU_Length;
/**
 * Data contained in the SDU to be transmitted. Data must be valid until the SDU
 * is transmitted.
 */
  uint8_t SDU_Data[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_l2cap_cos_sdu_data_transmit_cp0;

typedef PACKED(struct) aci_l2cap_cos_sdu_data_transmit_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_l2cap_cos_sdu_data_transmit_rp0;

typedef PACKED(struct) aci_l2cap_cos_reconfigure_req_cp0_s {
/**
 * Identifier received in the aci_eatt_connection_event.
 */
  uint16_t Connection_Handle;
/**
 * The maximum SDU size (in octets) that the L2CAP layer entity can receive on
 * each of the Source CID channels (represented by Local_CID array parameter).
 * This is equal to the maximum size of an ATT packet on the Enhanced ATT
 * bearer.
 * Values:
 * - 0x0040 ... 0xFFFF
 */
  uint16_t MTU;
/**
 * The maximum PDU payload size (in octets) that the local L2CAP layer is
 * capable of receiving on each of the Source CID channels (represented by
 * Local_CID array parameter).
 * Values:
 * - 0x0040 ... 0xFFFF
 */
  uint16_t MPS;
/**
 * The number of potential Enhanced ATT bearers that are going to be opened.
 * This is the number of L2CAP channels to be opened in Enhanced Credit Based
 * Flow Control mode.
 * Values:
 * - 0x01 ... 0x05
 */
  uint8_t CID_Count;
/**
 * List of CID values representing the channel endpoints on the local device.
 * Each entry in the array shall be non-zero and represents a request for a
 * channel. The value of each CID shall be from the dynamically allocated range
 * for LE devices (0x0040-0x007F) and shall not be already allocated to a
 * different channel on the device sending the request.
 */
  uint16_t CID[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint16_t)];
} aci_l2cap_cos_reconfigure_req_cp0;

typedef PACKED(struct) aci_l2cap_cos_reconfigure_req_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_l2cap_cos_reconfigure_req_rp0;

typedef PACKED(struct) aci_l2cap_cos_reconfigure_resp_cp0_s {
/**
 * Identifier received in the aci_eatt_connection_event.
 */
  uint16_t Connection_Handle;
/**
 * Identifier received in the aci_eatt_connection_event.
 */
  uint8_t Identifier;
/**
 * It indicates the outcome of the connection request. A result value of 0x0000
 * indicates success while a non-zero value indicates the connection request was
 * refused.
 * Values:
 * - 0x0000: L2CAP_RECONFIG_SUCCESSFUL
 * - 0x0001: L2CAP_MTU_REDUCTION_NOT_ALLOWED
 * - 0x0002: L2CAP_MPS_REDUCTION_NOT_ALLOWED
 * - 0x0003: L2CAP_INVALID_DESTINATION_CID
 * - 0x0004: L2CAP_UNACCEPTABLE_PARAMETERS
 */
  uint16_t Result;
} aci_l2cap_cos_reconfigure_resp_cp0;

typedef PACKED(struct) aci_l2cap_cos_reconfigure_resp_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_l2cap_cos_reconfigure_resp_rp0;

typedef PACKED(struct) aci_test_tx_notification_start_cp0_s {
/**
 * Connection handle to notify.
 */
  uint16_t Connection_Handle;
/**
 * Handle of service to which the characteristic belongs
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Service_Handle;
/**
 * Handle of the characteristic
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Char_Handle;
/**
 * Length of the characteristic to be notified. Only ATT_MTU - 3 bytes are sent
 * with notifications.
 */
  uint16_t Value_Length;
} aci_test_tx_notification_start_cp0;

typedef PACKED(struct) aci_test_tx_notification_start_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_test_tx_notification_start_rp0;

typedef PACKED(struct) aci_test_tx_write_command_start_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 * Length of the characteristic to be written with write commands. Only ATT_MTU
 * - 3 bytes are written.
 */
  uint16_t Value_Length;
} aci_test_tx_write_command_start_cp0;

typedef PACKED(struct) aci_test_tx_write_command_start_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_test_tx_write_command_start_rp0;

typedef PACKED(struct) aci_test_rx_start_cp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Handle of the attribute to be written
 * Values:
 * - 0x0001 ... 0xFFFF
 */
  uint16_t Attr_Handle;
/**
 *
 * Values:
 * - 0x00: Notifications
 * - 0x01: Write Commands
 */
  uint8_t Notifications_WriteCmds;
} aci_test_rx_start_cp0;

typedef PACKED(struct) aci_test_rx_start_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_test_rx_start_rp0;

typedef PACKED(struct) aci_test_stop_cp0_s {
/**
 *
 * Values:
 * - 0x00: TX
 * - 0x01: RX
 */
  uint8_t TX_RX;
} aci_test_stop_cp0;

typedef PACKED(struct) aci_test_stop_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
} aci_test_stop_rp0;

typedef PACKED(struct) aci_test_report_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 *
 */
  uint32_t TX_Packets;
/**
 *
 */
  uint32_t RX_Packets;
/**
 *
 */
  uint16_t RX_Data_Length;
/**
 *
 */
  uint32_t RX_Sequence_Errors;
} aci_test_report_rp0;

/**
 * The Disconnection Complete event occurs when a connection is terminated. The
 * status parameter indicates if the disconnection was successful or not. The
 * reason parameter indicates the reason for the disconnection if the
 * disconnection was successful. If the disconnection was not successful, the
 * value of the reason parameter can be ignored by the Host. For example, this
 * can be the case if the Host has issued the Disconnect command and there was a
 * parameter error, or the command was not presently allowed, or a
 * Connection_Handle that didn't correspond to a connection was given.
 */
typedef PACKED(struct) hci_disconnection_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection_Handle which was disconnected.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Reason for disconnection. See Error Codes.
 */
  uint8_t Reason;
} hci_disconnection_complete_event_rp0;

/**
 * The Encryption Change event is used to indicate that the change of the
 * encryption mode has been completed. The Connection_Handle will be a
 * Connection_Handle for an ACL connection. The Encryption_Enabled event
 * parameter specifies the new Encryption_Enabled parameter for the
 * Connection_Handle specified by the Connection_Handle event parameter. This
 * event will occur on both devices to notify the Hosts when Encryption has
 * changed for the specified Connection_Handle between two devices. Note: This
 * event shall not be generated if encryption is paused or resumed; during a
 * role switch, for example. The meaning of the Encryption_Enabled parameter
 * depends on whether the Host has indicated support for Secure Connections in
 * the Secure_Connections_Host_Support parameter. When
 * Secure_Connections_Host_Support is 'disabled' or the Connection_Handle refers
 * to an LE link, the Controller shall only use Encryption_Enabled values 0x00
 * (OFF) and 0x01 (ON). (See Bluetooth Specification v.4.1, Vol. 2, Part E,
 * 7.7.8)
 */
typedef PACKED(struct) hci_encryption_change_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Link Level Encryption.
 * Values:
 * - 0x00: Link Level Encryption OFF
 * - 0x01: Link Level Encryption is ON with AES-CCM
 */
  uint8_t Encryption_Enabled;
} hci_encryption_change_event_rp0;

/**
 * The Read Remote Version Information Complete event is used to indicate the
 * completion of the process obtaining the version information of the remote
 * Controller specified by the Connection_Handle event parameter. The
 * Connection_Handle shall be for an ACL connection. The Version event parameter
 * defines the specification version of the LE Controller. The Manufacturer_Name
 * event parameter indicates the manufacturer of the remote Controller. The
 * Subversion event parameter is controlled by the manufacturer and is
 * implementation dependent. The Subversion event parameter defines the various
 * revisions that each version of the Bluetooth hardware will go through as
 * design processes change and errors are fixed. This allows the software to
 * determine what Bluetooth hardware is being used and, if necessary, to work
 * around various bugs in the hardware. When the Connection_Handle is associated
 * with an LE-U logical link, the Version event parameter shall be Link Layer
 * VersNr parameter, the Manufacturer_Name event parameter shall be the CompId
 * parameter, and the Subversion event parameter shall be the SubVersNr
 * parameter. (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.7.12)
 */
typedef PACKED(struct) hci_read_remote_version_information_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Version of the Current LMP in the remote Controller
 */
  uint8_t Version;
/**
 * Manufacturer Name of the remote Controller
 */
  uint16_t Manufacturer_Name;
/**
 * Subversion of the LMP in the remote Controller
 */
  uint16_t Subversion;
} hci_read_remote_version_information_complete_event_rp0;

/**
 * The Hardware Error event is used to indicate some implementation specific
 * type of hardware failure for the controller. This event is used to notify the
 * Host that a hardware failure has occurred in the Controller.
 */
typedef PACKED(struct) hci_hardware_error_event_rp0_s {
/**
 * Error code 0x01 and 0x02 are errors generally caused by hardware issue on the
 * PCB; another possible cause is a slow crystal startup. In the latter case,
 * the HS_STARTUP_TIME in the device configuration needs to be tuned. Error code
 * 0x03 indicates an internal error of the protocol stack. This event with error
 * code 0x04 is raised when a radio interrupt is served late. This usually
 * happens when interrupts are disabled for too long time or when a Flash
 * operation is performed (which can be also triggered by the Stack to store
 * bonding information). Stack will try to recover the situation, so there is
 * normally no need to reset the device. However this condition should be
 * avoided as much as possible. Error code 0x05 is raised when an error happens
 * during a TX transaction. After this event is received with error code 0x00,
 * 0x01, 0x02 or 0x03, it is recommended to force a device reset.
 * Values:
 * - 0x00: Generic HW error
 * - 0x01: Radio state error
 * - 0x02: Timer overrun error
 * - 0x03: Internal queue overflow error
 * - 0x04: Late Radio ISR
 * - 0x05: TX Error
 */
  uint8_t Hardware_Code;
} hci_hardware_error_event_rp0;

/**
 * The Number Of Completed Packets event is used by the Controller to indicate
 * to the Host how many HCI Data Packets have been completed (transmitted or
 * flushed) for each Connection_Handle since the previous Number Of Completed
 * Packets event was sent to the Host. This means that the corresponding buffer
 * space has been freed in the Controller. Based on this information, and the
 * HC_Total_Num_ACL_Data_Packets and HC_Total_Num_Synchronous_- Data_Packets
 * return parameter of the Read_Buffer_Size command, the Host can determine for
 * which Connection_Handles the following HCI Data Packets should be sent to the
 * Controller. The Number Of Completed Packets event must not be sent before the
 * corresponding Connection Complete event. While the Controller has HCI data
 * packets in its buffer, it must keep sending the Number Of Completed Packets
 * event to the Host at least periodically, until it finally reports that all
 * the pending ACL Data Packets have been transmitted or flushed.
 */
typedef PACKED(struct) hci_number_of_completed_packets_event_rp0_s {
/**
 * The number of Connection_Handles and Num_HCI_Data_Packets parameters pairs
 * contained in this event
 */
  uint8_t Number_of_Handles;
/**
 * See @ref Handle_Packets_Pair_Entry_t
 */
  packed_Handle_Packets_Pair_Entry_t Handle_Packets_Pair_Entry[(HCI_MAX_PAYLOAD_SIZE - 1)/sizeof(packed_Handle_Packets_Pair_Entry_t)];
} hci_number_of_completed_packets_event_rp0;

/**
 * This event is used to indicate that the Controller's data buffers have been
 * overflowed. This can occur if the Host has sent more packets than allowed.
 * The Link_Type parameter is used to indicate that the overflow was caused by
 * ACL data.
 */
typedef PACKED(struct) hci_data_buffer_overflow_event_rp0_s {
/**
 * On which type of channel overflow has occurred.
 * Values:
 * - 0x01: ACL Buffer Overflow
 */
  uint8_t Link_Type;
} hci_data_buffer_overflow_event_rp0;

/**
 * The Encryption Key Refresh Complete event is used to indicate to the Host
 * that the encryption key was refreshed on the given Connection_Handle any time
 * encryption is paused and then resumed. If the Encryption Key Refresh Complete
 * event was generated due to an encryption pause and resume operation embedded
 * within a change connection link key procedure, the Encryption Key Refresh
 * Complete event shall be sent prior to the Change Connection Link Key Complete
 * event. If the Encryption Key Refresh Complete event was generated due to an
 * encryption pause and resume operation embedded within a role switch
 * procedure, the Encryption Key Refresh Complete event shall be sent prior to
 * the Role Change event.
 */
typedef PACKED(struct) hci_encryption_key_refresh_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_encryption_key_refresh_complete_event_rp0;

/**
 * The HCI_Authenticated_Payload_Timeout_Expired event is used to indicate that
 * a packet containing a valid MIC on the Connection_Handle was not received
 * within the authenticatedPayloadTO. Note: A Host may choose to disconnect the
 * link when this occurs.
 */
typedef PACKED(struct) hci_authenticated_payload_timeout_expired_event_rp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_authenticated_payload_timeout_expired_event_rp0;

/**
 * This event inform the application that the network coprocessor has been
 * reset. If the reason code is a system crash, a following event @ref
 * aci_blue_crash_info_event will provide more information regarding the system
 * crash details.
 */
typedef PACKED(struct) aci_blue_initialized_event_rp0_s {
/**
 * Reason code describing why device was reset and in which mode is operating
 * (Updater or Normal mode)
 * Values:
 * - 0x01: Firmware started properly
 * - 0x02: Updater mode entered with ACI command
 * - 0x03: Updater mode entered due to bad Blue Flag
 * - 0x04: Updater mode entered due to boot pin
 * - 0x05: System reset due to watchdog
 * - 0x06: System reset due to lockup
 * - 0x07: System reset due to brownout reset
 * - 0x08: System reset due to crash
 * - 0x09: System reset due to ECC error
 */
  uint8_t Reason_Code;
} aci_blue_initialized_event_rp0;

/**
 * This event is given to the application after the @ref
 * aci_blue_initialized_event when a system crash is detected. This events
 * returns system crash information for debugging purposes.  Information
 * reported are useful to understand the root cause of the crash.
 */
typedef PACKED(struct) aci_blue_crash_info_event_rp0_s {
/**
 * Crash type
 * Values:
 * - 0x00: Assert failed
 * - 0x01: NMI fault
 * - 0x02: Hard fault
 */
  uint8_t Crash_Type;
/**
 * Stack pointer
 */
  uint32_t SP;
/**
 * Register R0
 */
  uint32_t R0;
/**
 * Register R1
 */
  uint32_t R1;
/**
 * Register R2
 */
  uint32_t R2;
/**
 * Register R3
 */
  uint32_t R3;
/**
 * Register R12
 */
  uint32_t R12;
/**
 * Link register
 */
  uint32_t LR;
/**
 * Program counter where crash occurred
 */
  uint32_t PC;
/**
 * xPSR register
 */
  uint32_t xPSR;
/**
 * Length of Debug_Data field
 */
  uint8_t Debug_Data_Length;
/**
 * Debug data
 */
  uint8_t Debug_Data[(HCI_MAX_PAYLOAD_SIZE - 38)/sizeof(uint8_t)];
} aci_blue_crash_info_event_rp0;

/**
 * This event is generated when the device completes a radio activity and
 * provide information when a new radio activity will be performed. Information
 * provided includes type of radio activity and absolute time in system ticks
 * when a new radio activity is schedule, if any. Application can use this
 * information to schedule user activities synchronous to selected radio
 * activities. A command @ref aci_hal_set_radio_activity_mask is provided to
 * enable radio activity events of user interests, by default no events are
 * enabled. User should take into account that enabling radio events in
 * application with intense radio activity could lead to a fairly high rate of
 * events generated. Application use cases includes synchronizing notification
 * with connection interval, switching  antenna at the end of advertising or
 * performing flash erase operation while radio is idle.
 */
typedef PACKED(struct) aci_hal_end_of_radio_activity_event_rp0_s {
/**
 * Completed radio events
 * Values:
 * - 0x00: Idle
 * - 0x01: Advertising
 * - 0x02: Connection event peripheral
 * - 0x03: Scanning
 * - 0x04: Connection request
 * - 0x05: Connection event central
 * - 0x06: TX test mode
 * - 0x07: RX test mode
 */
  uint8_t Last_State;
/**
 * Incoming radio events
 * Values:
 * - 0x00: Idle
 * - 0x01: Advertising
 * - 0x02: Connection event peripheral
 * - 0x03: Scanning
 * - 0x04: Connection request
 * - 0x05: Connection event central
 * - 0x06: TX test mode
 * - 0x07: RX test mode
 */
  uint8_t Next_State;
/**
 * 32bit absolute current time expressed in internal time units.
 */
  uint32_t Next_State_SysTime;
} aci_hal_end_of_radio_activity_event_rp0;

/**
 * This event is generated to report firmware error information.
 */
typedef PACKED(struct) aci_hal_fw_error_event_rp0_s {
/**
 * Code identifying the type of error that has occurred in Bluetooth stack.
 * 0x01: L2CAP layer failed recombining a PDU; 0x02: GATT layer received an
 * unexpteced response (protocol violation); 0x03: GATT layer received an
 * unexpteced request (protocol violation); 0x04: No space to store info GATT
 * database info in NVM (database clean-up  needed or bonding entries to be
 * removed); 0x05: No space to store bonding info in NVM  (database clean-up
 * needed or bonding entries to be removed); 0x06: Link Layer scheduler failed
 * to reschedule slots for too many times (a system reset is recommended; 0x07:
 * Out of memory resources for isochronous channels; 0x08: Error in programming
 * timer for CTE reception functionality.
 * Values:
 * - 0x01: HAL_FW_L2CAP_RECOMBINATION_ERROR
 * - 0x02: HAL_FW_GATT_UNEXPECTED_RESPONSE_ERROR
 * - 0x03: HAL_FW_GATT_SEQUENTIAL_PROTOCOL_ERROR
 * - 0x04: HAL_FW_BONDING_DB_FULL_GATTSERVICE_ERROR
 * - 0x05: HAL_FW_BONDING_DB_FULL_PAIRING_ERROR
 * - 0x06: HAL_FW_SCHEDULER_OVERRUN_ERROR
 * - 0x07: HAL_FW_MEMBUF_NOT_AVAILABLE
 * - 0x08: HAL_FW_CTE_TIMER_PROGRAM_ERROR
 */
  uint8_t FW_Error_Type;
/**
 * Length of Data in octets
 */
  uint8_t Data_Length;
/**
 * The error event info. If FW_Error_Type is 0x01, 0x02 or 0x03, this parameter
 * contains the connection handle where the abnormal condition has occurred.
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 2)/sizeof(uint8_t)];
} aci_hal_fw_error_event_rp0;

/**
 * This event is generated when the amount of transmitted test packets specified
 * with aci_hal_transmitter_test_packets() has been reached.
 */
typedef PACKED(struct) aci_hal_le_test_end_event_rp0_s {
/**
 * The number of test packets actually transmitted.
 */
  uint16_t Number_Of_Packets;
} aci_hal_le_test_end_event_rp0;

/**
 * This event is generated when the pairing process has completed successfully
 * or a pairing procedure timeout has occurred or the pairing has failed. This
 * is to notify the application that we have paired with a remote device so that
 * it can take further actions or to notify that a timeout has occurred so that
 * the upper layer can decide to disconnect the link.
 */
typedef PACKED(struct) aci_gap_pairing_complete_event_rp0_s {
/**
 * Connection handle on which the pairing procedure completed
 */
  uint16_t Connection_Handle;
/**
 * Pairing status. If 0x02, see Reason code.
 * Values:
 * - 0x00: Success
 * - 0x01: Timeout
 * - 0x02: Pairing Failed
 * - 0x03: Encryption failed, LTK missing on local device
 * - 0x04: Encryption failed, LTK missing on peer device
 * - 0x05: Encryption not supported by remote device
 */
  uint8_t Status;
/**
 * Pairing reason error code
 * Values:
 * - 0x00
 * - 0x01: SM_PASSKEY_ENTRY_FAILED
 * - 0x02: SM_OOB_NOT_AVAILABLE
 * - 0x03: SM_AUTHENTICATION_REQUIREMENTS
 * - 0x04: SM_CONFIRM_VALUE_FAILED
 * - 0x05: SM_PAIRING_NOT_SUPPORTED
 * - 0x06: SM_ENCRYPTION_KEY_SIZE
 * - 0x07: SM_CMD_NOT_SUPPORTED
 * - 0x08: SM_UNSPECIFIED_REASON
 * - 0x09: SM_REPEATED_ATTEMPTS
 * - 0x0A: SM_INVALID_PARAMETERS
 * - 0x0B: SMP_DHKEY_CHECK_FAILED
 * - 0x0C: SMP_NUMCOMPARISON_FAILED
 * - 0x0D: SM_BR_EDR_PAIRING_IN_PROGRESS
 * - 0x0E: SM_CROSS_TRANSPORT_KEY_NOT_ALLOWED
 * - 0x0F: SM_KEY_REJECTED
 */
  uint8_t Reason;
} aci_gap_pairing_complete_event_rp0;

/**
 * This event is generated by the Security manager to the application when a
 * passkey is required for pairing. When this event is received, the application
 * has to respond with the @ref aci_gap_passkey_resp command.
 */
typedef PACKED(struct) aci_gap_passkey_req_event_rp0_s {
/**
 * Connection handle for which the passkey has been requested.
 */
  uint16_t Connection_Handle;
/**
 * This parameter informs the application if the passkey needs to be displayed
 * or requested for input on the local device.
 * Values:
 * - 0x00: PASSKEY_DISPLAY
 * - 0x01: PASSKEY_INPUT
 */
  uint8_t Display_Input;
} aci_gap_passkey_req_event_rp0;

