sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
/**
 * This event is sent by the GAP to the upper layers when a procedure previously
 * started has been terminated by the upper layer or has completed for any other
 * reason
 */
typedef PACKED(struct) aci_gap_proc_complete_event_rp0_s {
/**
 * Code identifying the procedure.
 * Values:
 * - 0x00: GAP_LIMITED_DISCOVERY_PROC
 * - 0x01: GAP_GENERAL_DISCOVERY_PROC
 * - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
 * - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
 * - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
 * - 0x05: GAP_OBSERVATION_PROC
 * - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
 * - 0x07: GAP_NAME_DISCOVERY_PROC
 */
  uint8_t Procedure_Code;
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Length of Data in octets
 */
  uint8_t Data_Length;
/**
 * Procedure Specific Data: - For Name Discovery Procedure: the name of the peer
 * device if the procedure completed successfully.
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint8_t)];
} aci_gap_proc_complete_event_rp0;

/**
 * This event is sent only by a privacy enabled Peripheral. The event is sent to
 * the upper layers when the peripheral is unsuccessful in resolving the
 * resolvable address of the peer device after connecting to it.
 */
typedef PACKED(struct) aci_gap_addr_not_resolved_event_rp0_s {
/**
 * Connection handle for which the private address could not be resolved with
 * any of the stored IRK's.
 */
  uint16_t Connection_Handle;
} aci_gap_addr_not_resolved_event_rp0;

/**
 * This event is sent only during SC v.4.2 Pairing, when Numeric Comparison
 * Association model is selected, in order to show the Numeric Value generated,
 * and to ask for Confirmation to the User. When this event is received, the
 * application has to respond with the  @ref
 * aci_gap_numeric_comparison_value_confirm_yesno command
 */
typedef PACKED(struct) aci_gap_numeric_comparison_value_event_rp0_s {
/**
 * Connection handle related to the underlying Pairing
 */
  uint16_t Connection_Handle;
/**
 *
 */
  uint32_t Numeric_Value;
} aci_gap_numeric_comparison_value_event_rp0;

/**
 * This event is sent only during SC v.4.2 Pairing, when Keypress Notifications
 * are supported, in order to show the input type signalled by the peer device,
 * having Keyboard only I/O capabilities. When this event is received, no action
 * is required to the User.
 */
typedef PACKED(struct) aci_gap_keypress_notification_event_rp0_s {
/**
 * Connection handle related to the underlying Pairing
 */
  uint16_t Connection_Handle;
/**
 * Type of Keypress input notified/signaled by peer device
 * Values:
 * - 0x00: PASSKEY_ENTRY_STARTED
 * - 0x01: PASSKEY_DIGIT_ENTERED
 * - 0x02: PASSKEY_DIGIT_ERASED
 * - 0x03: PASSKEY_CLEARED
 * - 0x04: PASSKEY_ENTRY_COMPLETED
 */
  uint8_t Notification_Type;
} aci_gap_keypress_notification_event_rp0;

/**
 * This event may be generated when there is a request to start a pairing
 * process.  Application shall respond with aci_gap_pairing_resp command to
 * accept or reject the incoming pairing procedure notified through this event.
 * If the pairing is going to start with a non-bonded device, the Bonded
 * parameter is set to 0. Instead, if the pairing process is going to start with
 * an already bonded device, the event is raised with Bonded parameter set to 1.
 * This may happen either if the peer has lost the bond or if it is a malicious
 * device.   If aci_gap_set_security_requirements command was given with
 * Pairing_Response set to 1 (pairing confirmation only for bonded devices), the
 * event is raised only if pairing is going to be initiated with a bonded
 * device.
 */
typedef PACKED(struct) aci_gap_pairing_event_rp0_s {
/**
 *
 */
  uint16_t Connection_Handle;
/**
 * Indicates if the peer device is already bonded or not.
 * Values:
 * - 0x00: DEVICE_NOT_BONDED
 * - 0x01: DEVICE_BONDED
 */
  uint8_t Bonded;
} aci_gap_pairing_event_rp0;

/**
 * This event is generated when the central responds to the connection update
 * request packet with a connection update response packet.
 */
typedef PACKED(struct) aci_l2cap_connection_update_resp_event_rp0_s {
/**
 * Connection handle referring to the COS Channel where the Disconnection has
 * been received.
 */
  uint16_t Connection_Handle;
/**
 *
 */
  uint16_t Result;
} aci_l2cap_connection_update_resp_event_rp0;

/**
 * This event is generated when the central does not respond to the connection
 * update request packet with a connection update response packet or a command
 * reject packet within 30 seconds.
 */
typedef PACKED(struct) aci_l2cap_proc_timeout_event_rp0_s {
/**
 * Handle of the connection related to this L2CAP procedure.
 */
  uint16_t Connection_Handle;
/**
 * Length of following data
 */
  uint8_t Data_Length;
/**
 *
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 3)/sizeof(uint8_t)];
} aci_l2cap_proc_timeout_event_rp0;

/**
 * The event is given by the L2CAP layer when a connection update request is
 * received from the peripheral. The upper layer which receives this event has
 * to respond by sending a @ref aci_l2cap_connection_parameter_update_resp
 * command.
 */
typedef PACKED(struct) aci_l2cap_connection_update_req_event_rp0_s {
/**
 * Handle of the connection related to this L2CAP procedure.
 */
  uint16_t Connection_Handle;
/**
 * This is the identifier which associates the request to the response.
 */
  uint8_t Identifier;
/**
 * Length of the L2CAP connection update request.
 */
  uint16_t L2CAP_Length;
/**
 * Minimum value for the connection event interval. This shall be less than or
 * equal to Connection_Interval_Max. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Min;
/**
 * Maximum value for the connection event interval. This shall be greater than
 * or equal to Connection_Interval_Min. Time = N * 1.25 msec.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval_Max;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Max_Latency;
/**
 * Defines connection timeout parameter in the following manner: Timeout
 * Multiplier * 10ms.
 * Values:
 * - 10 (100 ms)  ... 3200 (32000 ms) 
 */
  uint16_t Timeout_Multiplier;
} aci_l2cap_connection_update_req_event_rp0;

/**
 * Event raised when an L2CAP channel using LE Credit Based Flow Control mode is
 * terminated.
 */
typedef PACKED(struct) aci_l2cap_cos_disconnection_complete_event_rp0_s {
/**
 * Handle identifying the connection.
 */
  uint16_t Connection_Handle;
/**
 * The local channel endpoint that identifies the L2CAP channel.
 */
  uint16_t CID;
} aci_l2cap_cos_disconnection_complete_event_rp0;

/**
 * Event raised when an L2CAP_FLOW_CONTROL_CREDIT_IND is received from the peer,
 * which means that it is capable of receiving additional K-frames (for example
 * after it has processed one or more K-frames) in LE Credit Based Flow Control.
 */
typedef PACKED(struct) aci_l2cap_cos_flow_control_credit_event_rp0_s {
/**
 * Handle identifying the connection.
 */
  uint16_t Connection_Handle;
/**
 * The local channel endpoint that identifies the L2CAP channel.
 */
  uint16_t CID;
/**
 * The number of additional k-frames that the peer's L2CAP layer entity can
 * receive.
 */
  uint16_t TX_Credits;
/**
 * Remaining number of K-frames that local L2CAP layer entity can currently send
 * to the peer.
 * Values:
 * - 1 ... 65535
 */
  uint16_t TX_Credit_Balance;
} aci_l2cap_cos_flow_control_credit_event_rp0;

/**
 * Event raised when an SDU to be transmitted has been processed by the local
 * L2CAP layer entity.
 */
typedef PACKED(struct) aci_l2cap_cos_sdu_data_tx_event_rp0_s {
/**
 * Handle identifying the connection.
 */
  uint16_t Connection_Handle;
/**
 * The local channel endpoint that identifies the L2CAP channel.
 */
  uint16_t CID;
/**
 *
 */
  uint16_t SDU_Length;
/**
 * Remaining number of K-frames that local L2CAP layer entity can currently send
 * to the peer.
 */
  uint16_t TX_Credit_Balance;
} aci_l2cap_cos_sdu_data_tx_event_rp0;

/**
 * Event raised when an SDU has been received.
 */
typedef PACKED(struct) aci_l2cap_cos_sdu_data_rx_nwk_event_rp0_s {
/**
 * Handle identifying the connection.
 */
  uint16_t Connection_Handle;
/**
 * The local channel endpoint that identifies the L2CAP channel.
 */
  uint16_t CID;
/**
 * Remaining number of K-frames that local L2CAP layer entity can currently
 * receive from the peer. If automatic management of credits is enabled, this
 * number is automatically changed after the SDU is extracted.
 */
  uint16_t RX_Credit_Balance;
/**
 *
 */
  uint16_t SDU_Length;
/**
 *
 */
  uint8_t SDU_Data[(HCI_MAX_PAYLOAD_SIZE - 8)/sizeof(uint8_t)];
} aci_l2cap_cos_sdu_data_rx_nwk_event_rp0;

/**
 * Event generated when receiving an L2CAP_CREDIT_BASED_RECONFIGURE_REQ or an
 * L2CAP_CREDIT_BASED_RECONFIGURE_RSP, to reconfigure one or more (up to 5)
 * L2CAP Enhanced Credit Based Flow Control channels.
 */
typedef PACKED(struct) aci_l2cap_cos_reconfiguration_event_rp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 *
 * Values:
 * - 0x00: L2CAP_ECFC_RECONFIGURE_REQ
 * - 0x01: L2CAP_ECFC_RECONFIGURE_RESP
 */
  uint8_t Event_Type;
/**
 * Result of the connection request if Event_Type is L2CAP_ECFC_CONN_RESP. To be
 * ignored if Event_Type is L2CAP_ECFC_CONN_REQ.
 * Values:
 * - 0x0000: L2CAP_RECONFIG_SUCCESSFUL
 * - 0x0001: L2CAP_RECONFIG_FAIL_MTU_REDUCTION_NOT_ALLOWED
 * - 0x0002: L2CAP_RECONFIG_FAIL_MPS_REDUCTION_NOT_ALLOWED
 * - 0x0003: L2CAP_RECONFIG_FAIL_INVALID_CID
 * - 0x0004: L2CAP_RECONFIG_FAIL_UNACCEPTABLE_PARAMETERS
 */
  uint16_t Result;
/**
 * This is the identifier which associates the request to the response.
 */
  uint8_t Identifier;
/**
 * The maximum SDU size (in octets) that the remote L2CAP layer entity can
 * receive on this channel after successful reconfiguration.
 * Values:
 * - 64 ... 65535
 */
  uint16_t Peer_MTU;
/**
 * The maximum PDU payload size (in octets) that the remote L2CAP layer entity
 * can receive on this channel after successful reconfiguration.
 * Values:
 * - 64 ... 65535
 */
  uint16_t Peer_MPS;
/**
 * Number of Channels that are going to be created.
 * Values:
 * - 0x01 ... 0x05
 */
  uint8_t CID_Count;
/**
 * Array of up to 5 two-octet values that represent the local channel endpoints
 * identifying the EATT channels to be reconfigured.
 */
  uint16_t Local_CID[(HCI_MAX_PAYLOAD_SIZE - 11)/sizeof(uint16_t)];
} aci_l2cap_cos_reconfiguration_event_rp0;

/**
 * This event is generated when the central rejects a L2CAP request.
 */
typedef PACKED(struct) aci_l2cap_command_reject_event_rp0_s {
/**
 * Handle identifying the connection.
 */
  uint16_t Connection_Handle;
/**
 * This is the identifier which associates the request to the response.
 */
  uint8_t Identifier;
/**
 * Reason
 */
  uint16_t Reason;
/**
 * Length of following data
 */
  uint8_t Data_Length;
/**
 * Data field associated with Reason
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_l2cap_command_reject_event_rp0;

/**
 * Event generated when a request is received from the peer to create one L2CAP
 * Credit Based Flow Control channel or one or more (up to 5) L2CAP Enhanced
 * Credit Based Flow Control channels.
 */
typedef PACKED(struct) aci_l2cap_cos_connection_req_event_rp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Type of channel: LE Credit Based Flow Control Mode or Enhanced Credit Based
 * Flow Control Mode.
 * Values:
 * - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 * - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 */
  uint8_t Channel_Type;
/**
 * This is the identifier which associates the request to the response.
 */
  uint8_t Identifier;
/**
 * Simplified Protocol/Service Multiplexer
 * Values:
 * - 0x0001 ... 0x00FF
 */
  uint16_t SPSM;
/**
 * The maximum SDU size (in octets) that the remote L2CAP layer entity can
 * receive on this channel.
 * Values:
 * - 64 ... 65535
 */
  uint16_t Peer_MTU;
/**
 * The maximum PDU payload size (in octets) that the remote L2CAP layer entity
 * can receive on this channel.
 * Values:
 * - 64 ... 65535
 */
  uint16_t Peer_MPS;
/**
 * The number of K-frames that can be sent to the L2CAP layer entity of the peer
 * device as soon as the L2CAP channel is established.
 */
  uint16_t Initial_Credits;
/**
 *
 */
  uint8_t CID_Count;
} aci_l2cap_cos_connection_req_event_rp0;

/**
 * Event generated when a response is received from the peer to create one L2CAP
 * Credit Based Flow Control channel or one or more (up to 5) L2CAP Enhanced
 * Credit Based Flow Control channels.
 */
typedef PACKED(struct) aci_l2cap_cos_connection_resp_event_rp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Type of channel: LE Credit Based Flow Control Mode or Enhanced Credit Based
 * Flow Control Mode.
 * Values:
 * - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 * - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 */
  uint8_t Channel_Type;
/**
 * The maximum SDU size (in octets) that the remote L2CAP layer entity can
 * receive on this channel.
 * Values:
 * - 64 ... 65535
 */
  uint16_t Peer_MTU;
/**
 * The maximum PDU payload size (in octets) that the remote L2CAP layer entity
 * can receive on this channel.
 * Values:
 * - 64 ... 65535
 */
  uint16_t Peer_MPS;
/**
 * The number of K-frames that can be sent to the L2CAP layer entity of the peer
 * device as soon as the L2CAP channel is established.
 */
  uint16_t Initial_Credits;
/**
 * Outcome of the connetion request.
 * Values:
 * - 0x0000: L2CAP_CONN_SUCCESSFUL
 * - 0x0002: L2CAP_CONN_FAIL_SPSM_NOT_SUPPORTED
 * - 0x0004: L2CAP_CONN_FAIL_INSUFFICIENT_RESOURCES
 * - 0x0005: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHENTICATION
 * - 0x0006: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHORIZATION
 * - 0x0007: L2CAP_CONN_FAIL_KEY_SIZE_TOO_SHORT
 * - 0x0008: L2CAP_CONN_FAIL_INSUFFICIENT_ENCRYPTION
 * - 0x0009: L2CAP_CONN_FAIL_INVALID_SOURCE_CID
 * - 0x000A: L2CAP_CONN_FAIL_SOURCE_CID_ALREADY_ALLOCATED
 * - 0x000B: L2CAP_CONN_FAIL_UNACCEPTABLE_PARAMETERS
 * - 0x000C: L2CAP_CONN_FAIL_INVALID_PARAMETERS
 * - 0x000D: L2CAP_CONN_FAIL_NO_INFO
 * - 0x000E: L2CAP_CONN_FAIL_AUTHENTICATION_PENDING
 * - 0x000F: L2CAP_CONN_FAIL_AUTHORIZATION_PENDING
 */
  uint16_t Result;
/**
 * Number of channels to be created which are present in the L2CAP Credit Based
 * Connection Request. The effective number of channels that will be opened can
 * be less than this value (see Local_CID) .
 * Values:
 * - 0x01 ... 0x05
 */
  uint8_t CID_Count;
/**
 * Array of up to 5 two-octet values that represent the local channel endpoints.
 */
  uint16_t CID[(HCI_MAX_PAYLOAD_SIZE - 12)/sizeof(uint16_t)];
} aci_l2cap_cos_connection_resp_event_rp0;

/**
 * This event is generated to the application by the GATT server when a client
 * modifies any attribute on the server, as consequence of one of the following
 * GATT procedures: - write without response - signed write without response -
 * write characteristic value - write long characteristic value - reliable
 * write.
 */
typedef PACKED(struct) aci_gatt_srv_attribute_modified_event_rp0_s {
/**
 * The connection handle which modified the attribute.
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * Handle of the attribute that was modified.
 */
  uint16_t Attr_Handle;
/**
 * Length of Attr_Data in octets
 */
  uint16_t Attr_Data_Length;
/**
 * A concatenation of Handle, Length and Values for each of the attributes being
 * notified.
 */
  uint8_t Attr_Data[(HCI_MAX_PAYLOAD_SIZE - 8)/sizeof(uint8_t)];
} aci_gatt_srv_attribute_modified_event_rp0;

/**
 * This event is generated by the client/server to the application on a GATT
 * timeout (30 seconds). This is a critical event that should not happen during
 * normal operating conditions. It is an indication of either a major disruption
 * in the communication link or a mistake in the application which does not
 * provide a reply to GATT procedures. After this event, the GATT channel is
 * closed and no more GATT communication can be performed. The applications is
 * exptected to issue an @ref aci_gap_terminate to disconnect from the peer
 * device.
 */
typedef PACKED(struct) aci_gatt_proc_timeout_event_rp0_s {
/**
 * Connection handle on which the GATT procedure has timed out
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
} aci_gatt_proc_timeout_event_rp0;

/**
 * This event is generated in response to an Exchange MTU request (local or from
 * the peer), which can happen only on an unenhaced ATT bearer. See
 * aci_gatt_clt_exchange_config().
 */
typedef PACKED(struct) aci_att_exchange_mtu_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * ATT_MTU value agreed between server and client. This is the minimum of the
 * Client Rx MTU and the Server Rx MTU.
 */
  uint16_t MTU;
} aci_att_exchange_mtu_resp_event_rp0;

/**
 * This event is generated in response to a Find Information Request during a
 * discovery procedure for all the characteristic descriptors. See
 * aci_gatt_clt_disc_all_char_desc() and Find Information Response in Bluetooth
 * Core spec.
 */
typedef PACKED(struct) aci_att_clt_find_info_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * Format of the hanndle-uuid pairs
 */
  uint8_t Format;
/**
 * Length of Handle_UUID_Pair in octets
 */
  uint16_t Event_Data_Length;
/**
 * A sequence of handle-uuid pairs. if format=1, each pair is:[2 octets for
 * handle, 2 octets for UUIDs], if format=2, each pair is:[2 octets for handle,
 * 16 octets for UUIDs]
 */
  uint8_t Handle_UUID_Pair[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} aci_att_clt_find_info_resp_event_rp0;

/**
 * This event is generated during a "discover service by UUID" procedure. See
 * aci_gatt_clt_disc_primary_service_by_uuid().
 */
typedef PACKED(struct) aci_att_clt_find_by_type_value_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * Number of attribute, group handle pairs
 */
  uint8_t Num_of_Handle_Pair;
/**
 * See @ref Attribute_Group_Handle_Pair_t
 */
  packed_Attribute_Group_Handle_Pair_t Attribute_Group_Handle_Pair[(HCI_MAX_PAYLOAD_SIZE - 5)/sizeof(packed_Attribute_Group_Handle_Pair_t)];
} aci_att_clt_find_by_type_value_resp_event_rp0;

/**
 * This event is generated in response to a ATT_READ_BY_TYPE_REQ, during a "find
 * included service" procedure or a "discover all characteristics" procedure.
 * See aci_gatt_clt_find_included_services() and
 * aci_gatt_clt_disc_all_char_of_service().
 */
typedef PACKED(struct) aci_att_clt_read_by_type_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * The size of each attribute handle-value pair
 */
  uint8_t Handle_Value_Pair_Length;
/**
 * Length of Handle_Value_Pair_Data in octets
 */
  uint16_t Data_Length;
/**
 * Attribute Data List as defined in Bluetooth Core v4.1 spec. A sequence of
 * handle-value pairs: [2 octets for Attribute Handle, (Handle_Value_Pair_Length
 * - 2 octets) for Attribute Value]
 */
  uint8_t Handle_Value_Pair_Data[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} aci_att_clt_read_by_type_resp_event_rp0;

/**
 * This event is generated in response to a Read Request. See
 * aci_gatt_clt_read().
 */
typedef PACKED(struct) aci_att_clt_read_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * Length of following data
 */
  uint16_t Event_Data_Length;
/**
 * The value of the attribute.
 */
  uint8_t Attribute_Value[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_att_clt_read_resp_event_rp0;

/**
 * This event can be generated during a read long characteristic value
 * procedure. See aci_gatt_clt_read_long().
 */
typedef PACKED(struct) aci_att_clt_read_blob_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * Length of following data
 */
  uint16_t Event_Data_Length;
/**
 * Part of the attribute value.
 */
  uint8_t Attribute_Value[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_att_clt_read_blob_resp_event_rp0;

/**
 * This event is generated in response to a Read Multiple Request. See
 * aci_gatt_clt_read_multiple_char_value().
 */
typedef PACKED(struct) aci_att_clt_read_multiple_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * Length of following data
 */
  uint16_t Event_Data_Length;
/**
 * A set of two or more values. A concatenation of attribute values for each of
 * the attribute handles in the request in the order that they were requested.
 */
  uint8_t Set_Of_Values[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_att_clt_read_multiple_resp_event_rp0;

/**
 * This event is generated in response to a Read By Group Type Request, during a
 * "discover all primary services" procedure. See
 * aci_gatt_clt_disc_all_primary_services().
 */
typedef PACKED(struct) aci_att_clt_read_by_group_type_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * The size of each attribute data
 */
  uint8_t Attribute_Data_Length;
/**
 * Length of Attribute_Data_List in octets
 */
  uint16_t Data_Length;
/**
 * Attribute Data List as defined in Bluetooth Core v4.1 spec. A sequence of
 * attribute handle, end group handle, attribute value tuples: [2 octets for
 * Attribute Handle, 2 octets End Group Handle, (Attribute_Data_Length - 4
 * octets) for Attribute Value]
 */
  uint8_t Attribute_Data_List[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} aci_att_clt_read_by_group_type_resp_event_rp0;

