sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
/**
 * This event is generated in response to an ATT_PREPARE_WRITE_REQ during a
 * write long characteristic value procedure. See aci_gatt_clt_write_long().
 */
typedef PACKED(struct) aci_att_clt_prepare_write_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * The handle of the attribute to be written
 */
  uint16_t Attribute_Handle;
/**
 * The offset of the first octet to be written.
 */
  uint16_t Offset;
/**
 * Length of Part_Attribute_Value in octets
 */
  uint16_t Part_Attribute_Value_Length;
/**
 * The value of the attribute to be written
 */
  uint8_t Part_Attribute_Value[(HCI_MAX_PAYLOAD_SIZE - 10)/sizeof(uint8_t)];
} aci_att_clt_prepare_write_resp_event_rp0;

/**
 * This event is generated in response to an ATT Execute Write Request, during a
 * write long characteristic value procedure. See aci_gatt_clt_write_long().
 */
typedef PACKED(struct) aci_att_clt_exec_write_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
} aci_att_clt_exec_write_resp_event_rp0;

/**
 * This event is generated when an indication is received from the server.
 */
typedef PACKED(struct) aci_gatt_clt_indication_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * The handle of the attribute
 */
  uint16_t Attribute_Handle;
/**
 * Length of Attribute_Value in octets
 */
  uint16_t Attribute_Value_Length;
/**
 * The current value of the attribute
 */
  uint8_t Attribute_Value[(HCI_MAX_PAYLOAD_SIZE - 8)/sizeof(uint8_t)];
} aci_gatt_clt_indication_event_rp0;

/**
 * This event is generated when a notification is received from the server.
 */
typedef PACKED(struct) aci_gatt_clt_notification_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * The handle of the attribute
 */
  uint16_t Attribute_Handle;
/**
 * Length of Attribute_Value in octets
 */
  uint16_t Attribute_Value_Length;
/**
 * The current value of the attribute
 */
  uint8_t Attribute_Value[(HCI_MAX_PAYLOAD_SIZE - 8)/sizeof(uint8_t)];
} aci_gatt_clt_notification_event_rp0;

/**
 * This event is generated when a GATT client procedure completes either with
 * error or successfully.
 */
typedef PACKED(struct) aci_gatt_clt_proc_complete_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Error_Code;
} aci_gatt_clt_proc_complete_event_rp0;

/**
 * This event is generated when an Error Response is received from the server.
 * The error response can be given by the server at the end of one of the GATT
 * discovery procedures. This does not mean that the procedure ended with an
 * error, but this error event is part of the procedure itself.
 */
typedef PACKED(struct) aci_gatt_clt_error_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * The request that generated this error response
 */
  uint8_t Req_Opcode;
/**
 * The attribute handle that generated this error response
 */
  uint16_t Attribute_Handle;
/**
 * The reason why the request has generated an error response (ATT error codes)
 * Values:
 * - 0x01: Invalid handle
 * - 0x02: Read not permitted
 * - 0x03: Write not permitted
 * - 0x04: Invalid PDU
 * - 0x05: Insufficient authentication
 * - 0x06: Request not supported
 * - 0x07: Invalid offset
 * - 0x08: Insufficient authorization
 * - 0x09: Prepare queue full
 * - 0x0A: Attribute not found
 * - 0x0B: Attribute not long
 * - 0x0C: Insufficient encryption key size
 * - 0x0D: Invalid attribute value length
 * - 0x0E: Unlikely error
 * - 0x0F: Insufficient encryption
 * - 0x10: Unsupported group type
 * - 0x11: Insufficient resources
 */
  uint8_t Error_Code;
} aci_gatt_clt_error_resp_event_rp0;

/**
 * This event can be generated during a "Discover Characteristics By UUID"
 * procedure or a "Read using Characteristic UUID" procedure. During a "Discover
 * Characteristics By UUID" procedure, Attribute_Value is a characteristic
 * declaration as defined in Bluetooth Core spec (vol.3, Part G, ch. 3.3.1),
 * i.e. it is composed by: Characteristic Properties (1 octet), Characteristic
 * Value Handle (2 octets) and Characteristic UUID (2 or 16 octets). During a
 * "Read using Characteristic UUID" procedure, Attribute_Value is the value of
 * the characteristic.
 */
typedef PACKED(struct) aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * The handle of the attribute
 */
  uint16_t Attribute_Handle;
/**
 * Length of Attribute_Value in octets
 */
  uint8_t Attribute_Value_Length;
/**
 * The attribute value will be a characteristic declaration as defined in
 * Bluetooth Core spec (vol.3, Part G, ch. 3.3.1), when a "Discover
 * Characteristics By UUID" has been started. It will be the value of the
 * Characteristic if a "Read using Characteristic UUID" has been performed.
 */
  uint8_t Attribute_Value[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0;

/**
 * Each time Bluetooth stack raises the error code
 * BLE_STATUS_INSUFFICIENT_RESOURCES, aci_gatt_tx_pool_available_event() is
 * generated as soon as the available buffer size is greater than maximum ATT
 * MTU.
 */
typedef PACKED(struct) aci_gatt_tx_pool_available_event_rp0_s {
/**
 * Connection handle related to the request
 */
  uint16_t Connection_Handle;
/**
 * Not used.
 */
  uint16_t Available_Buffers;
} aci_gatt_tx_pool_available_event_rp0;

/**
 * This event is generated when the client has sent the confirmation to a
 * previously sent indication.
 */
typedef PACKED(struct) aci_gatt_srv_confirmation_event_rp0_s {
/**
 * Connection handle related to the event.
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
} aci_gatt_srv_confirmation_event_rp0;

/**
 * This event is generated when an execute write request is received from the
 * peer. This happens when the client wants to write a long attribute (i.e. an
 * attribute with a size greater than ATT_MTU -3) or more than one attribute in
 * a single operation. The aci_gatt_srv_resp command must be sent to give a
 * response to the peer.
 */
typedef PACKED(struct) aci_att_srv_exec_write_req_event_rp0_s {
/**
 * Handle identifying the connection where the execute write operation has been
 * received.
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * If 1, peer wants to execute all the queued writes. If 0, all queued writes
 * must be discarded.
 * Values:
 * - 0x00: FLUSH
 * - 0x01: EXECUTE
 */
  uint8_t Flags;
} aci_att_srv_exec_write_req_event_rp0;

/**
 * This event is generated if authorization is needed to access the attribute
 * value. aci_gatt_srv_authorize_resp_nwk command must be sent in response to
 * this event.
 */
typedef PACKED(struct) aci_gatt_srv_authorize_nwk_event_rp0_s {
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Conn_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 *
 */
  uint16_t Attr_Handle;
/**
 *
 * Values:
 * - 0x00: Read
 * - 0x10: Write Request
 * - 0x11: Write Command or Signed Write Command
 * - 0x12: Prepare Write Request
 */
  uint8_t Operation_Type;
/**
 * Offset from which the value needs to be read or write
 * Values:
 * - 0 ... 511
 */
  uint16_t Attr_Val_Offset;
/**
 * Length of Data field
 */
  uint8_t Data_Length;
/**
 * The data that the client has requested to write
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 10)/sizeof(uint8_t)];
} aci_gatt_srv_authorize_nwk_event_rp0;

/**
 * This event is generated in response to a Read Multiple Variable Request. See
 * aci_gatt_clt_read_multiple_var_len_char_value().
 */
typedef PACKED(struct) aci_att_clt_read_multiple_var_len_resp_event_rp0_s {
/**
 * Connection handle related to the response
 */
  uint16_t Connection_Handle;
/**
 * If equal to 0x0004, the event is related to an unenhanced ATT bearer.
 * Otherwise, the value is the local endpoint identifying the enhanced ATT
 * bearer.
 */
  uint16_t CID;
/**
 * Length of following data
 */
  uint16_t Event_Data_Length;
/**
 * A set of two or more values. A concatenation of attribute values for each of
 * the attribute handles in the request in the order that they were requested.
 */
  uint8_t Set_Of_Values[(HCI_MAX_PAYLOAD_SIZE - 6)/sizeof(uint8_t)];
} aci_att_clt_read_multiple_var_len_resp_event_rp0;

/**
 * The LE Connection Complete event indicates to both of the Hosts forming the
 * connection that a new connection has been created. Upon the creation of the
 * connection a Connection_Handle shall be assigned by the Controller, and
 * passed to the Host in this event. If the connection establishment fails this
 * event shall be provided to the Host that had issued the LE_Create_Connection
 * command. This event indicates to the Host which issued a LE_Create_Connection
 * command and received a Command Status event if the connection establishment
 * failed or was successful. The Central_Clock_Accuracy parameter is only valid
 * for a peripheral. On a central, this parameter shall be set to 0x00.
 */
typedef PACKED(struct) hci_le_connection_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Role of the local device in the connection.
 * Values:
 * - 0x00: Central
 * - 0x01: Peripheral
 */
  uint8_t Role;
/**
 * The address type of the peer device.
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address or Random Device Address of the peer device
 */
  uint8_t Peer_Address[6];
/**
 * Connection interval used on this connection. Time = N * 1.25 msec
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Peripheral_Latency;
/**
 * Supervision timeout for the LE Link. It shall be a multiple of 10 ms and
 * larger than (1 + connPeripheralLatency) * connInterval * 2. Time = N * 10
 * msec.
 * Values:
 * - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 */
  uint16_t Supervision_Timeout;
/**
 * Central clock accuracy. Only valid for a Peripheral.
 * Values:
 * - 0x00: 500 ppm
 * - 0x01: 250 ppm
 * - 0x02: 150 ppm
 * - 0x03: 100 ppm
 * - 0x04: 75 ppm
 * - 0x05: 50 ppm
 * - 0x06: 30 ppm
 * - 0x07: 20 ppm
 */
  uint8_t Central_Clock_Accuracy;
} hci_le_connection_complete_event_rp0;

/**
 * The LE Advertising Report event indicates that a Bluetooth device or multiple
 * Bluetooth devices have responded to an active scan or received some
 * information during a passive scan. The Controller may queue these advertising
 * reports and send information from multiple devices in one LE Advertising
 * Report event.
 */
typedef PACKED(struct) hci_le_advertising_report_event_rp0_s {
/**
 * Number of responses in this event.
 * Values:
 * - 0x01
 */
  uint8_t Num_Reports;
/**
 * See @ref Advertising_Report_t
 */
  packed_Advertising_Report_t Advertising_Report[(HCI_MAX_PAYLOAD_SIZE - 1)/sizeof(packed_Advertising_Report_t)];
} hci_le_advertising_report_event_rp0;

/**
 * The LE Connection Update Complete event is used to indicate that the
 * Controller process to update the connection has completed. On a peripheral,
 * if no connection parameters are updated, then this event shall not be issued.
 * On a central, this event shall be issued if the Connection_Update command was
 * sent.
 */
typedef PACKED(struct) hci_le_connection_update_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Connection interval used on this connection. Time = N * 1.25 msec
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Peripheral_Latency;
/**
 * Supervision timeout for the LE Link. It shall be a multiple of 10 ms and
 * larger than (1 + connPeripheralLatency) * connInterval * 2. Time = N * 10
 * msec.
 * Values:
 * - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 */
  uint16_t Supervision_Timeout;
} hci_le_connection_update_complete_event_rp0;

/**
 * The LE Read Remote Features Complete event is used to indicate the completion
 * of the process of the Controller obtaining the used features of the remote
 * Bluetooth device specified by the Connection_Handle event parameter.
 */
typedef PACKED(struct) hci_le_read_remote_features_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Bit Mask List of used LE features. For details see LE Link Layer
 * specification.
 */
  uint8_t LE_Features[8];
} hci_le_read_remote_features_complete_event_rp0;

/**
 * The LE Long Term Key Request event indicates that the central device is
 * attempting to encrypt or re-encrypt the link and is requesting the Long Term
 * Key from the Host. (See [Vol 6] Part B, Section 5.1.3).
 */
typedef PACKED(struct) hci_le_long_term_key_request_event_rp0_s {
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * 64-bit random number
 */
  uint8_t Random_Number[8];
/**
 * 16-bit encrypted diversifier
 */
  uint16_t Encrypted_Diversifier;
} hci_le_long_term_key_request_event_rp0;

/**
 * The LE Data Length Change event notifies the Host of a change to either the
 * maximum Payload length or the maximum transmission time of Data Channel PDUs
 * in either direction. The values reported are the maximum that will actually
 * be used on the connection following the change.
 */
typedef PACKED(struct) hci_le_data_length_change_event_rp0_s {
/**
 * Connection_Handle to be used to identify a connection.
 */
  uint16_t Connection_Handle;
/**
 * The maximum number of payload octets in a Link Layer Data Channel PDU that
 * the local Controller will send on this connection (connEffectiveMaxTxOctets
 * defined in [Vol 6] Part B, Section 4.5.10). Range 0x001B-0x00FB (0x0000 -
 * 0x001A and 0x00FC - 0xFFFF Reserved for future use)
 */
  uint16_t MaxTxOctets;
/**
 * The maximum time that the local Controller will take to send a Link Layer
 * Data Channel PDU on this connection (connEffectiveMaxTx-Time defined in [Vol
 * 6] Part B, Section 4.5.10). Range 0x0148-0x0848 (0x0000 - 0x0127 and 0x0849 -
 * 0xFFFF Reserved for future use)
 */
  uint16_t MaxTxTime;
/**
 * The maximum number of payload octets in a Link Layer Data Channel PDU that
 * the local controller expects to receive on this connection
 * (connEfectiveMaxRxOctets defined in [Vol 6] Part B, Section 4.5.10). Range
 * 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for future use)
 */
  uint16_t MaxRxOctets;
/**
 * The maximum time that the local Controller expects to take to receive a Link
 * Layer Data Channel PDU on this connection (connEffectiveMax-RxTime defined in
 * [Vol 6] Part B, Section 4.5.10). Range 0x0148-0x0848 (0x0000 - 0x0127 and
 * 0x0849 - 0xFFFF Reserved for future use)
 */
  uint16_t MaxRxTime;
} hci_le_data_length_change_event_rp0;

/**
 * This event is generated when local P-256 key generation is complete.
 */
typedef PACKED(struct) hci_le_read_local_p256_public_key_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Local P-256 public key.
 */
  uint8_t Local_P256_Public_Key[64];
} hci_le_read_local_p256_public_key_complete_event_rp0;

/**
 * This event indicates that LE Diffie Hellman key generation has been completed
 * by the Controller.
 */
typedef PACKED(struct) hci_le_generate_dhkey_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Diffie Hellman Key
 */
  uint8_t DHKey[32];
} hci_le_generate_dhkey_complete_event_rp0;

/**
 * The LE Enhanced Connection Complete event indicates to both of the Hosts
 * forming the connection that a new connection has been created. Upon the
 * creation of the connection a Connection_Handle shall be assigned by the
 * Controller, and passed to the Host in this event. If the connection
 * establishment fails, this event shall be provided to the Host that had issued
 * the LE_Create_Connection command. If this event is unmasked and LE Connection
 * Complete event is unmasked, only the LE Enhanced Connection Complete event is
 * sent when a new connection has been completed. This event indicates to the
 * Host that issued a LE_Create_Connection command and received a Command Status
 * event if the connection establishment failed or was successful. The
 * Central_Clock_Accuracy parameter is only valid for a peripheral. On a
 * central, this parameter shall be set to 0x00.
 */
typedef PACKED(struct) hci_le_enhanced_connection_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle to be used to identify the connection with the peer device.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Role of the local device in the connection.
 * Values:
 * - 0x00: Central
 * - 0x01: Peripheral
 */
  uint8_t Role;
/**
 * 0x00 Public Device Address 0x01 Random Device Address 0x02 Public Identity
 * Address (Corresponds to Resolved Private Address) 0x03 Random (Static)
 * Identity Address (Corresponds to Resolved Private Address)
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Public Identity Address
 * - 0x03: Random (Static) Identity Address
 */
  uint8_t Peer_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address or
 * Random (static) Identity Address of the device to be connected.
 */
  uint8_t Peer_Address[6];
/**
 * Resolvable Private Address being used by the local device for this
 * connection. This is only valid when the Own_Address_Type is set to 0x02 or
 * 0x03. For other Own_Address_Type values, the Controller shall return all
 * zeros.
 */
  uint8_t Local_Resolvable_Private_Address[6];
/**
 * Resolvable Private Address being used by the peer device for this connection.
 * This is only valid for Peer_Address_Type 0x02 and 0x03. For other
 * Peer_Address_Type values, the Controller shall return all zeros.
 */
  uint8_t Peer_Resolvable_Private_Address[6];
/**
 * Connection interval used on this connection. Time = N * 1.25 msec
 * Values:
 * - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t Connection_Interval;
/**
 * Maximum Peripheral latency for the connection in number of connection events.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Peripheral_Latency;
/**
 * Supervision timeout for the LE Link. It shall be a multiple of 10 ms and
 * larger than (1 + connPeripheralLatency) * connInterval * 2. Time = N * 10
 * msec.
 * Values:
 * - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 */
  uint16_t Supervision_Timeout;
/**
 * Central clock accuracy. Only valid for a Peripheral.
 * Values:
 * - 0x00: 500 ppm
 * - 0x01: 250 ppm
 * - 0x02: 150 ppm
 * - 0x03: 100 ppm
 * - 0x04: 75 ppm
 * - 0x05: 50 ppm
 * - 0x06: 30 ppm
 * - 0x07: 20 ppm
 */
  uint8_t Central_Clock_Accuracy;
} hci_le_enhanced_connection_complete_event_rp0;

/**
 * The HCI_LE_Directed_Advertising_Report event indicates that directed
 * advertisements have been received where the advertiser is using a resolvable
 * private address for the TargetA field of the advertising PDU which the
 * Controller is unable to resolve and the Scanning_Filter_Policy is equal to
 * 0x02 or 0x03. Direct_Address_Type and Direct_Address specify the address the
 * directed advertisements are being directed to. Address_Type and Address
 * specify the address of the advertiser sending the directed advertisements.
 * The Controller may queue these advertising reports and send information from
 * multiple advertisers in one HCI_LE_Directed_Advertising_Report event. This
 * event shall only be generated if scanning was enabled using the
 * HCI_LE_Set_Scan_Enable command. It only reports advertising events that used
 * legacy advertising PDUs.
 */
typedef PACKED(struct) hci_le_directed_advertising_report_event_rp0_s {
/**
 * Number of responses in this event.
 * Values:
 * - 0x01
 */
  uint8_t Num_Reports;
/**
 * See @ref Direct_Advertising_Report_t
 */
  packed_Direct_Advertising_Report_t Direct_Advertising_Report[(HCI_MAX_PAYLOAD_SIZE - 1)/sizeof(packed_Direct_Advertising_Report_t)];
} hci_le_directed_advertising_report_event_rp0;

