sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
/**
 * The LE PHY Update Complete Event is used to indicate that the Controller has
 * changed the transmitter PHY or receiver PHY in use. If the Controller changes
 * the transmitter PHY, the receiver PHY, or both PHYs, this event shall be
 * issued. If an LE_Set_PHY command was sent and the Controller determines that
 * neither PHY will change as a result, it issues this event immediately.
 */
typedef PACKED(struct) hci_le_phy_update_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection_Handle to be used to identify a connection.
 */
  uint16_t Connection_Handle;
/**
 * The transmitter PHY for the connection
 * Values:
 * - 0x01: The transmitter PHY for the connection is LE 1M
 * - 0x02: The transmitter PHY for the connection is LE 2M
 * - 0x03: The transmitter PHY for the connection is LE Coded
 */
  uint8_t TX_PHY;
/**
 * The receiver PHY for the connection
 * Values:
 * - 0x01: The receiver PHY for the connection is LE 1M
 * - 0x02: The receiver PHY for the connection is LE 2M
 * - 0x03: The receiver PHY for the connection is LE Coded
 */
  uint8_t RX_PHY;
} hci_le_phy_update_complete_event_rp0;

/**
 * The LE Extended Advertising Report event indicates that one or more Bluetooth
 * devices have responded to an active scan or have broadcast advertisements
 * that were received during a passive scan. The Controller may coalesce
 * multiple advertising reports from the same or different advertisers into a
 * single LE Extended Advertising Report event, provided all the parameters from
 * all the advertising reports fit in a single HCI event. This event shall only
 * be generated if scanning was enabled using the LE Set Extended Scan Enable
 * command. It reports advertising events using either legacy or extended
 * advertising PDUs. The Controller may split the data from a single
 * advertisement (whether one PDU or several) into several reports. If so, each
 * report except the last shall have an Event_Type with a data status field of
 * "incomplete, more data to come", while the last shall have the value
 * "complete"; the Address_Type, Address, Advertising_SID, Primary_PHY, and
 * Secondary_PHY fields shall be the same in all the reports. When a scan
 * response is received, bits 0-2 and 4 of the event type shall indicate the
 * properties of the original advertising event. An Event_Type with a data
 * status field of "incomplete, data truncated" indicates that the Controller
 * attempted to receive an AUX_CHAIN_IND PDU but was not successful.
 */
typedef PACKED(struct) hci_le_extended_advertising_report_event_rp0_s {
/**
 * Number of separate reports in the event
 * Values:
 * - 0x01 ... 0x0A
 */
  uint8_t Num_Reports;
/**
 * See @ref Extended_Advertising_Report_t
 */
  packed_Extended_Advertising_Report_t Extended_Advertising_Report[(HCI_MAX_PAYLOAD_SIZE - 1)/sizeof(packed_Extended_Advertising_Report_t)];
} hci_le_extended_advertising_report_event_rp0;

/**
 * The LE Periodic Advertising Report event indicates that the Controller has
 * received a Periodic Advertising packet. The Sync_Handle parameter indicates
 * the identifier for the periodic advertisements specified by the Advertising
 * SID subfield of the ADI field in the ADV_EXT_IND PDU. The Controller may
 * split the data from a single periodic advertisement (whether one PDU or
 * several) into several reports. If so, each report except the last shall have
 * a Data_Status of "incomplete, more data to come", while the last shall have
 * the value "complete". A Data_Status of "incomplete, data truncated" indicates
 * that the Controller attempted to receive an AUX_CHAIN_IND PDU but was not
 * successful. The Unused parameter shall be set to 0xFF by the Controller and
 * ignored by the Host.
 */
typedef PACKED(struct) hci_le_periodic_advertising_sync_established_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * Advertising SID subfield in the ADI field of the PDU
 * Values:
 * - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
 * - 0x10 ... 0xFF: Reserved for future use
 */
  uint8_t Advertising_SID;
/**
 * Advertising Adress Type
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 * - 0x03: Random (static) Identity Address (corresponds to Resolved PrivateAddress)
 */
  uint8_t Advertiser_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the advertiser
 */
  uint8_t Advertiser_Address[6];
/**
 * Advertiser PHY
 * Values:
 * - 0x01: Advertiser PHY is LE 1M
 * - 0x02: Advertiser PHY is LE 2M
 * - 0x03: Advertiser PHY is LE Coded
 * - 0x04 ... 0xFF: Reserved for future use
 */
  uint8_t Advertiser_PHY;
/**
 * Periodic Advertising Interval Time = N * 1.25 ms Time Range: 7.5 ms to
 * 81.91875 s
 * Values:
 * - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 */
  uint16_t Periodic_Advertising_Interval;
/**
 * Advertiser Clock Accuracy
 * Values:
 * - 0x00: 500 ppm
 * - 0x01: 250 ppm
 * - 0x02: 150 ppm
 * - 0x03: 100 ppm
 * - 0x04: 75 ppm
 * - 0x05: 50 ppm
 * - 0x06: 30 ppm
 * - 0x07: 20 ppm
 * - 0x08 ... 0xFF: Reserved for future use
 */
  uint8_t Advertiser_Clock_Accuracy;
} hci_le_periodic_advertising_sync_established_event_rp0;

/**
 * The LE Periodic Advertising Report event indicates that the Controller has
 * received a Periodic Advertising packet. The Sync_Handle parameter indicates
 * the identifier for the periodic advertisements specified by the Advertising
 * SID subfield of the ADI field in the ADV_EXT_IND PDU. The Controller may
 * split the data from a single periodic advertisement (whether one PDU or
 * several) into several reports. If so, each report except the last shall have
 * a Data_Status of "incomplete, more data to come", while the last shall have
 * the value "complete". A Data_Status of "incomplete, data truncated" indicates
 * that the Controller attempted to receive an AUX_CHAIN_IND PDU but was not
 * successful. The Unused parameter shall be set to 0xFF by the Controller and
 * ignored by the Host.
 */
typedef PACKED(struct) hci_le_periodic_advertising_report_event_rp0_s {
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * TX Power. Units: dBm
 * Values:
 * - -127 ... 126
 * - 127: NA
 */
  int8_t TX_Power;
/**
 * RSSI value Units: dBm
 * Values:
 * - -127 ... 20: RSSI value
 * - 127: RSSI is not available
 */
  int8_t RSSI;
/**
 *
 * Values:
 * - 0x00: AoA Constant Tone Extension
 * - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 * - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 * - 0xFF: No Constant Tone Extension
 */
  uint8_t CTE_Type;
/**
 * Data Status
 * Values:
 * - 0x00: Data complete
 * - 0x01: Data incomplete, more data to come
 * - 0x02: Data incomplete, data truncated, no more to come
 * - 0x03 ... 0xFF: Reserved for future use
 */
  uint8_t Data_Status;
/**
 * Length of the Data field
 * Values:
 * - 0 ... 247: Length of the Data field
 * - 248 ... 255: Reserved for future use
 */
  uint8_t Data_Length;
/**
 * Data received from a Periodic Advertising packet
 */
  uint8_t Data[(HCI_MAX_PAYLOAD_SIZE - 7)/sizeof(uint8_t)];
} hci_le_periodic_advertising_report_event_rp0;

/**
 * The LE Periodic Advertising Sync Lost event indicates that the Controller has
 * not received a Periodic Advertising packet identified by Sync_Handle within
 * the timeout period.
 */
typedef PACKED(struct) hci_le_periodic_advertising_sync_lost_event_rp0_s {
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
} hci_le_periodic_advertising_sync_lost_event_rp0;

/**
 * The LE Advertising Set Terminated event indicates that the Controller has
 * terminated advertising in the advertising sets specified by the
 * Advertising_Handle parameter. This event shall be generated every time
 * connectable advertising in an advertising set results in a connection being
 * created. This event shall only be generated if advertising was enabled using
 * the LE Set Extended Advertising Enable command. The Connection_Handle
 * parameter is only valid when advertising ends because a connection was
 * created. If the Max_Extended_Advertising_Events parameter in the
 * LE_Set_Extended_Advertising_Enable command was non-zero, the
 * Num_Completed_Extended_Advertising_Events parameter shall be set to the
 * number of completed extended advertising events the Controller had
 * transmitted when either the duration elapsed or the maximum number of
 * extended advertising events was reached; otherwise it shall be set to zero.
 * If advertising has terminated as a result of the advertising duration
 * elapsing, the Status parameter shall be set to the error code Advertising
 * Timeout (0x3C). If advertising has terminated because the
 * Max_Extended_Advertising_Events was reached, the Status parameter shall be
 * set to the error code Limit Reached (0x43).
 */
typedef PACKED(struct) hci_le_advertising_set_terminated_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Advertising handle in which advertising has ended
 * Values:
 * - 0x00 ... 0xEF: Advertising_Handle in which advertising has ended
 * - 0xF0 ... 0xFF: Reserved for future use
 */
  uint8_t Advertising_Handle;
/**
 * Connection_Handle to be used to identify a connection.
 */
  uint16_t Connection_Handle;
/**
 * Number of completed extended advertising events transmitted by the Controller
 */
  uint8_t Num_Completed_Extended_Advertising_Events;
} hci_le_advertising_set_terminated_event_rp0;

/**
 * The LE Scan Request Received event indicates that a SCAN_REQ PDU or an
 * AUX_SCAN_REQ PDU has been received by the advertiser. The request contains a
 * device address from a scanner that is allowed by the advertising filter
 * policy. The advertising set is identified by Advertising_Handle. This event
 * shall only be generated if advertising was enabled using the LE Set Extended
 * Advertising Enable command. The Scanner_Address_Type and Scanner_Address
 * indicates the type of the address and the address of the scanner device.
 */
typedef PACKED(struct) hci_le_scan_request_received_event_rp0_s {
/**
 * It is used to identify an advertising set
 * Values:
 * - 0x00 ... 0xEF: Used to identify an advertising set
 * - 0xF0 ... 0xFF: Reserved for future use
 */
  uint8_t Advertising_Handle;
/**
 * Scanner address  type
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 * - 0x03: Random (static) Identity Address (corresponds to Resolved Private
Address)
 * - 0x04 ... 0xFF: Reserved for future use
 */
  uint8_t Scanner_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address or
 * Random (static) Identity Address of the advertising device
 */
  uint8_t Scanner_Address[6];
} hci_le_scan_request_received_event_rp0;

/**
 * The LE Channel Selection Algorithm Event indicates which channel selection
 * algorithm is used on a data channel connection (see [Vol 6] Part B, Section
 * 4.5.8).
 */
typedef PACKED(struct) hci_le_channel_selection_algorithm_event_rp0_s {
/**
 * Connection_Handle to be used to identify a connection.
 */
  uint16_t Connection_Handle;
/**
 * Channel selection algorithm to be  used on a data channel connection
 * Values:
 * - 0x00: LE Channel Selection Algorithm #1 is used
 * - 0x01: LE Channel Selection Algorithm #2 is used
 * - 0x02 ... 0xFF: Reserved for future use
 */
  uint8_t Channel_Selection_Algorithm;
} hci_le_channel_selection_algorithm_event_rp0;

/**
 * The HCI_LE_Connectionless_IQ_Report event is used by the Controller to report
 * IQ information from the Constant Tone Extension of a received advertising
 * packet forming part of the periodic advertising train identified by
 * Sync_Handle and to report IQ information from the Constant Tone Extension of
 * a received Test Mode packet (see Section 7.8.28). The index of the channel on
 * which the packet was received, the RSSI of the packet (excluding the Constant
 * Tone Extension), the ID of the antenna on which this was measured, the type
 * of Constant Tone Extension, the value of paEventCounter, and the IQ samples
 * of the Constant Tone Extension of the advertisement are reported in the
 * corresponding parameters. For any given sample, either both or neither of
 * I_Sample[i] and Q_Sample[i] shall equal 0x80. The Slot_Durations parameter
 * specifies the sampling rate used by the Controller. The Packet_Status
 * parameter indicates whether the received packet had a valid CRC and, if not,
 * whether the Controller has determined the position and size of the Constant
 * Tone Extension using the Length and CTETime fields. Note: A Controller is not
 * required to generate this event for packets that have a bad CRC. The Constant
 * Tone Extension format is defined in [Vol 6] Part B, Section 2.5.1. If the PDU
 * contains AdvData, then the HCI_LE_Periodic_Advertising_Report event shall be
 * generated before this event. The Controller is not required to generate this
 * event for a Constant Tone Extension with a type that it does not support.
 * This event is also used by the Controller to report that it has insufficient
 * resources to report IQ samples for all received Constant Tone Extensions and
 * has failed to sample at least once. In this case Packet_Status shall be set
 * to 0xFF and Sample_Count to 0x00.
 */
typedef PACKED(struct) hci_le_connectionless_iq_report_event_rp0_s {
/**
 * Sync_Handle identifying the periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 * - 0x0FFF: TEST_SYNC_HANDLE
 */
  uint16_t Sync_Handle;
/**
 * 0x25-0x27 can be used only for packets generated during test modes.
 * Values:
 * - 0x00 ... 0x27: The index of the channel on which the packet was received.
 */
  uint8_t Channel_Index;
/**
 * RSSI of the packet. Units: 0.1 dBm.
 * Values:
 * - -1270 ... 200
 */
  int16_t RSSI;
/**
 * Antenna ID
 */
  uint8_t RSSI_Antenna_ID;
/**
 * Type of Constant Tone Extension.
 * Values:
 * - 0x00: AoA_CTE
 * - 0x01: AoD_CTE_1us
 * - 0x02: AoD_CTE_2us
 */
  uint8_t CTE_Type;
/**
 * Sampling rate used by the Controller.
 * Values:
 * - 0x01: CTE_SLOT_1us
 * - 0x02: CTE_SLOT_2us
 */
  uint8_t Slot_Durations;
/**
 * It indicates whether the received packet had a valid CRC and, if not, whether
 * the Controller has determined the position and size of the Constant Tone
 * Extension using the Length and CTETime fields. 0x00 - CRC was correct;  0x01
 * - CRC was incorrect and the Length and CTETime fields of the packet were used
 * to determine sampling points;  0x02 - CRC was incorrect but the Controller
 * has determined the position and length of the Constant Tone Extension in some
 * other way;  0xFF - Insufficient resources to sample (Channel_Index, CTE_Type,
 * and Slot_Durations invalid).
 * Values:
 * - 0x00: CRC_OK
 * - 0x01: CRC_ERROR_1
 * - 0x02: CRC_ERROR_2
 * - 0xFF: NO_SAMPLES
 */
  uint8_t Packet_Status;
/**
 * The value of paEventCounter (see [Vol 6] Part B, Section 4.4.2.1) for the
 * reported AUX_SYNC_IND PDU
 */
  uint16_t Periodic_Event_Counter;
/**
 * Total number of sample pairs (there shall be the same number of I samples and
 * Q samples). Note: This number is dependent on the switch and sample slot
 * durations used.
 * Values:
 * - 0x00
 * - 0x09 ... 0x52
 */
  uint8_t Sample_Count;
/**
 * See @ref Samples_t
 */
  packed_Samples_t Samples[(HCI_MAX_PAYLOAD_SIZE - 12)/sizeof(packed_Samples_t)];
} hci_le_connectionless_iq_report_event_rp0;

/**
 * The HCI_LE_Connection_IQ_Report event is used by the Controller to report the
 * IQ samples from the Constant Tone Extension of a received packet (see [Vol 6]
 * Part B, Section 2.4.2.26). The Connection_Handle parameter identifies the
 * connection that corresponds to the reported information. The receiver PHY,
 * the index of the data channel, the RSSI value of the packet (excluding the
 * Constant Tone Extension), the ID of the antenna on which this was measured,
 * the type of Constant Tone Extension, the value of connEventCounter, and the
 * IQ samples of the Constant Tone Extension of the received packet are reported
 * in the corresponding parameters. For any given sample, either both or neither
 * of I_Sample[i] and Q_Sample[i] shall equal 0x80. The Slot_Durations parameter
 * specifies the sampling rate used by the Controller. The Packet_Status
 * parameter indicates whether the received packet had a valid CRC and, if not,
 * whether the Controller has determined the position and size of the Constant
 * Tone Extension using the Length and CTETime fields. Note: A Controller is not
 * required to generate this event for packets that have a bad CRC. This event
 * is also used by the Controller to report that it has insufficient resources
 * to report IQ samples for all received Constant Tone Extensions and has failed
 * to sample at least once. In this case Packet_Status shall be set to 0xFF and
 * Sample_Count to 0x00. The Constant Tone Extension format is defined in [Vol
 * 6] Part B, Section 2.1.5.
 */
typedef PACKED(struct) hci_le_connection_iq_report_event_rp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 *
 * Values:
 * - 0x01: The receiver PHY for the connection is LE 1M
 * - 0x02: The receiver PHY for the connection is LE 2M
 */
  uint8_t RX_PHY;
/**
 *
 * Values:
 * - 0x00 ... 0x24: The index of the data channel on which the Data Physical Channel PDU was received.
 */
  uint8_t Data_Channel_Index;
/**
 * RSSI of the packet. Units: 0.1 dBm.
 * Values:
 * - -1270 ... 200
 */
  int16_t RSSI;
/**
 * ID of the antenna on which the RSSI is measured
 */
  uint8_t RSSI_Antenna_ID;
/**
 *
 * Values:
 * - 0x00: AoA Constant Tone Extension
 * - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 * - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 */
  uint8_t CTE_Type;
/**
 * Sampling rate used by the Controller.
 * Values:
 * - 0x01: CTE_SLOT_1us
 * - 0x02: CTE_SLOT_2us
 */
  uint8_t Slot_Durations;
/**
 *
 * Values:
 * - 0x00: CRC was correct
 * - 0x01: CRC was incorrect and the Length and CTETime fields of the packet were used to determine sampling points
 * - 0x02: CRC was incorrect but the Controller has determined the position and length of the Constant Tone Extension in some other way
 * - 0xFF: Insufficient resources to sample (Channel_Index, CTE_Type, and Slot_Durations invalid).
 */
  uint8_t Packet_Status;
/**
 * The value of connEventCounter (see [Vol 6] Part B, Section 4.5.1) for the
 * reported PDU
 */
  uint16_t Connection_Event_Counter;
/**
 * Total number of sample pairs.
 * Values:
 * - 0x00
 * - 0x09 ... 0x52
 */
  uint8_t Sample_Count;
/**
 * See @ref Samples_t
 */
  packed_Samples_t Samples[(HCI_MAX_PAYLOAD_SIZE - 13)/sizeof(packed_Samples_t)];
} hci_le_connection_iq_report_event_rp0;

/**
 * This event is used by the Controller to report an issue following a request
 * to a peer device to reply with a packet containing an LL_CTE_RSP PDU and a
 * Constant Tone Extension. It shall be generated if the packet containing the
 * LL_CTE_RSP PDU sent in response did not contain a Constant Tone Extension or
 * if the peer rejected the request. It shall not be generated if the packet
 * containing the LL_CTE_RSP PDU had a CRC error or if the procedure response
 * timeout timer (see [Vol 6] Part B, Section 5.2) expired.
 */
typedef PACKED(struct) hci_le_cte_request_failed_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
} hci_le_cte_request_failed_event_rp0;

/**
 * The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used by the
 * Controller to report that it has received periodic advertising
 * synchronization information from the device referred to by the
 * Connection_Handle parameter and either successfully synchronized to the
 * periodic advertising train or timed out while attempting to synchronize. The
 * Status will be zero if it successfully synchronized and non-zero otherwise.
 * The Service_Data value is provided by the Host of the device sending the
 * information. The Sync_Handle identifies the periodic advertising in
 * subsequent commands and events and shall be assigned by the Controller. The
 * remaining parameters provide information about the periodic advertising (see
 * Section 7.7.65.14). If Status is non-zero, all parameter values are valid
 * except Sync_Handle, which the Host shall ignore. Note: If the Controller is
 * already synchronized to the periodic advertising train described in the
 * received information, no event will be generated.
 */
typedef PACKED(struct) hci_le_periodic_advertising_sync_transfer_received_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * A value provided by the peer device
 */
  uint16_t Service_data;
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 *
 * Values:
 * - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
 */
  uint8_t Advertising_SID;
/**
 *
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 * - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
 */
  uint8_t Advertiser_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the advertiser
 */
  uint8_t Advertiser_Address[6];
/**
 *
 * Values:
 * - 0x01: Advertiser PHY is LE 1M
 * - 0x02: Advertiser PHY is LE 2M
 * - 0x03: Advertiser PHY is LE Coded
 */
  uint8_t Advertiser_PHY;
/**
 * Periodic advertising interval. Time = N * 1.25 ms; Time Range: 7.5ms to
 * 81.91875 s.
 * Values:
 * - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 */
  uint16_t Periodic_Advertising_Interval;
/**
 * Advertiser Clock Accuracy
 * Values:
 * - 0x00: 500 ppm
 * - 0x01: 250 ppm
 * - 0x02: 150 ppm
 * - 0x03: 100 ppm
 * - 0x04: 75 ppm
 * - 0x05: 60 ppm
 * - 0x06: 30 ppm
 * - 0x07: 20 ppm
 */
  uint8_t Advertiser_Clock_Accuracy;
} hci_le_periodic_advertising_sync_transfer_received_event_rp0;

