sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_types.h
/**
 * The HCI_LE_CIS_Established event indicates that a CIS has been established,
 * was considered lost before being established, or (on the Central) was
 * rejected by the Peripheral. It is generated by the Controller in the Central
 * and Peripheral. The Connection_Handle parameter shall be set to the value
 * provided in the HCI_LE_Create_CIS command on the Central and in the
 * HCI_LE_CIS_Request event on the Peripheral. The CIG_Sync_Delay parameter is
 * the maximum time, in microseconds, for transmission of PDUs of all CISes in a
 * CIG event (see [Vol 6] Part B, Section 4.5.14.1). The CIS_Sync_Delay
 * parameter is the maximum time, in microseconds, for transmission of PDUs of
 * the specified CIS in a CIG event (see [Vol 6] Part B, Section 4.5.14.1). The
 * Transport_Latency_C_To_P and Transport_Latency_P_To_C parameters are the
 * actual transport latencies, in microseconds, as described in [Vol 6] Part G,
 * Section 3.2.1 and [Vol 6] Part G, Section 3.2.2. The PHY_C_To_P parameter
 * indicates the PHY selected for packets from the Central to Peripheral. The
 * PHY_P_To_C parameter indicates the PHY selected for packets from the
 * Peripheral to Central. The NSE, BN_C_To_P, BN_P_To_C, FT_C_To_P, FT_P_To_C,
 * Max_PDU_- C_To_P, Max_PDU_P_To_C, and ISO_Interval parameters are the
 * corresponding parameters of the CIS (see [Vol 6] Part B, Section 4.5.13.1).
 * If this event is generated on the Peripheral with a non-zero status, the
 * Controller shall delete the Connection_Handle and any associated ISO data
 * paths.
 */
typedef PACKED(struct) hci_le_cis_established_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the CIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The maximum time, in microseconds, for transmission of PDUs of all CISes in a
 * CIG event.
 * Values:
 * - 0x0000EA ... 0x7FFFFF
 */
  uint8_t CIG_Sync_Delay[3];
/**
 * The maximum time, in microseconds, for transmission of PDUs of the specified
 * CIS in a CIG event.
 * Values:
 * - 0x0000EA ... 0x7FFFFF
 */
  uint8_t CIS_Sync_Delay[3];
/**
 * The actual transport latency, in microseconds, from Central to Peripheral.
 * Values:
 * - 0x0000EA ... 0x7FFFFF
 */
  uint8_t Transport_Latency_C_To_P[3];
/**
 * The actual transport latency, in microseconds, from Peripheral to Central.
 * Values:
 * - 0x0000EA ... 0x7FFFFF
 */
  uint8_t Transport_Latency_P_To_C[3];
/**
 * The transmitter PHY of packets from the Central.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t PHY_C_To_P;
/**
 * The transmitter PHY of packets from the Peripheral.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t PHY_P_To_C;
/**
 * Maximum number of subevents in each isochronous event.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t NSE;
/**
 * The burst number for Central to Peripheral transmission.
 * Values:
 * - 0x00: No data
 * - 0x01 ... 0x0F
 */
  uint8_t BN_C_To_P;
/**
 * The burst number for Peripheral to Central transmission.
 * Values:
 * - 0x00: No data
 * - 0x01 ... 0x0F
 */
  uint8_t BN_P_To_C;
/**
 * The flush timeout, in multiples of the ISO_Interval for the CIS, for each
 * payload sent from the Central to the Peripheral.
 * Values:
 * - 0x01 ... 0xFF
 */
  uint8_t FT_C_To_P;
/**
 * The flush timeout, in multiples of the ISO_Interval for the CIS, for each
 * payload sent from the Peripheral to the Central.
 * Values:
 * - 0x01 ... 0xFF
 */
  uint8_t FT_P_To_C;
/**
 * Maximum size, in octets, of the payload from Central to Peripheral.
 * Values:
 * - 0x0000 ... 0x00FB
 */
  uint16_t Max_PDU_C_To_P;
/**
 * Maximum size, in octets, of the payload from Peripheral to Central.
 * Values:
 * - 0x0000 ... 0x00FB
 */
  uint16_t Max_PDU_P_To_C;
/**
 * The time between two consecutive CIS anchor points. Time = N * 1.25 ms.
 * Values:
 * - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t ISO_Interval;
} hci_le_cis_established_event_rp0;

/**
 * The HCI_LE_CIS_Request event indicates that a Controller has received a
 * request to establish a CIS. If the Controller receives such a request while
 * the HCI_LE_CIS_Request event is masked away, it shall reject it. Otherwise
 * the Controller shall assign a connection handle for the requested CIS and
 * send the handle in the CIS_Connection_Handle parameter of the event. When the
 * Host receives this event it shall respond with either an
 * HCI_LE_Accept_CIS_Request command or an HCI_LE_Reject_CIS_Request command
 * before the timer Connection_Accept_Timeout expires. If it does not, the
 * Controller shall reject the request and generate an HCI_LE_CIS_Established
 * event with the status Connection Accept Timeout Exceeded (0x10). The
 * ACL_Connection_Handle is the connection handle of the ACL connection that is
 * associated with the requested CIS. The CIG_ID parameter contains the
 * identifier of the CIG that contains the requested CIS. This parameter is sent
 * by the Central in the request to establish the CIS. The CIS_ID parameter
 * contains the identifier of the requested CIS. This parameter is sent by the
 * Central in the request to establish the CIS.
 */
typedef PACKED(struct) hci_le_cis_request_event_rp0_s {
/**
 * Connection handle of the ACL.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t ACL_Connection_Handle;
/**
 * Connection handle of the CIS.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t CIS_Connection_Handle;
/**
 * Identifier of the CIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t CIG_ID;
/**
 * Identifier of the CIS.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t CIS_ID;
} hci_le_cis_request_event_rp0;

/**
 * The HCI_LE_Create_BIG_Complete event indicates that the HCI_LE_Create_BIG
 * command has completed.
 */
typedef PACKED(struct) hci_le_create_big_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * The identifier of the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * The maximum time in microseconds for transmission of PDUs of all BISes in a
 * BIG event.
 * Values:
 * - 0x0000EA ... 0x7FFFFF
 */
  uint8_t BIG_Sync_Delay[3];
/**
 * The maximum delay time, in microseconds, for transmission of SDUs of all
 * BISes in a BIG event.
 * Values:
 * - 0x0000EA ... 0x7FFFFF
 */
  uint8_t Transport_Latency_BIG[3];
/**
 * The PHY used to create the BIG.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t PHY;
/**
 * The number of subevents in each BIS event in the BIG.
 * Values:
 * - 0x01 ... 0x1E
 */
  uint8_t NSE;
/**
 * The number of new payloads in each BIS event.
 * Values:
 * - 0x01 ... 0x07
 */
  uint8_t BN;
/**
 * Offset used for pre-transmissions.
 * Values:
 * - 0x00 ... 0x0F
 */
  uint8_t PTO;
/**
 * The number of times a payload is transmitted in a BIS event.
 * Values:
 * - 0x01 ... 0x0F
 */
  uint8_t IRC;
/**
 * Maximum size, in octets, of the payload.
 * Values:
 * - 0x0000 ... 0x00FB
 */
  uint16_t Max_PDU;
/**
 * The time between two consecutive BIG anchor points. Time = N * 1.25 ms.
 * Values:
 * - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t ISO_Interval;
/**
 * Total number of BISes in the BIG.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t Num_BIS;
/**
 * The connection handles of the BISes in the BIG.
 */
  uint16_t Connection_Handle[(HCI_MAX_PAYLOAD_SIZE - 18)/sizeof(uint16_t)];
} hci_le_create_big_complete_event_rp0;

/**
 * The HCI_LE_Terminate_BIG_Complete event indicates that the transmission of
 * all the BISes in the BIG are terminated.
 */
typedef PACKED(struct) hci_le_terminate_big_complete_event_rp0_s {
/**
 * The identifier of the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * Reason for termination. See Error Codes.
 */
  uint8_t Reason;
} hci_le_terminate_big_complete_event_rp0;

/**
 * The HCI_LE_BIG_Sync_Established event indicates that the
 * HCI_LE_BIG_Create_Sync command has completed.
 */
typedef PACKED(struct) hci_le_big_sync_established_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * The identifier of the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * The maximum delay time, in microseconds, for transmission of SDUs of all
 * BISes in a BIG event.
 * Values:
 * - 0x0000EA ... 0x7FFFFF
 */
  uint8_t Transport_Latency_BIG[3];
/**
 * The number of subevents in each BIS event in the BIG.
 * Values:
 * - 0x01 ... 0x1E
 */
  uint8_t NSE;
/**
 * The number of new payloads in each BIS event.
 * Values:
 * - 0x01 ... 0x07
 */
  uint8_t BN;
/**
 * Offset used for pre-transmissions.
 * Values:
 * - 0x00 ... 0x0F
 */
  uint8_t PTO;
/**
 * The number of times a payload is transmitted in a BIS event.
 * Values:
 * - 0x01 ... 0x0F
 */
  uint8_t IRC;
/**
 * Maximum size, in octets, of the payload.
 * Values:
 * - 0x0000 ... 0x00FB
 */
  uint16_t Max_PDU;
/**
 * The time between two consecutive BIG anchor points. Time = N * 1.25 ms.
 * Values:
 * - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 */
  uint16_t ISO_Interval;
/**
 * Total number of BISes in the BIG.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t Num_BIS;
/**
 * The connection handles of the BISes in the BIG.
 */
  uint16_t Connection_Handle[(HCI_MAX_PAYLOAD_SIZE - 14)/sizeof(uint16_t)];
} hci_le_big_sync_established_event_rp0;

/**
 * The HCI_LE_BIG_Sync_Lost event indicates that the Controller has not received
 * any PDUs on a BIG within the timeout period BIG_Sync_Timeout or the BIG has
 * been terminated by the remote device.
 */
typedef PACKED(struct) hci_le_big_sync_lost_event_rp0_s {
/**
 * The identifier of the BIG.
 * Values:
 * - 0x00 ... 0xEF
 */
  uint8_t BIG_Handle;
/**
 * Reason for termination. See Error Codes.
 */
  uint8_t Reason;
} hci_le_big_sync_lost_event_rp0;

/**
 * The HCI_LE_Request_Peer_SCA_Complete event indicates that the
 * HCI_LE_Request_Peer_SCA command has been completed. The Peer_Clock_Accuracy
 * parameter contains the sleep clock accuracy of the peer. The
 * Connection_Handle is the connection handle of the ACL connection in which the
 * HCI_LE_Request_Peer_SCA command is issued.
 */
typedef PACKED(struct) hci_le_request_peer_sca_complete_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle of the ACL.
 */
  uint16_t Connection_Handle;
/**
 * Sleep clock accuracy of the peer.
 * Values:
 * - 0x00: 251 ppm to 500 ppm
 * - 0x01: 151 ppm to 250 ppm
 * - 0x02: 101 ppm to 150 ppm
 * - 0x03: 76 ppm to 100 ppm
 * - 0x04: 51 ppm to 75 ppm
 * - 0x05: 31 ppm to 50 ppm
 * - 0x06: 21 ppm to 30 ppm
 * - 0x07: 0 ppm to 20 ppm
 */
  uint8_t Peer_Clock_Accuracy;
} hci_le_request_peer_sca_complete_event_rp0;

/**
 * Report a path loss threshold crossing on the ACL connection identified by the
 * Connection_Handle parameter.
 */
typedef PACKED(struct) hci_le_path_loss_threshold_event_rp0_s {
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * Current path loss (always zero or positive). Units: dB.
 * Values:
 * - 0 ... 254
 * - 255: NA
 */
  uint8_t Current_Path_Loss;
/**
 * The Zone_Entered parameter indicates which zone was entered.
 * Values:
 * - 0x00: LOW_ZONE
 * - 0x01: MIDDLE_ZONE
 * - 0x02: HIGH_ZONE
 */
  uint8_t Zone_Entered;
} hci_le_path_loss_threshold_event_rp0;

/**
 * Report the transmit power level on the ACL connection identified by the
 * Connection_Handle parameter.
 */
typedef PACKED(struct) hci_le_transmit_power_reporting_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Connection handle that identifies the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * The reason why the event was sent and the device whose transmit power level
 * is being reported. - 0x00: Local transmit power changed - 0x01: Remote
 * transmit power changed - 0x02: HCI_LE_Read_Remote_Transmit_Power_Level
 * command completed
 * Values:
 * - 0x00: LOCAL_TX_POWER_CHANGE
 * - 0x01: REMOTE_TX_POWER_CHANGE
 * - 0x02: READ_REMOTE_TX_POWER_COMPLETE
 */
  uint8_t Reason;
/**
 * PHY associated with the connection  (not necessarily the currently used one).
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY_S8
 * - 0x04: LE_CODED_PHY_S2
 */
  uint8_t PHY;
/**
 * The transmit power level for the PHY (dBm).
 * Values:
 * - -127 ... 20
 * - 126: POWER_NOT_MANAGED
 * - 127: POWER_NA
 */
  int8_t Transmit_Power_Level;
/**
 * It indicates whether the transmit power level that is being reported has
 * reached its minimum and/or maximum level. Transmit_Power_Level_Flag shall be
 * ignored if the Transmit_Power_Level parameter is set to 0x7E or 0x7F.
 * Flags:
 * - 0x01: MIN_TX_POWER_BIT
 * - 0x02: MAX_TX_POWER_BIT
 */
  uint8_t Transmit_Power_Level_Flag;
/**
 * The Delta parameter is set to the change in power level for the transmitter
 * being reported, whenever it changes its transmit power level. Delta shall be
 * ignored if the Transmit_Power_Level parameter is set to 0x7E.
 * Values:
 * - 0 ... 126
 * - 127: NA
 */
  int8_t Delta;
} hci_le_transmit_power_reporting_event_rp0;

/**
 * The HCI_LE_BIGInfo_Advertising_Report event indicates that the Controller has
 * received an Advertising PDU that contained a BIGInfo field. If the Controller
 * also generates an HCI_LE_Periodic_Advertising_Report event, the
 * HCI_LE_BIGInfo_Advertising_Report event shall immediately follow that event.
 * An HCI_LE_BIGInfo_Advertising_Report event shall be generated even if the
 * Controller is already synchronized to the BIG. The Sync_Handle parameter
 * shall identify the periodic advertising train containing the BIGInfo field
 * and shall be the same as the corresponding field in the
 * HCI_LE_Periodic_Advertising_Report event if one is generated. The Num_BIS,
 * NSE, ISO_Interval, BN, PTO, IRC, Max_PDU, SDU_Interval, Max_SDU, PHY, and
 * Framing parameters correspond to the associated fields in the BIGInfo field
 * of the Advertising PDU. If the BIGInfo field indicates that the corresponding
 * BIG is encrypted, the Encryption parameter shall be set to 0x01. Otherwise,
 * the Encryption parameter shall be set to 0x00.
 */
typedef PACKED(struct) hci_le_biginfo_advertising_report_event_rp0_s {
/**
 * Sync_Handle identifying the periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * Value of the Num_BIS subfield of the BIGInfo field.
 * Values:
 * - 0x01 ... 0x1F
 */
  uint8_t Num_BIS;
/**
 * Value of the NSE subfield of the BIGInfo field.
 */
  uint8_t NSE;
/**
 * Value of the ISO_Interval subfield of the BIGInfo field.
 */
  uint16_t ISO_Interval;
/**
 * Value of the BN subfield of the BIGInfo field.
 * Values:
 * - 0x01 ... 0x07
 */
  uint8_t BN;
/**
 * Value of the PTO subfield of the BIGInfo field.
 * Values:
 * - 0x00 ... 0x0F
 */
  uint8_t PTO;
/**
 * Value of the IRC subfield of the BIGInfo field.
 * Values:
 * - 0x01 ... 0x0F
 */
  uint8_t IRC;
/**
 * Value of the Max_PDU subfield of the BIGInfo.
 * Values:
 * - 0x0000 ... 0x00FB
 */
  uint16_t Max_PDU;
/**
 * Value of the SDU_Interval subfield of the BIGInfo field.
 * Values:
 * - 0x0000FF ... 0x0FFFFF
 */
  uint8_t SDU_Interval[3];
/**
 * Value of the Max_SDU subfield of the BIGInfo field in the Advertising PDU.
 * Values:
 * - 0x0001 ... 0x0FFF
 */
  uint16_t Max_SDU;
/**
 * The PHY on which the BIG is transmitted.
 * Values:
 * - 0x01: LE_1M_PHY
 * - 0x02: LE_2M_PHY
 * - 0x03: LE_CODED_PHY
 */
  uint8_t PHY;
/**
 * If BIG carries encrypted (1) or unencrypted (0) data.
 * Values:
 * - 0x00: Unencrypted
 * - 0x01: Encrypted
 */
  uint8_t Framing;
/**
 * If BIG carries encrypted (1) or unencrypted (0) data.
 * Values:
 * - 0x00: Unencrypted
 * - 0x01: Encrypted
 */
  uint8_t Encryption;
} hci_le_biginfo_advertising_report_event_rp0;

/**
 * The HCI_LE_Subrate_Change event is used to indicate that a Connection Subrate
 * Update procedure has completed and some parameters of the specified
 * connection have changed. This event shall be issued if the
 * HCI_LE_Subrate_Request command was issued by the Host or the parameters are
 * updated successfully following a request from the peer device. If no
 * parameters are updated following a request from the peer device or the
 * parameters were changed using the Connection Update procedure, then this
 * event shall not be issued.
 */
typedef PACKED(struct) hci_le_subrate_change_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Handle identifing the connection.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Connection_Handle;
/**
 * New subrate factor applied to the specified underlying connection interval.
 * Values:
 * - 0x0001 ... 0x01F4
 */
  uint16_t Subrate_Factor;
/**
 * New Peripheral latency for the connection in number of subrated connection
 * events,
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Peripheral_Latency;
/**
 * Number of underlying connection events to remain active after a packet
 * containing a Link Layer PDU with a non-zero Length field is sent or received.
 * Values:
 * - 0x0000 ... 0x01F3
 */
  uint16_t Continuation_Number;
/**
 * New supervision timeout for this connection. Time = N x 10 ms.
 * Values:
 * - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 */
  uint16_t Supervision_Timeout;
} hci_le_subrate_change_event_rp0;

/**
 * The HCI_LE_Periodic_Advertising_Sync_Established event indicates that the
 * Controller has received the first periodic advertising packet from an
 * advertiser after the HCI_LE_Periodic_Advertising_Create_Sync command has been
 * sent to the Controller. The Sync_Handle parameter identifies the periodic
 * advertising train in subsequent commands and events and shall be assigned by
 * the Controller. The Advertising_SID parameter is set to the value of the
 * Advertising SID subfield in the ADI field of the advertising PDU referring to
 * the periodic advertising train. The Advertiser_Address_Type and
 * Advertiser_Address parameters specify the address of the periodic advertiser.
 * The Advertiser_PHY parameter specifies the PHY used for the periodic
 * advertising. The Periodic_Advertising_Interval parameter specifies the
 * interval between the periodic advertising events. The
 * Advertiser_Clock_Accuracy parameter specifies the accuracy of the periodic
 * advertiser's clock. If the periodic advertising has subevents or response
 * slots, then the Num_- Subevents, Subevent_Interval, Response_Slot_Delay, and
 * Response_Slot_- Spacing specify the parameters for these subevents, otherwise
 * these values shall be set to 0x00.
 */
typedef PACKED(struct) hci_le_periodic_advertising_sync_established_v2_event_rp0_s {
/**
 * For standard error codes see Bluetooth specification, Vol. 2, part D. For
 * proprietary error code refer to Error codes section.
 */
  uint8_t Status;
/**
 * Sync handle that identifies the synchronization information about the
 * periodic advertising train.
 * Values:
 * - 0x0000 ... 0x0EFF
 */
  uint16_t Sync_Handle;
/**
 * Advertising SID subfield in the ADI field of the PDU
 * Values:
 * - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
 * - 0x10 ... 0xFF: Reserved for future use
 */
  uint8_t Advertising_SID;
/**
 * Advertising Adress Type
 * Values:
 * - 0x00: Public Device Address
 * - 0x01: Random Device Address
 * - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 * - 0x03: Random (static) Identity Address (corresponds to Resolved PrivateAddress)
 */
  uint8_t Advertiser_Address_Type;
/**
 * Public Device Address, Random Device Address, Public Identity Address, or
 * Random (static) Identity Address of the advertiser
 */
  uint8_t Advertiser_Address[6];
/**
 * Advertiser PHY
 * Values:
 * - 0x01: Advertiser PHY is LE 1M
 * - 0x02: Advertiser PHY is LE 2M
 * - 0x03: Advertiser PHY is LE Coded
 * - 0x04 ... 0xFF: Reserved for future use
 */
  uint8_t Advertiser_PHY;
/**
 * Periodic Advertising Interval Time = N * 1.25 ms Time Range: 7.5 ms to
 * 81.91875 s
 * Values:
 * - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 */
  uint16_t Periodic_Advertising_Interval;
/**
 * Advertiser Clock Accuracy
 * Values:
 * - 0x00: 500 ppm
 * - 0x01: 250 ppm
 * - 0x02: 150 ppm
 * - 0x03: 100 ppm
 * - 0x04: 75 ppm
 * - 0x05: 50 ppm
 * - 0x06: 30 ppm
 * - 0x07: 20 ppm
 * - 0x08 ... 0xFF: Reserved for future use
 */
  uint8_t Advertiser_Clock_Accuracy;
/**
 * Number of subevents.
 * Values:
 * - 0x00 ... 0x80
 */
  uint8_t Num_Subevents;
/**
 * Subevent interval. Time = N x 1.25 ms.
 * Values:
 * - 0x00 (NaN) : No subevents
 * - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 */
  uint8_t Subevent_Interval;
/**
 * Response slot delay. Range: 0x01 to 0xFE. Time = N x 1.25 ms
 * Values:
 * - 0x00 (NaN) : No response slots
 * - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 */
  uint8_t Response_Slot_Delay;
/**
 * Response slot spacing Range: 0x02 to 0xFF Time = N x 0.125 ms
 * Values:
 * - 0x00 (0.000 ms) : No response slots
 * - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 */
  uint8_t Response_Slot_Spacing;
} hci_le_periodic_advertising_sync_established_v2_event_rp0;

